{
  "file": "0MprWWQILbc.wav",
  "text": " I'm committed to working at a mission-driven organization like this one. I'm passionate about marketing. I haven't had any professional experience though, which I hope is okay. Let's get one thing straight. As a recent grad myself, your interviewer is not expecting you to have a wealth of professional experience. But they are looking for you to have certain qualities that make you right for the job. Chances are you have those qualities. You learn them in school, on sports teams, and extracurricular activities. Interviewing for an entry-level job requires drawing from those experiences. We're going to watch a few different entry-level job interviews in action. And I'm going to pop in throughout to give feedback on how things are going. Let's get into it. So tell me what makes you interested in this industry? Well, I've always wanted to be a product designer since I was a little girl. I, of course, didn't know what the job of a product designer was then, but I was fascinated by people like Steve Jobs and knew I wanted to make products that changed the world. I didn't focus on this so much in college. I priority was kind of having a college experience and I'm so lucky I got to do that. But now it's time to start adulting. And I really think this is the perfect place for me to grow my career. I know that if someone took a chance on me, I would succeed. Let's talk about what's working here. First of all, the candidate comes across as confident and someone who has genuine interest in the position. But she needs to be more specific. Her point about prioritizing a college experience could raise some flags. If she didn't study design in college, where has she learned it? And how does she know she'll be successful in the role? She should be explicit. Hiring managers want you to be concise and specific when talking about yourself. And let's see her redo that last part. While I didn't study product design in college, I am familiar with the relevant design tools used in this role. And I've taken online courses to learn more. I'm really excited about this opportunity. I'm a self-starter. And when I don't know the answer, I'm not afraid to ask. Hmm, much better. Now let's see how another applicant responds to a similar question. How has your experience prepared you for this role? I'm committed to working at a mission-driven organization like this one. I'm passionate about marketing. I haven't had any professional experience, though, which I hope is okay. Jumping in real quick to say, yes, it's okay if you don't have professional experience in the area you're applying for. You do have other relevant experiences and transferable skills that you can communicate during an interview. With that in mind, let's see this candidate kick off his answer a little differently. Are you using the Indeed mobile app? The app is free and makes it easy to apply right from your phone. Click the link below or just search Indeed in the app store. Well, first of all, I am committed to working at a mission-driven organization like this one. I'm passionate about marketing. My undergrad coursework focused on understanding digital culture and the importance of representation in advertising. And I'm eager to apply what I've learned to a professional setting. Also, your company values really resonate with me. They make you stand out from some of the other organizations I was considering. I was listening to a recent speech the CEO gave. And when she was talking about how we need to innovate faster and disrupt our own industry before others disrupt us, I thought to myself, this is a place I would be lucky to contribute to. Yes, there's a ton of good stuff in this response. First, referring to your academics is a great thing to do when you don't have professional experience in the area you're applying for. I also love that this candidate referenced his value alignment with the company. But what I really found impressive was how he read up on the CEO prior to the interview. He did his homework. It's a small detail that really goes the extra mile and differentiates you from other candidates. What was your biggest obstacle in college? And how did you overcome it? I'm a computer science major and prior to college, I had absolutely zero STEM experience. So when I was first learning to co-java, let's just say it was bumpy. Things just weren't clicking for me and I knew I needed to make a change. So I started a support group with some other students. I put in hours of extra work and practice time on my own. And I'm proud to say after a lot of hard work, not only did I become proficient in Java and Python, but I also was able to tutor some first-year students. I know that my career will be full of learning opportunities like this. I'm eager to face some head-on and continue to improve. Wow! This answer checked so many boxes. She was confident, concise, and kept the answer professional. You definitely don't want to talk about personal challenges in school. She showed that she has the skills to identify problems and create solutions, not to mention a willingness to pay it for it. If she has time to tutor and continue to do well in her classes, she must have some strong time management skills too. Well done! And now, here's a question that pretty much everyone is bound to hear at one point or another. So that's all I have. I'm asking all the questions. I really want to thank you for taking out the time to come in. And see you today. You're very well-versed. And before we wrap, do you have any questions for me? Um, yeah. What made you decide to go into sales? Oh, the interview isn't over. This is an essential moment. The hiring manager wants to see if you're a critical thinker and if you're curious about the organization. Asking, what did you go into sales? Helps build a relationship, but doesn't give you insight into the company. Here are some good questions to ask. What's your favorite thing about working here? What are some of the qualities that would make an entry-level candidate most successful in this role? What advice would you give your younger self starting out in this industry? We've covered a lot here that will help you ace your first interview. Everyone starts with an entry-level job. We've all been there, including myself. The fact of the matter is that you have more relevant experience than you think. And the tools to tell a story that proves it. Was this video helpful? It's so make sure to like and subscribe. You look like you're eager. I'm very good at being eager. You need to be willing. I can do work. I'm gonna do it. I've got to work before.",
  "segments": [
    {
      "id": 0,
      "text": "I'm committed to working at a mission-driven organization like this one."
    },
    {
      "id": 1,
      "text": "I'm passionate about marketing."
    },
    {
      "id": 2,
      "text": "I haven't had any professional experience though, which I hope is okay."
    },
    {
      "id": 3,
      "text": "Let's get one thing straight."
    },
    {
      "id": 4,
      "text": "As a recent grad myself, your interviewer is not expecting you to have a wealth of professional experience."
    },
    {
      "id": 5,
      "text": "But they are looking for you to have certain qualities that make you right for the job."
    },
    {
      "id": 6,
      "text": "Chances are you have those qualities."
    },
    {
      "id": 7,
      "text": "You learn them in school, on sports teams, and extracurricular activities."
    },
    {
      "id": 8,
      "text": "Interviewing for an entry-level job requires drawing from those experiences."
    },
    {
      "id": 9,
      "text": "We're going to watch a few different entry-level job interviews in action."
    },
    {
      "id": 10,
      "text": "And I'm going to pop in throughout to give feedback on how things are going."
    },
    {
      "id": 11,
      "text": "Let's get into it."
    },
    {
      "id": 12,
      "text": "So tell me what makes you interested in this industry?"
    },
    {
      "id": 13,
      "text": "Well, I've always wanted to be a product designer since I was a little girl."
    },
    {
      "id": 14,
      "text": "I, of course, didn't know what the job of a product designer was then,"
    },
    {
      "id": 15,
      "text": "but I was fascinated by people like Steve Jobs and knew I wanted to make products that changed the world."
    },
    {
      "id": 16,
      "text": "I didn't focus on this so much in college."
    },
    {
      "id": 17,
      "text": "I priority was kind of having a college experience and I'm so lucky I got to do that."
    },
    {
      "id": 18,
      "text": "But now it's time to start adulting."
    },
    {
      "id": 19,
      "text": "And I really think this is the perfect place for me to grow my career."
    },
    {
      "id": 20,
      "text": "I know that if someone took a chance on me, I would succeed."
    },
    {
      "id": 21,
      "text": "Let's talk about what's working here."
    },
    {
      "id": 22,
      "text": "First of all, the candidate comes across as confident and someone who has genuine interest in the position."
    },
    {
      "id": 23,
      "text": "But she needs to be more specific."
    },
    {
      "id": 24,
      "text": "Her point about prioritizing a college experience could raise some flags."
    },
    {
      "id": 25,
      "text": "If she didn't study design in college, where has she learned it?"
    },
    {
      "id": 26,
      "text": "And how does she know she'll be successful in the role?"
    },
    {
      "id": 27,
      "text": "She should be explicit."
    },
    {
      "id": 28,
      "text": "Hiring managers want you to be concise and specific when talking about yourself."
    },
    {
      "id": 29,
      "text": "And let's see her redo that last part."
    },
    {
      "id": 30,
      "text": "While I didn't study product design in college,"
    },
    {
      "id": 31,
      "text": "I am familiar with the relevant design tools used in this role."
    },
    {
      "id": 32,
      "text": "And I've taken online courses to learn more."
    },
    {
      "id": 33,
      "text": "I'm really excited about this opportunity."
    },
    {
      "id": 34,
      "text": "I'm a self-starter."
    },
    {
      "id": 35,
      "text": "And when I don't know the answer, I'm not afraid to ask."
    },
    {
      "id": 36,
      "text": "Hmm, much better."
    },
    {
      "id": 37,
      "text": "Now let's see how another applicant responds to a similar question."
    },
    {
      "id": 38,
      "text": "How has your experience prepared you for this role?"
    },
    {
      "id": 39,
      "text": "I'm committed to working at a mission-driven organization like this one."
    },
    {
      "id": 40,
      "text": "I'm passionate about marketing."
    },
    {
      "id": 41,
      "text": "I haven't had any professional experience, though, which I hope is okay."
    },
    {
      "id": 42,
      "text": "Jumping in real quick to say, yes, it's okay if you don't have professional experience in the area you're applying for."
    },
    {
      "id": 43,
      "text": "You do have other relevant experiences and transferable skills that you can communicate during an interview."
    },
    {
      "id": 44,
      "text": "With that in mind, let's see this candidate kick off his answer a little differently."
    },
    {
      "id": 45,
      "text": "Are you using the Indeed mobile app?"
    },
    {
      "id": 46,
      "text": "The app is free and makes it easy to apply right from your phone."
    },
    {
      "id": 47,
      "text": "Click the link below or just search Indeed in the app store."
    },
    {
      "id": 48,
      "text": "Well, first of all, I am committed to working at a mission-driven organization like this one."
    },
    {
      "id": 49,
      "text": "I'm passionate about marketing."
    },
    {
      "id": 50,
      "text": "My undergrad coursework focused on understanding digital culture and the importance of representation in advertising."
    },
    {
      "id": 51,
      "text": "And I'm eager to apply what I've learned to a professional setting."
    },
    {
      "id": 52,
      "text": "Also, your company values really resonate with me."
    },
    {
      "id": 53,
      "text": "They make you stand out from some of the other organizations I was considering."
    },
    {
      "id": 54,
      "text": "I was listening to a recent speech the CEO gave."
    },
    {
      "id": 55,
      "text": "And when she was talking about how we need to innovate faster and disrupt our own industry before others disrupt us,"
    },
    {
      "id": 56,
      "text": "I thought to myself, this is a place I would be lucky to contribute to."
    },
    {
      "id": 57,
      "text": "Yes, there's a ton of good stuff in this response."
    },
    {
      "id": 58,
      "text": "First, referring to your academics is a great thing to do when you don't have professional experience in the area you're applying for."
    },
    {
      "id": 59,
      "text": "I also love that this candidate referenced his value alignment with the company."
    },
    {
      "id": 60,
      "text": "But what I really found impressive was how he read up on the CEO prior to the interview. He did his homework."
    },
    {
      "id": 61,
      "text": "It's a small detail that really goes the extra mile and differentiates you from other candidates."
    },
    {
      "id": 62,
      "text": "What was your biggest obstacle in college? And how did you overcome it?"
    },
    {
      "id": 63,
      "text": "I'm a computer science major and prior to college, I had absolutely zero STEM experience."
    },
    {
      "id": 64,
      "text": "So when I was first learning to co-java, let's just say it was bumpy."
    },
    {
      "id": 65,
      "text": "Things just weren't clicking for me and I knew I needed to make a change."
    },
    {
      "id": 66,
      "text": "So I started a support group with some other students."
    },
    {
      "id": 67,
      "text": "I put in hours of extra work and practice time on my own."
    },
    {
      "id": 68,
      "text": "And I'm proud to say after a lot of hard work, not only did I become proficient in Java and Python, but I also was able to tutor some first-year students."
    },
    {
      "id": 69,
      "text": "I know that my career will be full of learning opportunities like this. I'm eager to face some head-on and continue to improve."
    },
    {
      "id": 70,
      "text": "Wow!"
    },
    {
      "id": 71,
      "text": "This answer checked so many boxes. She was confident, concise, and kept the answer professional."
    },
    {
      "id": 72,
      "text": "You definitely don't want to talk about personal challenges in school."
    },
    {
      "id": 73,
      "text": "She showed that she has the skills to identify problems and create solutions, not to mention a willingness to pay it for it."
    },
    {
      "id": 74,
      "text": "If she has time to tutor and continue to do well in her classes, she must have some strong time management skills too."
    },
    {
      "id": 75,
      "text": "Well done!"
    },
    {
      "id": 76,
      "text": "And now, here's a question that pretty much everyone is bound to hear at one point or another."
    },
    {
      "id": 77,
      "text": "So that's all I have. I'm asking all the questions. I really want to thank you for taking out the time to come in."
    },
    {
      "id": 78,
      "text": "And see you today. You're very well-versed."
    },
    {
      "id": 79,
      "text": "And before we wrap, do you have any questions for me?"
    },
    {
      "id": 80,
      "text": "Um, yeah."
    },
    {
      "id": 81,
      "text": "What made you decide to go into sales?"
    },
    {
      "id": 82,
      "text": "Oh, the interview isn't over. This is an essential moment."
    },
    {
      "id": 83,
      "text": "The hiring manager wants to see if you're a critical thinker and if you're curious about the organization."
    },
    {
      "id": 84,
      "text": "Asking, what did you go into sales?"
    },
    {
      "id": 85,
      "text": "Helps build a relationship, but doesn't give you insight into the company."
    },
    {
      "id": 86,
      "text": "Here are some good questions to ask."
    },
    {
      "id": 87,
      "text": "What's your favorite thing about working here?"
    },
    {
      "id": 88,
      "text": "What are some of the qualities that would make an entry-level candidate most successful in this role?"
    },
    {
      "id": 89,
      "text": "What advice would you give your younger self starting out in this industry?"
    },
    {
      "id": 90,
      "text": "We've covered a lot here that will help you ace your first interview."
    },
    {
      "id": 91,
      "text": "Everyone starts with an entry-level job. We've all been there, including myself."
    },
    {
      "id": 92,
      "text": "The fact of the matter is that you have more relevant experience than you think."
    },
    {
      "id": 93,
      "text": "And the tools to tell a story that proves it."
    },
    {
      "id": 94,
      "text": "Was this video helpful?"
    },
    {
      "id": 95,
      "text": "It's so make sure to like and subscribe."
    },
    {
      "id": 96,
      "text": "You look like you're eager."
    },
    {
      "id": 97,
      "text": "I'm very good at being eager."
    },
    {
      "id": 98,
      "text": "You need to be willing."
    },
    {
      "id": 99,
      "text": "I can do work."
    },
    {
      "id": 100,
      "text": "I'm gonna do it."
    },
    {
      "id": 101,
      "text": "I've got to work before."
    }
  ]
}