{
  "file": "1rooAWqE9mE.wav",
  "text": " Hi there, my name is Richard McMunn from the interview training website, PassMineTovue.com and in this tutorial I will teach you how to pass an engineering manager interview. So if you are applying to become an engineering manager with any organisation whatsoever, please stay tuned because I will help you to succeed. Now the questions and answers that follow are suitable for all engineering manager job roles, sectors and industries. And to help you pass your interview, this is what I'm going to cover. I will give you a list of engineering manager interview questions that I strongly recommend you prepare for. I will give you as always brilliant top scoring answers to tough engineering manager interview questions. I will give you some really important tips on how you can stand out during your interview and finally I will tell you how you can access further resources including the slides and the answers to help you succeed. And just very quickly, please make sure you connect with me on LinkedIn. I've put my LinkedIn link in the description below the video. Make sure you subscribe to the channel. Lots of you are passing your interviews as a result of the content I'm uploading and I don't want you to miss out. And finally, please give the video a like. Thank you very much. So the first question that I want you to prepare for is tell me about yourself. So this will be the first engineering manager interview question you will need to answer. Talk about your experience and the different engineering management and leadership skills you have that will help you to excel within the role. So here's a great example answer to assist you. Tell me about yourself. My name is Richard and I have applied for this engineering manager position because the skills qualities and experience I have are a strong match for the job description. I have an excellent level of technical competence. I have a solid background in engineering and I have outstanding project management skills. In previous positions I always focused on helping my employer meet their commercial and financial objectives. Now as your engineering manager I will achieve success through strong communication and interpersonal skills by making good decisions that are in the best interests of the business and by delegating to my team of engineers to ensure as much work gets completed as is achievable. If you hire me as your engineering manager you will see a fast and a media impact and I will always act as a loyal and hard working member of the organization. So that is a brilliant response that gives you something to work with when you create your answer to that first engineering manager interview question. Tell me about yourself. Now you can either pause the video if you want to and take a note of the questions and answers as we work through them together or if you wait I will soon tell you where you can download my full set of 21 engineering manager interview questions and top scoring answers including the ones we are covering today during this presentation. Question number two. What makes a good engineering manager? Now there are several qualities that help make an engineering manager perform to a high standard being commercially aware is one of them being able to manage and lead a team of engineers is another. So let's look at the others in the following answer. What makes a good engineering manager? Here we go. Four things make a good engineering manager. Experience within the industry you are working in. Personal competence being commercially aware and the ability to complete projects and tasks quickly and in line we have predetermined specifications. A good engineering manager is an all-rounder and someone who has the relevant management and leadership capabilities to lead a team of engineers to achieve very specific goals within set timeframes. Now it is essential that an engineering manager supports the senior management team and he or she works towards achieving the commercial and financial goals of the business. That's a very concise and confident answer that helps you to stand out during your engineering manager interview. Now don't go anywhere because I still have more questions and answers to give you but when you are ready if you click that link in the top right hand corner of the video it will take you through to my website passmainteview.com and you can download my full set of 21 engineering manager interview questions and top scoring answers including the ones covered during this presentation today but here is the next question to help you. Why do you want to work here as an engineering manager? So this might be posed as why do you want to work for us. Now this engineering manager interview question is assessing how much research you have carried out into their organization and whether your motivations for working there are genuine. So here is another great example answer to assist you. Why do you want to work here as an engineering manager? I want to work for you as an engineering manager because I am seeking employment with a forward thinking innovative company that wants to continually grow and thrive within its industry. I am a passionate engineering manager and I want the time I do spend at work to be put to good use. I conducted lots of research into your company before applying for this position and three things stood out. Your track record of achievement, the way you are always pushing the boundaries and seeking to improve and the fact that you are a responsible organization that wants to build a sustainable and progressive business. Now I genuinely believe my passion and the enthusiasm and levels of commitment will be a good match for your organization. That's another really good stand out answer that helps you to pass your engineering manager interview. So here is the next question. Tell us about a time when your team members disagreed on a technical solution or implementation. How did you handle the situation? Now this tough engineering manager interview question assesses your level of authority and whether you can turn a disagreement into a positive outcome for the engineering project you are leading. So here's another great answer to help you. Tell us about a time when your team members disagreed on a technical solution or implementation. How do you handle the situation? I was working in a previous engineering manager position managing a fast paced product development project with a team of six people. Now during the initial project brief, two of the engineers disagreed on the best way to implement their particular element of the project. I took control of the discussion and I asked them individually to outline their proposal including the benefits of approaching things their way. I followed up with probing questions asking them to provide real life examples of where it had worked previously. Now after listening to them, I chose the one that I felt would give the best outcome based on the project specification. As the engineering manager, I will always listen to my team's suggestions to find the best way forward and I will never be afraid to take control and make decisive decisions that will help us to quickly achieve our objectives. That's a really good answer. You are using your team's experience to help you make the right decision based on the engineering project you are leading. Here is a difficult question. If you were recruiting an engineer for your team, what would you look for? Now part of your responsibility as the engineering manager will be to recruit and hire engineers. Therefore, to do this competently, you need to know what to look for in engineering applicants. So here is a really good model answer to help you. If you were recruiting an engineer for your team, what would you look for? Here we go. There are several characteristics and traits I would look for when recruiting an engineer. Teamwork and technical competence are the first two. I would want someone who puts the needs of the team first, someone who can collaborate in a professional manner without conflict and someone who has the expertise and experience to perform their duties quickly and to the required standard. I would recruit an engineer who has a proven track record of problem solving, someone who can analyse data to develop real life engineering solutions and someone who possesses excellent communication skills. The engineer is attissued to work, their attention to detail skills and their commitment to the organisation would be other crucial factors in deciding on the right candidate. Finally, I would want to hire someone who is passionate about engineering and who takes responsibility for their own continuous learning and development. So that shows you know what to look for in the right engineering applicant and you are not afraid to hire the right person. What are your strengths and weaknesses? Now this question is guaranteed to come up during your engineering manager interview. I am going to share your response so that you give four or five strengths and then just one weakness that is not a match for the job description. So here's my example answer to help you. What are your strengths and weaknesses? My strengths include my project scheduling and completion skills. I am renowned for delivering time sensitive projects to high standards and within budget. I am a confident engineering manager who makes difficult decisions and who holds his team accountable. Other important strengths include my communication skills and my levels of commercial awareness. I will work with the company directors and executives to ensure all commercial engineering objectives are met. My weakness includes the fact that I find it hard to say no to people and I don't like asking other people for help. Now since I can remember I tend to say yes when people ask me for help or assistance even if I don't have the capacity to take on the extra work. However, when it comes to me asking for other people's help I prefer to figure things out for myself which is not always the right approach to take. I am the type of engineering manager who believes there is always something new to learn and I will always be open to constructive feedback from my seniors and directors and from other people who I respect. That's a really good answer to that. Common but difficult interview question. What are your strengths and weaknesses? Now the next thing to do is please make sure you click that link right now in the top right hand corner of the video. It will take you through to my website here, pass my interview.com and you can download my full set of 21 engineering manager interview questions and top scoring answers, including the ones I have just worked through today. It's a brilliant guide. You can see I'm covering lots of questions here that come up often during all types of engineering manager interview. So make sure you check out that guide right now on the website pass main interview.com by clicking that link in the top right hand corner of the video. Finally, don't forget to connect with me on LinkedIn. If you click the link in the description below the video you can connect with me directly on LinkedIn. It's always good to connect with like-minded professionals. Don't forget to subscribe to the channel. As I said at the start lots of you are passing your interviews and please give the video a thumbs up. Thank you so much for your support. Finally, I wish you all the best for passing your engineering manager interview and have a brilliant day.",
  "segments": [
    {
      "id": 0,
      "text": "Hi there, my name is Richard McMunn from the interview training website, PassMineTovue.com"
    },
    {
      "id": 1,
      "text": "and in this tutorial I will teach you how to pass an engineering manager interview."
    },
    {
      "id": 2,
      "text": "So if you are applying to become an engineering manager with any organisation whatsoever,"
    },
    {
      "id": 3,
      "text": "please stay tuned because I will help you to succeed."
    },
    {
      "id": 4,
      "text": "Now the questions and answers that follow are suitable for all engineering manager job"
    },
    {
      "id": 5,
      "text": "roles, sectors and industries."
    },
    {
      "id": 6,
      "text": "And to help you pass your interview, this is what I'm going to cover."
    },
    {
      "id": 7,
      "text": "I will give you a list of engineering manager interview questions that I strongly recommend"
    },
    {
      "id": 8,
      "text": "you prepare for."
    },
    {
      "id": 9,
      "text": "I will give you as always brilliant top scoring answers to tough engineering manager interview"
    },
    {
      "id": 10,
      "text": "questions."
    },
    {
      "id": 11,
      "text": "I will give you some really important tips on how you can stand out during your interview"
    },
    {
      "id": 12,
      "text": "and finally I will tell you how you can access further resources including the slides"
    },
    {
      "id": 13,
      "text": "and the answers to help you succeed."
    },
    {
      "id": 14,
      "text": "And just very quickly, please make sure you connect with me on LinkedIn."
    },
    {
      "id": 15,
      "text": "I've put my LinkedIn link in the description below the video."
    },
    {
      "id": 16,
      "text": "Make sure you subscribe to the channel."
    },
    {
      "id": 17,
      "text": "Lots of you are passing your interviews as a result of the content I'm uploading and"
    },
    {
      "id": 18,
      "text": "I don't want you to miss out."
    },
    {
      "id": 19,
      "text": "And finally, please give the video a like."
    },
    {
      "id": 20,
      "text": "Thank you very much."
    },
    {
      "id": 21,
      "text": "So the first question that I want you to prepare for is tell me about yourself."
    },
    {
      "id": 22,
      "text": "So this will be the first engineering manager interview question you will need to answer."
    },
    {
      "id": 23,
      "text": "Talk about your experience and the different engineering management and leadership skills"
    },
    {
      "id": 24,
      "text": "you have that will help you to excel within the role."
    },
    {
      "id": 25,
      "text": "So here's a great example answer to assist you."
    },
    {
      "id": 26,
      "text": "Tell me about yourself."
    },
    {
      "id": 27,
      "text": "My name is Richard and I have applied for this engineering manager position because the"
    },
    {
      "id": 28,
      "text": "skills qualities and experience I have are a strong match for the job description."
    },
    {
      "id": 29,
      "text": "I have an excellent level of technical competence."
    },
    {
      "id": 30,
      "text": "I have a solid background in engineering and I have outstanding project management skills."
    },
    {
      "id": 31,
      "text": "In previous positions I always focused on helping my employer meet their commercial and"
    },
    {
      "id": 32,
      "text": "financial objectives."
    },
    {
      "id": 33,
      "text": "Now as your engineering manager I will achieve success through strong communication and interpersonal"
    },
    {
      "id": 34,
      "text": "skills by making good decisions that are in the best interests of the business and by"
    },
    {
      "id": 35,
      "text": "delegating to my team of engineers to ensure as much work gets completed as is achievable."
    },
    {
      "id": 36,
      "text": "If you hire me as your engineering manager you will see a fast and a media impact and I"
    },
    {
      "id": 37,
      "text": "will always act as a loyal and hard working member of the organization."
    },
    {
      "id": 38,
      "text": "So that is a brilliant response that gives you something to work with when you create your"
    },
    {
      "id": 39,
      "text": "answer to that first engineering manager interview question."
    },
    {
      "id": 40,
      "text": "Tell me about yourself."
    },
    {
      "id": 41,
      "text": "Now you can either pause the video if you want to and take a note of the questions and"
    },
    {
      "id": 42,
      "text": "answers as we work through them together or if you wait I will soon tell you where you"
    },
    {
      "id": 43,
      "text": "can download my full set of 21 engineering manager interview questions and top scoring"
    },
    {
      "id": 44,
      "text": "answers including the ones we are covering today during this presentation."
    },
    {
      "id": 45,
      "text": "Question number two."
    },
    {
      "id": 46,
      "text": "What makes a good engineering manager?"
    },
    {
      "id": 47,
      "text": "Now there are several qualities that help make an engineering manager perform to a high"
    },
    {
      "id": 48,
      "text": "standard being commercially aware is one of them being able to manage and lead a team"
    },
    {
      "id": 49,
      "text": "of engineers is another."
    },
    {
      "id": 50,
      "text": "So let's look at the others in the following answer."
    },
    {
      "id": 51,
      "text": "What makes a good engineering manager?"
    },
    {
      "id": 52,
      "text": "Here we go."
    },
    {
      "id": 53,
      "text": "Four things make a good engineering manager."
    },
    {
      "id": 54,
      "text": "Experience within the industry you are working in."
    },
    {
      "id": 55,
      "text": "Personal competence being commercially aware and the ability to complete projects and"
    },
    {
      "id": 56,
      "text": "tasks quickly and in line we have predetermined specifications."
    },
    {
      "id": 57,
      "text": "A good engineering manager is an all-rounder and someone who has the relevant management"
    },
    {
      "id": 58,
      "text": "and leadership capabilities to lead a team of engineers to achieve very specific goals"
    },
    {
      "id": 59,
      "text": "within set timeframes."
    },
    {
      "id": 60,
      "text": "Now it is essential that an engineering manager supports the senior management team and he"
    },
    {
      "id": 61,
      "text": "or she works towards achieving the commercial and financial goals of the business."
    },
    {
      "id": 62,
      "text": "That's a very concise and confident answer that helps you to stand out during your engineering"
    },
    {
      "id": 63,
      "text": "manager interview."
    },
    {
      "id": 64,
      "text": "Now don't go anywhere because I still have more questions and answers to give you but"
    },
    {
      "id": 65,
      "text": "when you are ready if you click that link in the top right hand corner of the video it"
    },
    {
      "id": 66,
      "text": "will take you through to my website passmainteview.com and you can download my full set of 21 engineering"
    },
    {
      "id": 67,
      "text": "manager interview questions and top scoring answers including the ones covered during"
    },
    {
      "id": 68,
      "text": "this presentation today but here is the next question to help you."
    },
    {
      "id": 69,
      "text": "Why do you want to work here as an engineering manager?"
    },
    {
      "id": 70,
      "text": "So this might be posed as why do you want to work for us."
    },
    {
      "id": 71,
      "text": "Now this engineering manager interview question is assessing how much research you have carried"
    },
    {
      "id": 72,
      "text": "out into their organization and whether your motivations for working there are genuine."
    },
    {
      "id": 73,
      "text": "So here is another great example answer to assist you."
    },
    {
      "id": 74,
      "text": "Why do you want to work here as an engineering manager?"
    },
    {
      "id": 75,
      "text": "I want to work for you as an engineering manager because I am seeking employment with a forward"
    },
    {
      "id": 76,
      "text": "thinking innovative company that wants to continually grow and thrive within its industry."
    },
    {
      "id": 77,
      "text": "I am a passionate engineering manager and I want the time I do spend at work to be put"
    },
    {
      "id": 78,
      "text": "to good use."
    },
    {
      "id": 79,
      "text": "I conducted lots of research into your company before applying for this position and"
    },
    {
      "id": 80,
      "text": "three things stood out."
    },
    {
      "id": 81,
      "text": "Your track record of achievement, the way you are always pushing the boundaries and seeking"
    },
    {
      "id": 82,
      "text": "to improve and the fact that you are a responsible organization that wants to build a sustainable"
    },
    {
      "id": 83,
      "text": "and progressive business."
    },
    {
      "id": 84,
      "text": "Now I genuinely believe my passion and the enthusiasm and levels of commitment will be"
    },
    {
      "id": 85,
      "text": "a good match for your organization."
    },
    {
      "id": 86,
      "text": "That's another really good stand out answer that helps you to pass your engineering manager"
    },
    {
      "id": 87,
      "text": "interview."
    },
    {
      "id": 88,
      "text": "So here is the next question."
    },
    {
      "id": 89,
      "text": "Tell us about a time when your team members disagreed on a technical solution or implementation."
    },
    {
      "id": 90,
      "text": "How did you handle the situation?"
    },
    {
      "id": 91,
      "text": "Now this tough engineering manager interview question assesses your level of authority"
    },
    {
      "id": 92,
      "text": "and whether you can turn a disagreement into a positive outcome for the engineering project"
    },
    {
      "id": 93,
      "text": "you are leading."
    },
    {
      "id": 94,
      "text": "So here's another great answer to help you."
    },
    {
      "id": 95,
      "text": "Tell us about a time when your team members disagreed on a technical solution or implementation."
    },
    {
      "id": 96,
      "text": "How do you handle the situation?"
    },
    {
      "id": 97,
      "text": "I was working in a previous engineering manager position managing a fast paced product development"
    },
    {
      "id": 98,
      "text": "project with a team of six people."
    },
    {
      "id": 99,
      "text": "Now during the initial project brief, two of the engineers disagreed on the best way"
    },
    {
      "id": 100,
      "text": "to implement their particular element of the project."
    },
    {
      "id": 101,
      "text": "I took control of the discussion and I asked them individually to outline their proposal"
    },
    {
      "id": 102,
      "text": "including the benefits of approaching things their way."
    },
    {
      "id": 103,
      "text": "I followed up with probing questions asking them to provide real life examples of where"
    },
    {
      "id": 104,
      "text": "it had worked previously."
    },
    {
      "id": 105,
      "text": "Now after listening to them, I chose the one that I felt would give the best outcome based"
    },
    {
      "id": 106,
      "text": "on the project specification."
    },
    {
      "id": 107,
      "text": "As the engineering manager, I will always listen to my team's suggestions to find the"
    },
    {
      "id": 108,
      "text": "best way forward and I will never be afraid to take control and make decisive decisions"
    },
    {
      "id": 109,
      "text": "that will help us to quickly achieve our objectives."
    },
    {
      "id": 110,
      "text": "That's a really good answer."
    },
    {
      "id": 111,
      "text": "You are using your team's experience to help you make the right decision based on the"
    },
    {
      "id": 112,
      "text": "engineering project you are leading."
    },
    {
      "id": 113,
      "text": "Here is a difficult question."
    },
    {
      "id": 114,
      "text": "If you were recruiting an engineer for your team, what would you look for?"
    },
    {
      "id": 115,
      "text": "Now part of your responsibility as the engineering manager will be to recruit and hire"
    },
    {
      "id": 116,
      "text": "engineers."
    },
    {
      "id": 117,
      "text": "Therefore, to do this competently, you need to know what to look for in engineering applicants."
    },
    {
      "id": 118,
      "text": "So here is a really good model answer to help you."
    },
    {
      "id": 119,
      "text": "If you were recruiting an engineer for your team, what would you look for?"
    },
    {
      "id": 120,
      "text": "Here we go."
    },
    {
      "id": 121,
      "text": "There are several characteristics and traits I would look for when recruiting an engineer."
    },
    {
      "id": 122,
      "text": "Teamwork and technical competence are the first two."
    },
    {
      "id": 123,
      "text": "I would want someone who puts the needs of the team first, someone who can collaborate"
    },
    {
      "id": 124,
      "text": "in a professional manner without conflict and someone who has the expertise and experience"
    },
    {
      "id": 125,
      "text": "to perform their duties quickly and to the required standard."
    },
    {
      "id": 126,
      "text": "I would recruit an engineer who has a proven track record of problem solving, someone"
    },
    {
      "id": 127,
      "text": "who can analyse data to develop real life engineering solutions and someone who possesses"
    },
    {
      "id": 128,
      "text": "excellent communication skills."
    },
    {
      "id": 129,
      "text": "The engineer is attissued to work, their attention to detail skills and their commitment to"
    },
    {
      "id": 130,
      "text": "the organisation would be other crucial factors in deciding on the right candidate."
    },
    {
      "id": 131,
      "text": "Finally, I would want to hire someone who is passionate about engineering and who takes"
    },
    {
      "id": 132,
      "text": "responsibility for their own continuous learning and development."
    },
    {
      "id": 133,
      "text": "So that shows you know what to look for in the right engineering applicant and you are"
    },
    {
      "id": 134,
      "text": "not afraid to hire the right person."
    },
    {
      "id": 135,
      "text": "What are your strengths and weaknesses?"
    },
    {
      "id": 136,
      "text": "Now this question is guaranteed to come up during your engineering manager interview."
    },
    {
      "id": 137,
      "text": "I am going to share your response so that you give four or five strengths and then just"
    },
    {
      "id": 138,
      "text": "one weakness that is not a match for the job description."
    },
    {
      "id": 139,
      "text": "So here's my example answer to help you."
    },
    {
      "id": 140,
      "text": "What are your strengths and weaknesses?"
    },
    {
      "id": 141,
      "text": "My strengths include my project scheduling and completion skills."
    },
    {
      "id": 142,
      "text": "I am renowned for delivering time sensitive projects to high standards and within budget."
    },
    {
      "id": 143,
      "text": "I am a confident engineering manager who makes difficult decisions and who holds his team"
    },
    {
      "id": 144,
      "text": "accountable."
    },
    {
      "id": 145,
      "text": "Other important strengths include my communication skills and my levels of commercial awareness."
    },
    {
      "id": 146,
      "text": "I will work with the company directors and executives to ensure all commercial engineering"
    },
    {
      "id": 147,
      "text": "objectives are met."
    },
    {
      "id": 148,
      "text": "My weakness includes the fact that I find it hard to say no to people and I don't like"
    },
    {
      "id": 149,
      "text": "asking other people for help."
    },
    {
      "id": 150,
      "text": "Now since I can remember I tend to say yes when people ask me for help or assistance even"
    },
    {
      "id": 151,
      "text": "if I don't have the capacity to take on the extra work."
    },
    {
      "id": 152,
      "text": "However, when it comes to me asking for other people's help I prefer to figure things"
    },
    {
      "id": 153,
      "text": "out for myself which is not always the right approach to take."
    },
    {
      "id": 154,
      "text": "I am the type of engineering manager who believes there is always something new to learn"
    },
    {
      "id": 155,
      "text": "and I will always be open to constructive feedback from my seniors and directors and from"
    },
    {
      "id": 156,
      "text": "other people who I respect."
    },
    {
      "id": 157,
      "text": "That's a really good answer to that."
    },
    {
      "id": 158,
      "text": "Common but difficult interview question."
    },
    {
      "id": 159,
      "text": "What are your strengths and weaknesses?"
    },
    {
      "id": 160,
      "text": "Now the next thing to do is please make sure you click that link right now in the top"
    },
    {
      "id": 161,
      "text": "right hand corner of the video."
    },
    {
      "id": 162,
      "text": "It will take you through to my website here, pass my interview.com and you can download"
    },
    {
      "id": 163,
      "text": "my full set of 21 engineering manager interview questions and top scoring answers, including"
    },
    {
      "id": 164,
      "text": "the ones I have just worked through today."
    },
    {
      "id": 165,
      "text": "It's a brilliant guide."
    },
    {
      "id": 166,
      "text": "You can see I'm covering lots of questions here that come up often during all types of"
    },
    {
      "id": 167,
      "text": "engineering manager interview."
    },
    {
      "id": 168,
      "text": "So make sure you check out that guide right now on the website pass main interview.com by"
    },
    {
      "id": 169,
      "text": "clicking that link in the top right hand corner of the video."
    },
    {
      "id": 170,
      "text": "Finally, don't forget to connect with me on LinkedIn."
    },
    {
      "id": 171,
      "text": "If you click the link in the description below the video you can connect with me directly"
    },
    {
      "id": 172,
      "text": "on LinkedIn."
    },
    {
      "id": 173,
      "text": "It's always good to connect with like-minded professionals."
    },
    {
      "id": 174,
      "text": "Don't forget to subscribe to the channel."
    },
    {
      "id": 175,
      "text": "As I said at the start lots of you are passing your interviews and please give the video"
    },
    {
      "id": 176,
      "text": "a thumbs up."
    },
    {
      "id": 177,
      "text": "Thank you so much for your support."
    },
    {
      "id": 178,
      "text": "Finally, I wish you all the best for passing your engineering manager interview and have"
    },
    {
      "id": 179,
      "text": "a brilliant day."
    }
  ]
}