{
  "file": "2_4doL7pN20.wav",
  "text": " Hello there, my name is Richard McMunn from PassMyInterview.com and in this training video, I will teach you how to pass an Amazon interview by using a 3060 and 90 day plan. This is a brilliant way to make sure you stand out from the other candidates during your Amazon interview. So if you are applying for any job with this brilliant organisation, make sure you stay tuned. So to help you pass your Amazon interview, I will cover the following four things in this training video. Number one, I will explain what a 3060 and 90 day plan is for Amazon job interviews. Number two, I will tell you what you must include in your Amazon 3060 and 90 day plans. Number three, I will then teach you how to answer the difficult Amazon interview question, why should we hire you while incorporating your 3060 and 90 day plan. And then finally, I will tell you where you can instantly download my ready made 3060 and 90 day plans for Amazon job interviews. And just very quickly, if you are new to my channel, please make sure you hit that subscribe button. Thousands of you are passing your job interviews. It makes it far easier for me to help you if you are subscribed. And please hit the like button because that really does energise and motivate me to create more great content for you. Thank you very much indeed. Okay, so what is a 3060 and 90 day plan for Amazon job interviews? Please make sure you take notes. So a 3060 and 90 day plan is a printing document you take with you to the Amazon interview that tells the hiring manager what you will do in the first 90 days of starting work for Amazon to give the organization a brilliant return on your salary. So during your Amazon interview, you will give the hiring manager a copy of your 3060 and 90 day plan. And this is a brilliant thing to do because it then tells the hiring manager you are organised and you have a plan for how you are going to have a positive impact in your work. But when should you give the hiring manager your 3060 and 90 day plan? Well, the best time to give it to them is during the interview when answering the question, why should we hire you? Now later on in this tutorial, I will give you a brilliant scripted answer to the question, why should we hire you that incorporates your 3060 and 90 day plan? But first of all, let me tell you what to include in your 3060 and 90 day plan for Amazon job interviews. Again, please make sure you take notes. So on page one of your 3060 and 90 day plan, you will have your commitment to Amazon. So across the top of this first page, you are going to write my commitment to Amazon and you will then include the following statement. This will be the first thing the Amazon hiring manager is going to read on your document. This 3060 and 90 day plan highlights my commitment to continuous learning, effective collaboration and a customer-obsessed approach. By dedicating time to mastering tools, building relationships and identifying opportunities, I will quickly integrate into Amazon's culture and contribute to the company's mission of being Earth's most customer-centric company. At the end of this plan, I have allocated space to record when I have demonstrated each of the 16 Amazon leadership principles in my work. My 3060 and 90 day plans are intended to complement the work instructions and guidance I will receive from my immediate line manager. Name date signed. So at the end of this first page, you will insert your name, the date of the interview and then you will sign that commitment to Amazon. So that is really powerful because it's the first thing the hiring manager will read on your 3060 and 90 day plan. We then move on to page two of your plan and this is your first 30 days and we will call this orientation and foundation building. So this is what you are going to do in the first 30 days of working at Amazon and you will write this down. The goal is to learn the fundamentals of my role, Amazon's systems and its leadership principles and to achieve that goal, I will understand Amazon's culture and leadership principles. So I will meet with my immediate line manager to obtain a thorough brief and timeline for workplace familiarization and training. I will learn Amazon's safety procedures. I will dedicate time to reading internal resources about Amazon's 16 leadership principles and observe how these principles are reflected in day to day operations. And I will connect with colleagues to learn how these principles guide decision making. And number two, I will master internal tools and processes and to achieve that, I will dedicate time to practicing and exploring Amazon's tools, systems and workflows and use tutorials, training modules and sandbox environments to gain confidence with essential software. And then moving on to number three, I will network and build relationships. To achieve that, I will schedule one to one chats with team members, managers and cross-functional colleagues to understand their priorities and challenges. And I will actively participate in team meetings to absorb context and processes. And number four, I'm going to learn about the customer. Don't forget Amazon is customer obsessed. So achieve this goal, you will read customer reviews, feedback and industry reports to understand customer pain points and expectations and you will familiarize yourself with key Amazon products and services that are applicable to your role. And finally, the fifth thing during your first 30 days is self-development. So you will identify knowledge gaps and complete Amazon specific e-learning courses to improve technical or operational expertise. And you will at the end of the first 30 days meet with your manager to obtain feedback on your work performance during that first 30 days while working at Amazon. So that is the 30 day plan complete. In a second, we will move on to the 60 day plan, what you will do in the next 30 days while working at Amazon. But don't forget, you can download my ready made 30, 60 and 90 day plans at the end of this tutorial, so make sure you stick around. Let's move on to the 60 day plan and this will go on page three. And we will call this integration and contribution. So here's what you write on your 60 day Amazon work plan. The goal is to begin contributing to projects while deepening my understanding of Amazon's business strategy. And to achieve that goal, you will do the following things. Number one, dive deeper into business goals. So you will use downtime to read and analyze team strategy documents, product roadmaps and keep performance indicators. You will study competitors and market trends to understand how Amazon differentiates itself. Number two, you will start to build technical expertise. So you will continue practicing with Amazon specific tools and technologies seeking advanced or role-specific training resources. And you will collaborate with team members to solve real world problems and refine your technical skills. And number three, you will develop problem solving skills. So you will volunteer for small tasks or projects to apply what you have learned and identify areas for improvement. And you will practice the working backwards methodology. So for example, you will draft mock press releases for potential initiatives. Amazon has this working backwards methodology. So when it wants to launch or create a new product or service, it works backwards. So it starts with, for example, the press release. It writes the press release and what that will look like and then works backwards. And that's all about focusing on what the customer needs. And number four of your 60-day plan, you will start to expand your network and influence. So you will join employee resource groups and attend events to connect with diverse colleagues across Amazon. And you will engage in conversations with leaders to understand high level strategic priorities. And number five, you will start to focus on the customer. You will dive into customer use cases related to your role and brainstorm ways to improve customer satisfaction. And you will read leadership documents such as PRFAQs. And that stands for press release and frequently asked questions for ongoing projects. And number six, you will again focus on continuous improvement by meeting with your manager to identify skills and knowledge gaps and obtain feedback on your work performance during the first 60 days at Amazon. So that is the 60-day plan complete. It goes on page three. Let's now move on to the 90-day plan. The final 30 days of your 90 days of starting work at Amazon, this goes on page four and it is called ownership and impact. And here's what I recommend you write. The goal is to take ownership of responsibilities and deliver measurable results. To achieve that, you will do the following things. Number one, deliver tangible results. So you will complete meaningful projects or deliverables that align with team goals. You will use free time to refine deliverables by incorporating feedback and improving efficiency. Number two, you will start to innovate and propose improvements. You will identify inefficiencies or opportunities in existing workflows and propose solutions to improve processes. And you will develop a mechanism to track and measure progress for ongoing initiatives. Number three, is mentorship and knowledge sharing. You will begin sharing insights and best practices with newer hires or colleagues and use personal downtime to draft knowledge sharing documents or training materials for your team. Number four, you will strengthen cross functional collaboration. You will use free time to learn about the work of other teams that intersect with your responsibilities. And you will build relationships with stakeholders across different business units to create alignment. And number five, again, you will concentrate on continuous learning and development. You will participate in advanced training programs or certifications relevant to your role and long-term goals at Amazon. You will stay updated on Amazon News, industry developments and emerging technologies. And again, you will meet with your manager to request ongoing advice on how you can continue to develop your skills and contribute to Amazon's short, medium and long-term goals. So that is the 90-day plan now complete. And at the end of this plan, I strongly recommend you include the following pages. My commitment to Amazon's 16 leadership principles. As you probably already know, the 16 leadership principles are crucial to the success of Amazon. In my opinion, Amazon is one of the best organisations in the world. And it has achieved so much success because it has these 16 leadership principles. So I recommend you write this down. My commitment to Amazon's 16 leadership principles. I will integrate into Amazon's culture by providing examples of when I have demonstrated each of the 16 leadership principles. So you will write the leadership principle, for example, customer obsession, ownership, invent and simplify. And in the box provided, you will write the date when you have demonstrated each of the 16 leadership principles. So you will write down in the box how you demonstrated that particular leadership principle and include the date when you've actually done it. So that's your commitment to demonstrating the leadership principles in your work. Okay, now that the 3060 and 90-day plan is complete, let me teach you how to answer the Amazon interview question, why should we hire you incorporating your Amazon 3060 and 90-day plan? Once I have given you this script in answer to that question, I will tell you where you can download these ready-made Amazon 3060 and 90-day plans for all job roles. So here is how I would answer the question, why should we hire you? You should hire me to work at Amazon because I am passionate about the leadership principles, will demonstrate them in my work and I understand they are crucial to the success of this organization. I am customer-centric and understand that the Amazon would not be here without the customer. Therefore, I will obsess about customer's needs and encourage my coworkers to do the same. You should also hire me because I am passionate about this work. My skills, knowledge and experience match the job description and I will support my coworkers and other departments in achieving Amazon's commercial objectives. And finally, you should hire me to work at Amazon because I have created a 3060 and 90-day plan that details what I will do in the position to ensure you receive a positive return on my salary and I would like to give you a copy. So you then hand the hiring manager your 3060 and 90-day plans at the end of your answer. Now, in the unlikely event that the Amazon hiring manager does not say to you during the interview, why should we hire you? You can still give them this document at the end of your interview just before you leave. So at the end of your Amazon interview, you could say, I just want to say thank you very much for giving me this opportunity today. Just before I go, I would like to give you a 3060 and 90-day plan that I have created that tells you what I will do in the position if you hire me. Here is the copy. And you then leave the interview. So you are leaving that document with the hiring manager and they have the time to read through it and understand what you are going to do in the role to impress during your first 90 days. OK, so the next thing to do is click the link right now in the top right hand corner of the video head straight through to my website, pass my interview.com. And you can instantly download my ready made 3060 and 90-day plans for Amazon job interviews. This document comes as an editable Word document, which means you can edit it if you want to to suit your needs. You can print it off and take it with you to your Amazon interview. This is going to help you stand out from the other candidates. Click the link to download it straight away. Don't forget to hit the subscribe button. Please give the video a like and make sure you connect with me on LinkedIn. I have put my LinkedIn link in the description below the video. It is always an honor and a pleasure to connect with like my professional, such as yourself. Thank you very much for watching and for supporting my YouTube channel. I wish you all the very best for passing your Amazon interview. Have a wonderful day.",
  "segments": [
    {
      "id": 0,
      "text": "Hello there, my name is Richard McMunn from PassMyInterview.com and in this training video,"
    },
    {
      "id": 1,
      "text": "I will teach you how to pass an Amazon interview by using a 3060 and 90 day plan."
    },
    {
      "id": 2,
      "text": "This is a brilliant way to make sure you stand out from the other candidates during your"
    },
    {
      "id": 3,
      "text": "Amazon interview."
    },
    {
      "id": 4,
      "text": "So if you are applying for any job with this brilliant organisation, make sure you stay"
    },
    {
      "id": 5,
      "text": "tuned."
    },
    {
      "id": 6,
      "text": "So to help you pass your Amazon interview, I will cover the following four things in"
    },
    {
      "id": 7,
      "text": "this training video."
    },
    {
      "id": 8,
      "text": "Number one, I will explain what a 3060 and 90 day plan is for Amazon job interviews."
    },
    {
      "id": 9,
      "text": "Number two, I will tell you what you must include in your Amazon"
    },
    {
      "id": 10,
      "text": "3060 and 90 day plans."
    },
    {
      "id": 11,
      "text": "Number three, I will then teach you how to answer the difficult Amazon interview question,"
    },
    {
      "id": 12,
      "text": "why should we hire you while incorporating your 3060 and 90 day plan."
    },
    {
      "id": 13,
      "text": "And then finally, I will tell you where you can instantly download my ready made 3060"
    },
    {
      "id": 14,
      "text": "and 90 day plans for Amazon job interviews."
    },
    {
      "id": 15,
      "text": "And just very quickly, if you are new to my channel, please make sure you hit that subscribe"
    },
    {
      "id": 16,
      "text": "button."
    },
    {
      "id": 17,
      "text": "Thousands of you are passing your job interviews."
    },
    {
      "id": 18,
      "text": "It makes it far easier for me to help you if you are subscribed."
    },
    {
      "id": 19,
      "text": "And please hit the like button because that really does energise and motivate me to create"
    },
    {
      "id": 20,
      "text": "more great content for you."
    },
    {
      "id": 21,
      "text": "Thank you very much indeed."
    },
    {
      "id": 22,
      "text": "Okay, so what is a 3060 and 90 day plan for Amazon job interviews?"
    },
    {
      "id": 23,
      "text": "Please make sure you take notes."
    },
    {
      "id": 24,
      "text": "So a 3060 and 90 day plan is a printing document you take with you to the Amazon interview"
    },
    {
      "id": 25,
      "text": "that tells the hiring manager what you will do in the first 90 days of starting work for"
    },
    {
      "id": 26,
      "text": "Amazon to give the organization a brilliant return on your salary."
    },
    {
      "id": 27,
      "text": "So during your Amazon interview, you will give the hiring manager a copy of your 3060"
    },
    {
      "id": 28,
      "text": "and 90 day plan."
    },
    {
      "id": 29,
      "text": "And this is a brilliant thing to do because it then tells the hiring manager you are organised"
    },
    {
      "id": 30,
      "text": "and you have a plan for how you are going to have a positive impact in your work."
    },
    {
      "id": 31,
      "text": "But when should you give the hiring manager your 3060 and 90 day plan?"
    },
    {
      "id": 32,
      "text": "Well, the best time to give it to them is during the interview when answering the question,"
    },
    {
      "id": 33,
      "text": "why should we hire you?"
    },
    {
      "id": 34,
      "text": "Now later on in this tutorial, I will give you a brilliant scripted answer to the question,"
    },
    {
      "id": 35,
      "text": "why should we hire you that incorporates your 3060 and 90 day plan?"
    },
    {
      "id": 36,
      "text": "But first of all, let me tell you what to include in your 3060 and 90 day plan for Amazon"
    },
    {
      "id": 37,
      "text": "job interviews."
    },
    {
      "id": 38,
      "text": "Again, please make sure you take notes."
    },
    {
      "id": 39,
      "text": "So on page one of your 3060 and 90 day plan, you will have your commitment to Amazon."
    },
    {
      "id": 40,
      "text": "So across the top of this first page, you are going to write my commitment to Amazon"
    },
    {
      "id": 41,
      "text": "and you will then include the following statement."
    },
    {
      "id": 42,
      "text": "This will be the first thing the Amazon hiring manager is going to read on your document."
    },
    {
      "id": 43,
      "text": "This 3060 and 90 day plan highlights my commitment to continuous learning, effective collaboration"
    },
    {
      "id": 44,
      "text": "and a customer-obsessed approach."
    },
    {
      "id": 45,
      "text": "By dedicating time to mastering tools, building relationships and identifying opportunities,"
    },
    {
      "id": 46,
      "text": "I will quickly integrate into Amazon's culture and contribute to the company's mission"
    },
    {
      "id": 47,
      "text": "of being Earth's most customer-centric company."
    },
    {
      "id": 48,
      "text": "At the end of this plan, I have allocated space to record when I have demonstrated each"
    },
    {
      "id": 49,
      "text": "of the 16 Amazon leadership principles in my work."
    },
    {
      "id": 50,
      "text": "My 3060 and 90 day plans are intended to complement the work instructions and guidance I will"
    },
    {
      "id": 51,
      "text": "receive from my immediate line manager."
    },
    {
      "id": 52,
      "text": "Name date signed."
    },
    {
      "id": 53,
      "text": "So at the end of this first page, you will insert your name, the date of the interview and"
    },
    {
      "id": 54,
      "text": "then you will sign that commitment to Amazon."
    },
    {
      "id": 55,
      "text": "So that is really powerful because it's the first thing the hiring manager will read"
    },
    {
      "id": 56,
      "text": "on your 3060 and 90 day plan."
    },
    {
      "id": 57,
      "text": "We then move on to page two of your plan and this is your first 30 days and we will call"
    },
    {
      "id": 58,
      "text": "this orientation and foundation building."
    },
    {
      "id": 59,
      "text": "So this is what you are going to do in the first 30 days of working at Amazon and you will"
    },
    {
      "id": 60,
      "text": "write this down."
    },
    {
      "id": 61,
      "text": "The goal is to learn the fundamentals of my role, Amazon's systems and its leadership"
    },
    {
      "id": 62,
      "text": "principles and to achieve that goal, I will understand Amazon's culture and leadership"
    },
    {
      "id": 63,
      "text": "principles."
    },
    {
      "id": 64,
      "text": "So I will meet with my immediate line manager to obtain a thorough brief and timeline for"
    },
    {
      "id": 65,
      "text": "workplace familiarization and training."
    },
    {
      "id": 66,
      "text": "I will learn Amazon's safety procedures."
    },
    {
      "id": 67,
      "text": "I will dedicate time to reading internal resources about Amazon's 16 leadership principles"
    },
    {
      "id": 68,
      "text": "and observe how these principles are reflected in day to day operations."
    },
    {
      "id": 69,
      "text": "And I will connect with colleagues to learn how these principles guide decision making."
    },
    {
      "id": 70,
      "text": "And number two, I will master internal tools and processes and to achieve that, I will"
    },
    {
      "id": 71,
      "text": "dedicate time to practicing and exploring Amazon's tools, systems and workflows and use"
    },
    {
      "id": 72,
      "text": "tutorials, training modules and sandbox environments to gain confidence with essential software."
    },
    {
      "id": 73,
      "text": "And then moving on to number three, I will network and build relationships."
    },
    {
      "id": 74,
      "text": "To achieve that, I will schedule one to one chats with team members, managers and cross-functional"
    },
    {
      "id": 75,
      "text": "colleagues to understand their priorities and challenges."
    },
    {
      "id": 76,
      "text": "And I will actively participate in team meetings to absorb context and processes."
    },
    {
      "id": 77,
      "text": "And number four, I'm going to learn about the customer."
    },
    {
      "id": 78,
      "text": "Don't forget Amazon is customer obsessed."
    },
    {
      "id": 79,
      "text": "So achieve this goal, you will read customer reviews, feedback and industry reports to"
    },
    {
      "id": 80,
      "text": "understand customer pain points and expectations and you will familiarize yourself with key"
    },
    {
      "id": 81,
      "text": "Amazon products and services that are applicable to your role."
    },
    {
      "id": 82,
      "text": "And finally, the fifth thing during your first 30 days is self-development."
    },
    {
      "id": 83,
      "text": "So you will identify knowledge gaps and complete Amazon specific e-learning courses to improve"
    },
    {
      "id": 84,
      "text": "technical or operational expertise."
    },
    {
      "id": 85,
      "text": "And you will at the end of the first 30 days meet with your manager to obtain feedback"
    },
    {
      "id": 86,
      "text": "on your work performance during that first 30 days while working at Amazon."
    },
    {
      "id": 87,
      "text": "So that is the 30 day plan complete."
    },
    {
      "id": 88,
      "text": "In a second, we will move on to the 60 day plan, what you will do in the next 30 days while"
    },
    {
      "id": 89,
      "text": "working at Amazon."
    },
    {
      "id": 90,
      "text": "But don't forget, you can download my ready made 30, 60 and 90 day plans at the end of"
    },
    {
      "id": 91,
      "text": "this tutorial, so make sure you stick around."
    },
    {
      "id": 92,
      "text": "Let's move on to the 60 day plan and this will go on page three."
    },
    {
      "id": 93,
      "text": "And we will call this integration and contribution."
    },
    {
      "id": 94,
      "text": "So here's what you write on your 60 day Amazon work plan."
    },
    {
      "id": 95,
      "text": "The goal is to begin contributing to projects while deepening my understanding of Amazon's"
    },
    {
      "id": 96,
      "text": "business strategy."
    },
    {
      "id": 97,
      "text": "And to achieve that goal, you will do the following things."
    },
    {
      "id": 98,
      "text": "Number one, dive deeper into business goals."
    },
    {
      "id": 99,
      "text": "So you will use downtime to read and analyze team strategy documents, product roadmaps"
    },
    {
      "id": 100,
      "text": "and keep performance indicators."
    },
    {
      "id": 101,
      "text": "You will study competitors and market trends to understand how Amazon differentiates itself."
    },
    {
      "id": 102,
      "text": "Number two, you will start to build technical expertise."
    },
    {
      "id": 103,
      "text": "So you will continue practicing with Amazon specific tools and technologies seeking advanced"
    },
    {
      "id": 104,
      "text": "or role-specific training resources."
    },
    {
      "id": 105,
      "text": "And you will collaborate with team members to solve real world problems and refine your"
    },
    {
      "id": 106,
      "text": "technical skills."
    },
    {
      "id": 107,
      "text": "And number three, you will develop problem solving skills."
    },
    {
      "id": 108,
      "text": "So you will volunteer for small tasks or projects to apply what you have learned and identify"
    },
    {
      "id": 109,
      "text": "areas for improvement."
    },
    {
      "id": 110,
      "text": "And you will practice the working backwards methodology."
    },
    {
      "id": 111,
      "text": "So for example, you will draft mock press releases for potential initiatives."
    },
    {
      "id": 112,
      "text": "Amazon has this working backwards methodology."
    },
    {
      "id": 113,
      "text": "So when it wants to launch or create a new product or service, it works backwards."
    },
    {
      "id": 114,
      "text": "So it starts with, for example, the press release."
    },
    {
      "id": 115,
      "text": "It writes the press release and what that will look like and then works backwards."
    },
    {
      "id": 116,
      "text": "And that's all about focusing on what the customer needs."
    },
    {
      "id": 117,
      "text": "And number four of your 60-day plan, you will start to expand your network and influence."
    },
    {
      "id": 118,
      "text": "So you will join employee resource groups and attend events to connect with diverse"
    },
    {
      "id": 119,
      "text": "colleagues across Amazon."
    },
    {
      "id": 120,
      "text": "And you will engage in conversations with leaders to understand high level strategic priorities."
    },
    {
      "id": 121,
      "text": "And number five, you will start to focus on the customer."
    },
    {
      "id": 122,
      "text": "You will dive into customer use cases related to your role and brainstorm ways to improve"
    },
    {
      "id": 123,
      "text": "customer satisfaction."
    },
    {
      "id": 124,
      "text": "And you will read leadership documents such as PRFAQs."
    },
    {
      "id": 125,
      "text": "And that stands for press release and frequently asked questions for ongoing projects."
    },
    {
      "id": 126,
      "text": "And number six, you will again focus on continuous improvement by meeting with your manager"
    },
    {
      "id": 127,
      "text": "to identify skills and knowledge gaps and obtain feedback on your work performance during"
    },
    {
      "id": 128,
      "text": "the first 60 days at Amazon."
    },
    {
      "id": 129,
      "text": "So that is the 60-day plan complete."
    },
    {
      "id": 130,
      "text": "It goes on page three."
    },
    {
      "id": 131,
      "text": "Let's now move on to the 90-day plan."
    },
    {
      "id": 132,
      "text": "The final 30 days of your 90 days of starting work at Amazon, this goes on page four and"
    },
    {
      "id": 133,
      "text": "it is called ownership and impact."
    },
    {
      "id": 134,
      "text": "And here's what I recommend you write."
    },
    {
      "id": 135,
      "text": "The goal is to take ownership of responsibilities and deliver measurable results."
    },
    {
      "id": 136,
      "text": "To achieve that, you will do the following things."
    },
    {
      "id": 137,
      "text": "Number one, deliver tangible results."
    },
    {
      "id": 138,
      "text": "So you will complete meaningful projects or deliverables that align with team goals."
    },
    {
      "id": 139,
      "text": "You will use free time to refine deliverables by incorporating feedback and improving efficiency."
    },
    {
      "id": 140,
      "text": "Number two, you will start to innovate and propose improvements."
    },
    {
      "id": 141,
      "text": "You will identify inefficiencies or opportunities in existing workflows and propose solutions"
    },
    {
      "id": 142,
      "text": "to improve processes."
    },
    {
      "id": 143,
      "text": "And you will develop a mechanism to track and measure progress for ongoing initiatives."
    },
    {
      "id": 144,
      "text": "Number three, is mentorship and knowledge sharing."
    },
    {
      "id": 145,
      "text": "You will begin sharing insights and best practices with newer hires or colleagues and use personal"
    },
    {
      "id": 146,
      "text": "downtime to draft knowledge sharing documents or training materials for your team."
    },
    {
      "id": 147,
      "text": "Number four, you will strengthen cross functional collaboration."
    },
    {
      "id": 148,
      "text": "You will use free time to learn about the work of other teams that intersect with your responsibilities."
    },
    {
      "id": 149,
      "text": "And you will build relationships with stakeholders across different business units to create alignment."
    },
    {
      "id": 150,
      "text": "And number five, again, you will concentrate on continuous learning and development."
    },
    {
      "id": 151,
      "text": "You will participate in advanced training programs or certifications relevant to your role"
    },
    {
      "id": 152,
      "text": "and long-term goals at Amazon."
    },
    {
      "id": 153,
      "text": "You will stay updated on Amazon News, industry developments and emerging technologies."
    },
    {
      "id": 154,
      "text": "And again, you will meet with your manager to request ongoing advice on how you can continue"
    },
    {
      "id": 155,
      "text": "to develop your skills and contribute to Amazon's short, medium and long-term goals."
    },
    {
      "id": 156,
      "text": "So that is the 90-day plan now complete."
    },
    {
      "id": 157,
      "text": "And at the end of this plan, I strongly recommend you include the following pages."
    },
    {
      "id": 158,
      "text": "My commitment to Amazon's 16 leadership principles."
    },
    {
      "id": 159,
      "text": "As you probably already know, the 16 leadership principles are crucial to the success of Amazon."
    },
    {
      "id": 160,
      "text": "In my opinion, Amazon is one of the best organisations in the world."
    },
    {
      "id": 161,
      "text": "And it has achieved so much success because it has these 16 leadership principles."
    },
    {
      "id": 162,
      "text": "So I recommend you write this down."
    },
    {
      "id": 163,
      "text": "My commitment to Amazon's 16 leadership principles."
    },
    {
      "id": 164,
      "text": "I will integrate into Amazon's culture by providing examples of when I have demonstrated"
    },
    {
      "id": 165,
      "text": "each of the 16 leadership principles."
    },
    {
      "id": 166,
      "text": "So you will write the leadership principle, for example, customer obsession, ownership,"
    },
    {
      "id": 167,
      "text": "invent and simplify."
    },
    {
      "id": 168,
      "text": "And in the box provided, you will write the date when you have demonstrated each of the 16 leadership principles."
    },
    {
      "id": 169,
      "text": "So you will write down in the box how you demonstrated that particular leadership principle"
    },
    {
      "id": 170,
      "text": "and include the date when you've actually done it."
    },
    {
      "id": 171,
      "text": "So that's your commitment to demonstrating the leadership principles in your work."
    },
    {
      "id": 172,
      "text": "Okay, now that the 3060 and 90-day plan is complete, let me teach you how to answer"
    },
    {
      "id": 173,
      "text": "the Amazon interview question, why should we hire you incorporating your Amazon 3060 and 90-day plan?"
    },
    {
      "id": 174,
      "text": "Once I have given you this script in answer to that question, I will tell you where you can download"
    },
    {
      "id": 175,
      "text": "these ready-made Amazon 3060 and 90-day plans for all job roles."
    },
    {
      "id": 176,
      "text": "So here is how I would answer the question, why should we hire you?"
    },
    {
      "id": 177,
      "text": "You should hire me to work at Amazon because I am passionate about the leadership principles,"
    },
    {
      "id": 178,
      "text": "will demonstrate them in my work and I understand they are crucial to the success of this organization."
    },
    {
      "id": 179,
      "text": "I am customer-centric and understand that the Amazon would not be here without the customer."
    },
    {
      "id": 180,
      "text": "Therefore, I will obsess about customer's needs and encourage my coworkers to do the same."
    },
    {
      "id": 181,
      "text": "You should also hire me because I am passionate about this work."
    },
    {
      "id": 182,
      "text": "My skills, knowledge and experience match the job description and I will support my coworkers"
    },
    {
      "id": 183,
      "text": "and other departments in achieving Amazon's commercial objectives."
    },
    {
      "id": 184,
      "text": "And finally, you should hire me to work at Amazon because I have created a 3060 and 90-day plan"
    },
    {
      "id": 185,
      "text": "that details what I will do in the position to ensure you receive a positive return on my salary"
    },
    {
      "id": 186,
      "text": "and I would like to give you a copy."
    },
    {
      "id": 187,
      "text": "So you then hand the hiring manager your 3060 and 90-day plans at the end of your answer."
    },
    {
      "id": 188,
      "text": "Now, in the unlikely event that the Amazon hiring manager does not say to you during the interview,"
    },
    {
      "id": 189,
      "text": "why should we hire you?"
    },
    {
      "id": 190,
      "text": "You can still give them this document at the end of your interview just before you leave."
    },
    {
      "id": 191,
      "text": "So at the end of your Amazon interview, you could say,"
    },
    {
      "id": 192,
      "text": "I just want to say thank you very much for giving me this opportunity today."
    },
    {
      "id": 193,
      "text": "Just before I go, I would like to give you a 3060 and 90-day plan that I have created"
    },
    {
      "id": 194,
      "text": "that tells you what I will do in the position if you hire me."
    },
    {
      "id": 195,
      "text": "Here is the copy."
    },
    {
      "id": 196,
      "text": "And you then leave the interview."
    },
    {
      "id": 197,
      "text": "So you are leaving that document with the hiring manager and they have the time to read through it"
    },
    {
      "id": 198,
      "text": "and understand what you are going to do in the role to impress during your first 90 days."
    },
    {
      "id": 199,
      "text": "OK, so the next thing to do is click the link right now in the top right hand corner of the video"
    },
    {
      "id": 200,
      "text": "head straight through to my website, pass my interview.com."
    },
    {
      "id": 201,
      "text": "And you can instantly download my ready made 3060 and 90-day plans for Amazon job interviews."
    },
    {
      "id": 202,
      "text": "This document comes as an editable Word document, which means you can edit it if you want to"
    },
    {
      "id": 203,
      "text": "to suit your needs."
    },
    {
      "id": 204,
      "text": "You can print it off and take it with you to your Amazon interview."
    },
    {
      "id": 205,
      "text": "This is going to help you stand out from the other candidates."
    },
    {
      "id": 206,
      "text": "Click the link to download it straight away."
    },
    {
      "id": 207,
      "text": "Don't forget to hit the subscribe button."
    },
    {
      "id": 208,
      "text": "Please give the video a like and make sure you connect with me on LinkedIn."
    },
    {
      "id": 209,
      "text": "I have put my LinkedIn link in the description below the video."
    },
    {
      "id": 210,
      "text": "It is always an honor and a pleasure to connect with like my professional, such as yourself."
    },
    {
      "id": 211,
      "text": "Thank you very much for watching and for supporting my YouTube channel."
    },
    {
      "id": 212,
      "text": "I wish you all the very best for passing your Amazon interview."
    },
    {
      "id": 213,
      "text": "Have a wonderful day."
    }
  ]
}