{
  "file": "32tGDgXdqzs.wav",
  "text": " Hello, there my name is Richard McMunn from the Interview Training website, how to become.com and in this tutorial I will teach you how to pass an Amazon interview. So if you are applying for any role with this brilliant organisation, make sure you stay tuned because a promise to help you be the standout candidate at your interview. And to achieve that goal, this is what I will cover during this tutorial. I will give you a list of 7 Amazon interview questions that I strongly recommend you prepare for. Number two, I will then give you several very important tips for answering each of those 7 Amazon interview questions correctly. I will then give you a top scoring example answer to each of the 7 Amazon interview questions to help you pass at the very first attempt. And then finally, I will tell you where you can instantly download a copy of these slides and my full set of 57 Amazon interview questions and answers in a PDF guide. So lots of reasons why you should stay tuned if you have an Amazon interview coming up soon. And just very quickly, if you are new to this channel, please make sure you hit that subscribe literally thousands and thousands of you are passing your job interviews. I want to help you pass your next job interview and accelerate throughout your career. I can only do that if you are subscribed and please just give the video like because that quickly tells me that you find these tutorials useful and it also motivates me to create more content for you. Thank you very much. So the first Amazon interview question I want you to prepare for is tell me about yourself. So this will be the first Amazon interview question you must answer right at the very start of your interview. My advice is to make sure you create a positive first impression by demonstrating good manners and then talking about the skills and qualities you can bring to the Amazon role you have applied for. And tip number two, when you're answer, talk about your track record of success in previous roles and make sure you mention the Amazon leadership principles and how you will demonstrate these in the role. So let me now give you my example answer to this first Amazon interview question. Tell me about yourself. Here we go. Thank you for the opportunity to be interviewed for this position with Amazon today. I would describe myself as forward thinking. Customer centric, punctual and reliable, a calculated risk take and someone who is passionate about working for a company that thrives to be the best it can be. I researched the job description before applying for this role at Amazon and I'm confident I can not only hit the ground running in the position but also help the company achieve its long-term commercial goals. I have a track record of achievement. So for example, in previous roles I was often praised by my supervisors for my ability to provide exceptional service. The way I would encourage customers to become long-term advocates of the business by always going above and beyond and how I took ownership of difficult challenges. Now if you hire me to work at Amazon, I will demonstrate the leadership principles in my work. I will be creative and think of ways to help the business grow whilst saving money and I will take ownership of my ongoing professional development so my skills quad is knowledge are always relevant and useful to my team. That's a brilliant example answer to that first Amazon interview question. Tell me about yourself. Let's move on to the next question. Why Amazon? Why do you want to work for Amazon? Tip number one. So this next interview question comes up often during Amazon job interviews and it is assessing your motivations for joining this great organization. Now there is a lot of responsibility that comes with working for Amazon and it is important you are motivated by helping them to achieve their long-term vision. Tip number two. Talk about in your answer the opportunities you will have at Amazon to work on exciting projects with talented people who are all striving to achieve great things. Let me now give you my example answer to the second Amazon interview question. Why Amazon? Here we go. I want to work for Amazon because you are genuinely the best at what you do. This means I will get to work on exciting tasks and projects that are at the cutting edge of innovation. I will get to work alongside some of the brightest minds in an environment where everyone has a can do attitude. I want to work for Amazon because you always put the customer first in everything you do and I understand how important this is to long-term success of any business. I want to work for Amazon because there will be continuous opportunities for me to learn, improve and grow professionally. I want to work for a company that values its staff that empowers them to be the best they can be and that creates an inclusive working environment where there is opportunity for all. Working for Amazon will give me all of these things. That's another brilliant example answer that will help you pass your Amazon interview at the first attempt. Now don't go anywhere because I still have five more questions and answers to work through review. But when you are ready click that link in the top right-hand corner of the video. You can head straight through to my website how to become.com and instantly download a copy of these slides and my full set of 57 Amazon interview questions and example answers in a PDF guide so you can literally have it in your inbox within two minutes. Here's the next question. Tell me about a time when you influence the change by only asking questions. This is a difficult Amazon interview question. Tip number one. This question is an example of an Amazon behavioral interview question. You will have to answer several of these questions during your Amazon interview. Now it is important to give a specific situation where you demonstrated the scenario being assessed. Tip number two, I also strongly recommend you use a star technique to structure your answer but what is the star technique? Let me quickly tell you what it is and I will then give you an example answer. So the star technique stands for situation task action and result. You start off your answer and tell the interview with a situation you were faced with. You then move on and briefly outline the task that needed doing. You then give in depth details about the action you took to achieve the task and then finally you finish off your answer and reveal the results following your actions and it's really important to make sure the results are positive following the action that you took. So let me now give you an example answer to that question. Tell me about a time when you influence to change by only asking questions that uses the star technique and you can see how effective it is at helping you to structure your answer to Amazon behavioral interview questions. Here we go. I was in a team meeting discussing the workflow for a new project which was for a client of the company. Now two team members suggested we should use a cheaper product part for the project that would save us considerable money on the project costs and make it more profitable. They argued the client would have no idea we were using a sub-standard product part so it wasn't an issue. Now I was not comfortable with this situation because it went against our company values and it was morally wrong. So it was my task to challenge them by asking questions. I asked a team members two questions to influence their proposal. I asked them if they felt their suggestion was in line with our company values and how we were expected to treat our clients with honesty and integrity. They agreed it wasn't. I then asked them what would we do if the project failed later on down the line because of the sub-standard product part and the client then found out. I explained that the situation could be immensely damaging to our reputation to which they agreed. After putting the two questions to them they agreed it was not a good idea and we should stick to the original agreed project specification. So that's a really good answer that will help you pass your Amazon interview and you can see how effective that start technique really is helping you to give a powerful answer. Let me give you another example, Amazon behavioral interview question that uses a start technique. And that question is tell me about a time when you had to overcome a difficult challenge in the workplace. Here's my example answer to help you. When I first started working my previous role I encountered a difficult coworker. He had been with the company for many years and because I was relatively young and enthusiastic I got the impression he didn't want to help. I'd asked for his assistance and guidance on a couple of issues but he wasn't forthcoming with information. So I saw this as a challenge and it was my task to break down his barriers and get to work with him closely so I could benefit from his knowledge and expertise which would then help me to do a good job for the team. I decided to change my approach and after I found out that we both supported the same football team I started to talk about our shared interest during a work break. Now this proved to be a good move because he spoke passionately about the team we both supported and this enabled me to build a positive rapport with him. Several days later when I next asked him for guidance on a project I was working on he was more receptive and happy to advise and from that day on we became close and productive work colleagues which I believe was down to my strong communication and interpersonal skills. So that's a really good in-depth answer to that Amazon behavioral interview question tell me about when you had to overcome a difficult challenge in the workplace and it uses a start technique to great effect you can see how by learning the start technique it will really help you to get an advantage at your Amazon interview. Here's the next question. What are your strengths and weaknesses? Now again this is a common Amazon interview question that I recommend you prepare for. Try to align your strengths to the key skills and qualities that are listed on the Amazon job description and tip number two for the weakness part of your answer is important to demonstrate self awareness so do not say you don't have any weaknesses because you might then fail your interview. Here's my example answer. What are your strengths and weaknesses? My strengths include my ability to work at pace to complete all work to exacting standards to organize and prioritize my work in line with my employers goals and in fact now I always take responsibility of my own professional development. Other strengths include my strong interpersonal skills, my desire to carry out tasks and duties outside of my job description because I am passionate about learning new things and my willingness to help train up new members of staff whenever they join the team. Now my weakness is the fact I find it difficult letting go of projects. I tend to spend too long checking over completed projects to see if improvements can be made but I need to learn to let finish to projects go and move on to the next one and this is definitely something I am working hard on to improve. That's a really good answer again that's going to help you. I'll share your Amazon interview at the first attempt. Here's an next question. Why should we hire you to work at Amazon? Tip number one this is another tough but common Amazon interview question that needs a confident answer. Don't just give one reason why they should hire you to work at Amazon. Think of several reasons that demonstrate you can add value to the organization in the position you have applied for so here's my example answer. Why should we hire you to work at Amazon? Here we go. You should hire me because I have the experience and knowledge to excel in this role. This means I will contribute positively to Amazon's long-term vision and I will be a positive role model for the organization whilst helping customers and interacting with co-workers clients and stakeholders. You should hire me because I have a good understanding of the 16 leadership principles and I will strive to demonstrate these in my work. You should hire me because I am a calculated risk taker and I will be creative and think of ways to help Amazon grow whilst at the same time helping you to save money by being frugal where possible. Finally you should hire me because I am very much open to learning and I am a big advocate of change. I know that Amazon must always change and respond to the needs of its customers if it is to continually be the market leader and I will always support you in that change. That's a really good answer another cracking answer that will help you pass your interview with confidence. Here's the next question. Tell me about a time when you demonstrated one of the leadership principles in the workplace. This is a difficult question to answer correctly. So it's one of the toughest Amazon interview questions in my opinion. My advice is to make sure you learn the 16 Amazon leadership principles before you attend your interview. Now I have placed links in the description below this video to several tutorials right here on YouTube where I teach you the leadership principles and also give you several additional leadership principles into view questions that I recommend you prepare. So make sure you check those out once I have given you the answer in a second. Tip number two at the start of your answer to this question. Tell the interviewer which leadership principles your answer relates to. Let me give you my example response. Tell me about a time when you demonstrated one of the leadership principles in the workplace. Here we go. I recently demonstrated in my last job the leadership principle of have back-bone disagree and commit. A customer wanted a refund but their reason went against the company's refund policy. They were two days over the time limit to qualify for a refund but I felt the company should honor it anyway because the customer was not satisfied with the product and I felt it was more important to give exceptional service as they would then hopefully use the company's products again in the future. However, when I asked my manager for permission to give the refund, he said no. I disagreed with him and explained by reasons why but he still refused. So I then accepted his decision and informed the customer politely and professionally of the fact that I was not able to refund their order. I am not afraid to disagree with a manager. If I think something could be done better to the benefit of the company but I would always commit to their decision if they said no. So that's my example answer to that tough Amazon interview question. Tell me about a time when you demonstrated one of the leadership principles in the workplace. So the next thing to do is click that link in the top right hand corner of the video, head through to my website how to become.com and you can instantly download a copy of these slides in my full set of 57 Amazon interview questions and examples answers in a PDF guide. Also don't forget to check out those links in the description below the video. I have created several leadership principles, tutorials, make sure you check those out. It's really important that you learn and understand the leadership principles before you attend your Amazon interview. Also don't forget to hit the subscribe button literally thousands of you are passing your job interviews. I can only help you if you are subscribed. Please give the video a like because that motivates me to create more content for you. Thank you very much indeed and don't forget to connect with me on LinkedIn. I've put my LinkedIn link in the description below the video. It's always an honour and a pleasure to connect with light minded professionals such as yourself. Thank you so much for watching and wish you all the best for passing your interview have a great day.",
  "segments": [
    {
      "id": 0,
      "text": "Hello, there my name is Richard McMunn from the Interview Training website, how to"
    },
    {
      "id": 1,
      "text": "become.com and in this tutorial I will teach you how to pass an Amazon interview."
    },
    {
      "id": 2,
      "text": "So if you are applying for any role with this brilliant organisation, make sure you stay"
    },
    {
      "id": 3,
      "text": "tuned because a promise to help you be the standout candidate at your interview."
    },
    {
      "id": 4,
      "text": "And to achieve that goal, this is what I will cover during this tutorial."
    },
    {
      "id": 5,
      "text": "I will give you a list of 7 Amazon interview questions that I strongly recommend you prepare for."
    },
    {
      "id": 6,
      "text": "Number two, I will then give you several very important tips for answering each of those 7"
    },
    {
      "id": 7,
      "text": "Amazon interview questions correctly. I will then give you a top scoring example answer"
    },
    {
      "id": 8,
      "text": "to each of the 7 Amazon interview questions to help you pass at the very first attempt."
    },
    {
      "id": 9,
      "text": "And then finally, I will tell you where you can instantly download a copy of these slides and"
    },
    {
      "id": 10,
      "text": "my full set of 57 Amazon interview questions and answers in a PDF guide."
    },
    {
      "id": 11,
      "text": "So lots of reasons why you should stay tuned if you have an Amazon interview coming up soon."
    },
    {
      "id": 12,
      "text": "And just very quickly, if you are new to this channel, please make sure you hit that subscribe"
    },
    {
      "id": 13,
      "text": "literally thousands and thousands of you are passing your job interviews. I want to help you"
    },
    {
      "id": 14,
      "text": "pass your next job interview and accelerate throughout your career. I can only do that if you are"
    },
    {
      "id": 15,
      "text": "subscribed and please just give the video like because that quickly tells me that you find these"
    },
    {
      "id": 16,
      "text": "tutorials useful and it also motivates me to create more content for you. Thank you very much."
    },
    {
      "id": 17,
      "text": "So the first Amazon interview question I want you to prepare for is tell me about yourself."
    },
    {
      "id": 18,
      "text": "So this will be the first Amazon interview question you must answer right at the very start of your"
    },
    {
      "id": 19,
      "text": "interview. My advice is to make sure you create a positive first impression by demonstrating"
    },
    {
      "id": 20,
      "text": "good manners and then talking about the skills and qualities you can bring to the Amazon role"
    },
    {
      "id": 21,
      "text": "you have applied for. And tip number two, when you're answer, talk about your track record of"
    },
    {
      "id": 22,
      "text": "success in previous roles and make sure you mention the Amazon leadership principles and how you"
    },
    {
      "id": 23,
      "text": "will demonstrate these in the role. So let me now give you my example answer to this first"
    },
    {
      "id": 24,
      "text": "Amazon interview question. Tell me about yourself. Here we go. Thank you for the opportunity to be"
    },
    {
      "id": 25,
      "text": "interviewed for this position with Amazon today. I would describe myself as forward thinking."
    },
    {
      "id": 26,
      "text": "Customer centric, punctual and reliable, a calculated risk take and someone who is passionate"
    },
    {
      "id": 27,
      "text": "about working for a company that thrives to be the best it can be. I researched the job"
    },
    {
      "id": 28,
      "text": "description before applying for this role at Amazon and I'm confident I can not only hit the ground"
    },
    {
      "id": 29,
      "text": "running in the position but also help the company achieve its long-term commercial goals."
    },
    {
      "id": 30,
      "text": "I have a track record of achievement. So for example, in previous roles I was often praised"
    },
    {
      "id": 31,
      "text": "by my supervisors for my ability to provide exceptional service. The way I would encourage customers"
    },
    {
      "id": 32,
      "text": "to become long-term advocates of the business by always going above and beyond and how I took"
    },
    {
      "id": 33,
      "text": "ownership of difficult challenges. Now if you hire me to work at Amazon, I will demonstrate"
    },
    {
      "id": 34,
      "text": "the leadership principles in my work. I will be creative and think of ways to help the business"
    },
    {
      "id": 35,
      "text": "grow whilst saving money and I will take ownership of my ongoing professional development so"
    },
    {
      "id": 36,
      "text": "my skills quad is knowledge are always relevant and useful to my team. That's a brilliant example answer"
    },
    {
      "id": 37,
      "text": "to that first Amazon interview question. Tell me about yourself. Let's move on to the next question."
    },
    {
      "id": 38,
      "text": "Why Amazon? Why do you want to work for Amazon? Tip number one. So this next interview question"
    },
    {
      "id": 39,
      "text": "comes up often during Amazon job interviews and it is assessing your motivations for joining"
    },
    {
      "id": 40,
      "text": "this great organization. Now there is a lot of responsibility that comes with working for Amazon"
    },
    {
      "id": 41,
      "text": "and it is important you are motivated by helping them to achieve their long-term vision."
    },
    {
      "id": 42,
      "text": "Tip number two. Talk about in your answer the opportunities you will have at Amazon"
    },
    {
      "id": 43,
      "text": "to work on exciting projects with talented people who are all striving to achieve great things."
    },
    {
      "id": 44,
      "text": "Let me now give you my example answer to the second Amazon interview question. Why Amazon? Here we go."
    },
    {
      "id": 45,
      "text": "I want to work for Amazon because you are genuinely the best at what you do. This means"
    },
    {
      "id": 46,
      "text": "I will get to work on exciting tasks and projects that are at the cutting edge of innovation."
    },
    {
      "id": 47,
      "text": "I will get to work alongside some of the brightest minds in an environment where everyone has a"
    },
    {
      "id": 48,
      "text": "can do attitude. I want to work for Amazon because you always put the customer first in everything"
    },
    {
      "id": 49,
      "text": "you do and I understand how important this is to long-term success of any business. I want to work"
    },
    {
      "id": 50,
      "text": "for Amazon because there will be continuous opportunities for me to learn, improve and grow professionally."
    },
    {
      "id": 51,
      "text": "I want to work for a company that values its staff that empowers them to be the best they can be"
    },
    {
      "id": 52,
      "text": "and that creates an inclusive working environment where there is opportunity for all."
    },
    {
      "id": 53,
      "text": "Working for Amazon will give me all of these things. That's another brilliant example answer"
    },
    {
      "id": 54,
      "text": "that will help you pass your Amazon interview at the first attempt. Now don't go anywhere"
    },
    {
      "id": 55,
      "text": "because I still have five more questions and answers to work through review."
    },
    {
      "id": 56,
      "text": "But when you are ready click that link in the top right-hand corner of the video. You can"
    },
    {
      "id": 57,
      "text": "head straight through to my website how to become.com and instantly download a copy of these slides"
    },
    {
      "id": 58,
      "text": "and my full set of 57 Amazon interview questions and example answers in a PDF guide so you can"
    },
    {
      "id": 59,
      "text": "literally have it in your inbox within two minutes. Here's the next question. Tell me about"
    },
    {
      "id": 60,
      "text": "a time when you influence the change by only asking questions. This is a difficult Amazon interview"
    },
    {
      "id": 61,
      "text": "question. Tip number one. This question is an example of an Amazon behavioral interview question."
    },
    {
      "id": 62,
      "text": "You will have to answer several of these questions during your Amazon interview. Now it is important"
    },
    {
      "id": 63,
      "text": "to give a specific situation where you demonstrated the scenario being assessed. Tip number two,"
    },
    {
      "id": 64,
      "text": "I also strongly recommend you use a star technique to structure your answer but what is the star"
    },
    {
      "id": 65,
      "text": "technique? Let me quickly tell you what it is and I will then give you an example answer."
    },
    {
      "id": 66,
      "text": "So the star technique stands for situation task action and result. You start off your answer"
    },
    {
      "id": 67,
      "text": "and tell the interview with a situation you were faced with. You then move on and briefly outline"
    },
    {
      "id": 68,
      "text": "the task that needed doing. You then give in depth details about the action you took to achieve"
    },
    {
      "id": 69,
      "text": "the task and then finally you finish off your answer and reveal the results following your actions"
    },
    {
      "id": 70,
      "text": "and it's really important to make sure the results are positive following the action that you took."
    },
    {
      "id": 71,
      "text": "So let me now give you an example answer to that question. Tell me about a time when you influence"
    },
    {
      "id": 72,
      "text": "to change by only asking questions that uses the star technique and you can see how effective it is"
    },
    {
      "id": 73,
      "text": "at helping you to structure your answer to Amazon behavioral interview questions. Here we go."
    },
    {
      "id": 74,
      "text": "I was in a team meeting discussing the workflow for a new project which was for a client of the company."
    },
    {
      "id": 75,
      "text": "Now two team members suggested we should use a cheaper product part for the project"
    },
    {
      "id": 76,
      "text": "that would save us considerable money on the project costs and make it more profitable."
    },
    {
      "id": 77,
      "text": "They argued the client would have no idea we were using a sub-standard product part so it wasn't"
    },
    {
      "id": 78,
      "text": "an issue. Now I was not comfortable with this situation because it went against our company values"
    },
    {
      "id": 79,
      "text": "and it was morally wrong. So it was my task to challenge them by asking questions."
    },
    {
      "id": 80,
      "text": "I asked a team members two questions to influence their proposal. I asked them if they felt"
    },
    {
      "id": 81,
      "text": "their suggestion was in line with our company values and how we were expected to treat our clients"
    },
    {
      "id": 82,
      "text": "with honesty and integrity. They agreed it wasn't. I then asked them what would we do if the"
    },
    {
      "id": 83,
      "text": "project failed later on down the line because of the sub-standard product part and the client"
    },
    {
      "id": 84,
      "text": "then found out. I explained that the situation could be immensely damaging to our reputation"
    },
    {
      "id": 85,
      "text": "to which they agreed. After putting the two questions to them they agreed it was not a good"
    },
    {
      "id": 86,
      "text": "idea and we should stick to the original agreed project specification. So that's a really good answer"
    },
    {
      "id": 87,
      "text": "that will help you pass your Amazon interview and you can see how effective that"
    },
    {
      "id": 88,
      "text": "start technique really is helping you to give a powerful answer. Let me give you another"
    },
    {
      "id": 89,
      "text": "example, Amazon behavioral interview question that uses a start technique. And that question is"
    },
    {
      "id": 90,
      "text": "tell me about a time when you had to overcome a difficult challenge in the workplace. Here's my"
    },
    {
      "id": 91,
      "text": "example answer to help you. When I first started working my previous role I encountered a"
    },
    {
      "id": 92,
      "text": "difficult coworker. He had been with the company for many years and because I was relatively"
    },
    {
      "id": 93,
      "text": "young and enthusiastic I got the impression he didn't want to help. I'd asked for his assistance"
    },
    {
      "id": 94,
      "text": "and guidance on a couple of issues but he wasn't forthcoming with information. So I saw this as"
    },
    {
      "id": 95,
      "text": "a challenge and it was my task to break down his barriers and get to work with him closely so I"
    },
    {
      "id": 96,
      "text": "could benefit from his knowledge and expertise which would then help me to do a good job for the team."
    },
    {
      "id": 97,
      "text": "I decided to change my approach and after I found out that we both supported the same football"
    },
    {
      "id": 98,
      "text": "team I started to talk about our shared interest during a work break. Now this proved to be a good"
    },
    {
      "id": 99,
      "text": "move because he spoke passionately about the team we both supported and this enabled me to build a"
    },
    {
      "id": 100,
      "text": "positive rapport with him. Several days later when I next asked him for guidance on a project I was"
    },
    {
      "id": 101,
      "text": "working on he was more receptive and happy to advise and from that day on we became close and productive"
    },
    {
      "id": 102,
      "text": "work colleagues which I believe was down to my strong communication and interpersonal skills."
    },
    {
      "id": 103,
      "text": "So that's a really good in-depth answer to that Amazon behavioral interview question tell me about"
    },
    {
      "id": 104,
      "text": "when you had to overcome a difficult challenge in the workplace and it uses a start technique to"
    },
    {
      "id": 105,
      "text": "great effect you can see how by learning the start technique it will really help you to get an advantage"
    },
    {
      "id": 106,
      "text": "at your Amazon interview. Here's the next question. What are your strengths and weaknesses?"
    },
    {
      "id": 107,
      "text": "Now again this is a common Amazon interview question that I recommend you prepare for. Try to"
    },
    {
      "id": 108,
      "text": "align your strengths to the key skills and qualities that are listed on the Amazon job description"
    },
    {
      "id": 109,
      "text": "and tip number two for the weakness part of your answer is important to demonstrate self awareness"
    },
    {
      "id": 110,
      "text": "so do not say you don't have any weaknesses because you might then fail your interview. Here's"
    },
    {
      "id": 111,
      "text": "my example answer. What are your strengths and weaknesses? My strengths include my ability to work at"
    },
    {
      "id": 112,
      "text": "pace to complete all work to exacting standards to organize and prioritize my work in line"
    },
    {
      "id": 113,
      "text": "with my employers goals and in fact now I always take responsibility of my own professional"
    },
    {
      "id": 114,
      "text": "development. Other strengths include my strong interpersonal skills, my desire to carry out tasks"
    },
    {
      "id": 115,
      "text": "and duties outside of my job description because I am passionate about learning new things"
    },
    {
      "id": 116,
      "text": "and my willingness to help train up new members of staff whenever they join the team."
    },
    {
      "id": 117,
      "text": "Now my weakness is the fact I find it difficult letting go of projects. I tend to spend too long"
    },
    {
      "id": 118,
      "text": "checking over completed projects to see if improvements can be made but I need to learn to let"
    },
    {
      "id": 119,
      "text": "finish to projects go and move on to the next one and this is definitely something I am working"
    },
    {
      "id": 120,
      "text": "hard on to improve. That's a really good answer again that's going to help you."
    },
    {
      "id": 121,
      "text": "I'll share your Amazon interview at the first attempt. Here's an next question."
    },
    {
      "id": 122,
      "text": "Why should we hire you to work at Amazon? Tip number one this is another tough but common"
    },
    {
      "id": 123,
      "text": "Amazon interview question that needs a confident answer. Don't just give one reason why they should"
    },
    {
      "id": 124,
      "text": "hire you to work at Amazon. Think of several reasons that demonstrate you can add value to the"
    },
    {
      "id": 125,
      "text": "organization in the position you have applied for so here's my example answer. Why should we hire you"
    },
    {
      "id": 126,
      "text": "to work at Amazon? Here we go. You should hire me because I have the experience and knowledge to"
    },
    {
      "id": 127,
      "text": "excel in this role. This means I will contribute positively to Amazon's long-term vision and I"
    },
    {
      "id": 128,
      "text": "will be a positive role model for the organization whilst helping customers and interacting with"
    },
    {
      "id": 129,
      "text": "co-workers clients and stakeholders. You should hire me because I have a good understanding of the"
    },
    {
      "id": 130,
      "text": "16 leadership principles and I will strive to demonstrate these in my work. You should hire me"
    },
    {
      "id": 131,
      "text": "because I am a calculated risk taker and I will be creative and think of ways to help Amazon grow"
    },
    {
      "id": 132,
      "text": "whilst at the same time helping you to save money by being frugal where possible. Finally you should"
    },
    {
      "id": 133,
      "text": "hire me because I am very much open to learning and I am a big advocate of change. I know that"
    },
    {
      "id": 134,
      "text": "Amazon must always change and respond to the needs of its customers if it is to continually be the"
    },
    {
      "id": 135,
      "text": "market leader and I will always support you in that change. That's a really good answer another"
    },
    {
      "id": 136,
      "text": "cracking answer that will help you pass your interview with confidence. Here's the next question."
    },
    {
      "id": 137,
      "text": "Tell me about a time when you demonstrated one of the leadership principles in the workplace."
    },
    {
      "id": 138,
      "text": "This is a difficult question to answer correctly. So it's one of the toughest Amazon interview"
    },
    {
      "id": 139,
      "text": "questions in my opinion. My advice is to make sure you learn the 16 Amazon leadership principles"
    },
    {
      "id": 140,
      "text": "before you attend your interview. Now I have placed links in the description below this video"
    },
    {
      "id": 141,
      "text": "to several tutorials right here on YouTube where I teach you the leadership principles and also give"
    },
    {
      "id": 142,
      "text": "you several additional leadership principles into view questions that I recommend you prepare."
    },
    {
      "id": 143,
      "text": "So make sure you check those out once I have given you the answer in a second."
    },
    {
      "id": 144,
      "text": "Tip number two at the start of your answer to this question. Tell the interviewer"
    },
    {
      "id": 145,
      "text": "which leadership principles your answer relates to. Let me give you my example response."
    },
    {
      "id": 146,
      "text": "Tell me about a time when you demonstrated one of the leadership principles in the workplace."
    },
    {
      "id": 147,
      "text": "Here we go. I recently demonstrated in my last job the leadership principle of have back-bone"
    },
    {
      "id": 148,
      "text": "disagree and commit. A customer wanted a refund but their reason went against the company's refund policy."
    },
    {
      "id": 149,
      "text": "They were two days over the time limit to qualify for a refund but I felt the company should"
    },
    {
      "id": 150,
      "text": "honor it anyway because the customer was not satisfied with the product and I felt it was"
    },
    {
      "id": 151,
      "text": "more important to give exceptional service as they would then hopefully use the company's products"
    },
    {
      "id": 152,
      "text": "again in the future. However, when I asked my manager for permission to give the refund,"
    },
    {
      "id": 153,
      "text": "he said no. I disagreed with him and explained by reasons why but he still refused. So I then"
    },
    {
      "id": 154,
      "text": "accepted his decision and informed the customer politely and professionally of the fact that I was"
    },
    {
      "id": 155,
      "text": "not able to refund their order. I am not afraid to disagree with a manager. If I think something"
    },
    {
      "id": 156,
      "text": "could be done better to the benefit of the company but I would always commit to their decision"
    },
    {
      "id": 157,
      "text": "if they said no. So that's my example answer to that tough Amazon interview question. Tell me"
    },
    {
      "id": 158,
      "text": "about a time when you demonstrated one of the leadership principles in the workplace. So the next"
    },
    {
      "id": 159,
      "text": "thing to do is click that link in the top right hand corner of the video, head through to my"
    },
    {
      "id": 160,
      "text": "website how to become.com and you can instantly download a copy of these slides in my full set of"
    },
    {
      "id": 161,
      "text": "57 Amazon interview questions and examples answers in a PDF guide. Also don't forget to check out"
    },
    {
      "id": 162,
      "text": "those links in the description below the video. I have created several leadership principles,"
    },
    {
      "id": 163,
      "text": "tutorials, make sure you check those out. It's really important that you learn and understand"
    },
    {
      "id": 164,
      "text": "the leadership principles before you attend your Amazon interview. Also don't forget to hit the"
    },
    {
      "id": 165,
      "text": "subscribe button literally thousands of you are passing your job interviews. I can only help you"
    },
    {
      "id": 166,
      "text": "if you are subscribed. Please give the video a like because that motivates me to create more content"
    },
    {
      "id": 167,
      "text": "for you. Thank you very much indeed and don't forget to connect with me on LinkedIn. I've put my"
    },
    {
      "id": 168,
      "text": "LinkedIn link in the description below the video. It's always an honour and a pleasure to connect"
    },
    {
      "id": 169,
      "text": "with light minded professionals such as yourself. Thank you so much for watching and wish you all"
    },
    {
      "id": 170,
      "text": "the best for passing your interview have a great day."
    }
  ]
}