{
  "file": "_-OlYS7LWvk.wav",
  "text": " Hello there my name is Richard McMunn from the interview training website, passmaintoview.com and in this next tutorial I will teach you how to answer the really difficult interview question. Tell me about a time when you had to manage conflicting priorities. Now this is undoubtedly one of the hardest interview questions to answer correctly but if you have a job interview coming up for any role or any organisation stay tuned because I will give you the perfect answer. And just very quickly if you are new to the channel please do make sure you hit the subscribe button because I can then keep you updated. We've all the latest interview tips and top scoring answers and please give the video a like. That tells me you find these tutorials useful. Thank you very much for your support. Let's jump straight into the presentation. So to help you pass your interview I will cover three things during this tutorial. Number one I will explain why the hiring manager is asking you the interview question tell me about a time when you had to manage conflicting priorities. Number two I will explain how to structure your answer to gain the highest scores possible and number three I will give you two example outstanding responses. So to begin with why is the interview are asking you the question tell me about a time when you had to manage conflicting priorities. Well number one the role you are applying for will require you to manage multiple important tasks and priorities. Now if you already have experience of managing conflicting priorities you are definitely going to be a good fit for the role. And number two if you are able to manage conflicting priorities it tells the interviewer you are organized resilient and you are the type of person who will never crumble under pressure. Now before I give you two top scoring answers let me tell you how to structure your response to the difficult interview question tell me about a time when you had to manage conflicting priorities. Now my advice is to use the start technique to structure your answer. So you start off a new telly interviewer the situation you were faced with. You then move on and explain the task that needed doing. You then give specific details about the action you took before finishing off with the results of your actions. So let me now give you two example answers to the interview question tell me about a time when you had to manage conflicting priorities. Please tell me in the comments section below the video which answer option you think is the strongest. Here's example number one answer option number one tell me about a time when you had to manage conflicting priorities here we go. In my previous role I volunteered to help out on a project that was in danger of failing. Now in addition to this work I also had my regular duties to complete. It was my task to successfully manage all conflicting priorities to ensure everything was finished on time. I started out by speaking to the team members who were working on the failing project. I assessed the priorities of this project and suggested ways I could contribute to the team's objectives. I also analyzed my own workload and I drew up a list of which tasks were urgent and how long they would take me to complete. This gave me a perfect picture of the work I needed to do for both the project and my own responsibilities. Now to manage the conflicting priorities I stayed behind late for an hour each day after work and I met up regularly with the project team members to ensure progress was being made and that we had the necessary resources to get everything finished. Now after two weeks of working on the project and by prioritising my own task I was able to effectively manage all conflicting priorities much to the satisfaction of my manager. Example answer number two tell me about a time when you had to manage conflicting priorities here we go. In my previous job my manager asked for a volunteer to do the work of a team member who was going to be off sick for several weeks. I volunteered to be that person. It was my responsibility to manage both my own workload and the workload of my coworker to ensure all conflicting priorities were managed effectively. I started out by drawing up a list of the responsibilities I would have for both roles putting each task in order of priority. I then calculated how much time each task would take to complete and I set to work. I dealt with all customer service responsibilities first as I felt these were the priority before taking care of administrative duties answering internal queries, responding to emails and maintaining stock levels. To prevent deadlines from getting missed I stayed behind late after work as and when required. By using a structured approach to all tasks and responsibilities I'm by being flexible with my working hours I was able to successfully manage all conflicting priorities. So there is two brilliant example answers to that really difficult interview question. Don't forget to tell me in the comment section below which answer option you think is the strongest thank you very much. If you want to accelerate your learning even further make sure you click that link right now in the top right hand corner of the video. Head through to my website passmaintovue.com and you can download my full set of 50 top scoring answers to difficult interview questions. It comes as a PDF guide which means you can have it within your inbox within two minutes from now and it's going to help make you be the standout candidate at your job Finally don't forget to subscribe and please do hit the like button because that motivates me to create more videos for you and don't forget to connect with me on LinkedIn. I have put my LinkedIn link in the description below the video. It's always great to connect with like minded professionals. Thank you very much for your support and I wish you all the best for passing your interview have a brilliant day.",
  "segments": [
    {
      "id": 0,
      "text": "Hello there my name is Richard McMunn from the interview training website,"
    },
    {
      "id": 1,
      "text": "passmaintoview.com and in this next tutorial I will teach you how to answer the"
    },
    {
      "id": 2,
      "text": "really difficult interview question. Tell me about a time when you had to manage"
    },
    {
      "id": 3,
      "text": "conflicting priorities. Now this is undoubtedly one of the hardest interview questions to answer"
    },
    {
      "id": 4,
      "text": "correctly but if you have a job interview coming up for any role or any organisation stay tuned"
    },
    {
      "id": 5,
      "text": "because I will give you the perfect answer. And just very quickly if you are new to the channel"
    },
    {
      "id": 6,
      "text": "please do make sure you hit the subscribe button because I can then keep you updated. We've all"
    },
    {
      "id": 7,
      "text": "the latest interview tips and top scoring answers and please give the video a like. That tells"
    },
    {
      "id": 8,
      "text": "me you find these tutorials useful. Thank you very much for your support. Let's jump straight"
    },
    {
      "id": 9,
      "text": "into the presentation. So to help you pass your interview I will cover three things during this"
    },
    {
      "id": 10,
      "text": "tutorial. Number one I will explain why the hiring manager is asking you the interview question"
    },
    {
      "id": 11,
      "text": "tell me about a time when you had to manage conflicting priorities. Number two I will explain how to"
    },
    {
      "id": 12,
      "text": "structure your answer to gain the highest scores possible and number three I will give you two"
    },
    {
      "id": 13,
      "text": "example outstanding responses. So to begin with why is the interview are asking you the question"
    },
    {
      "id": 14,
      "text": "tell me about a time when you had to manage conflicting priorities. Well number one the role you are"
    },
    {
      "id": 15,
      "text": "applying for will require you to manage multiple important tasks and priorities. Now if you already"
    },
    {
      "id": 16,
      "text": "have experience of managing conflicting priorities you are definitely going to be a good fit for the role."
    },
    {
      "id": 17,
      "text": "And number two if you are able to manage conflicting priorities it tells the interviewer you are"
    },
    {
      "id": 18,
      "text": "organized resilient and you are the type of person who will never crumble under pressure."
    },
    {
      "id": 19,
      "text": "Now before I give you two top scoring answers let me tell you how to structure your response"
    },
    {
      "id": 20,
      "text": "to the difficult interview question tell me about a time when you had to manage conflicting"
    },
    {
      "id": 21,
      "text": "priorities. Now my advice is to use the start technique to structure your answer. So you start off"
    },
    {
      "id": 22,
      "text": "a new telly interviewer the situation you were faced with. You then move on and explain the task"
    },
    {
      "id": 23,
      "text": "that needed doing. You then give specific details about the action you took before finishing off"
    },
    {
      "id": 24,
      "text": "with the results of your actions. So let me now give you two example answers to the interview question"
    },
    {
      "id": 25,
      "text": "tell me about a time when you had to manage conflicting priorities. Please tell me in the comments"
    },
    {
      "id": 26,
      "text": "section below the video which answer option you think is the strongest. Here's example number one"
    },
    {
      "id": 27,
      "text": "answer option number one tell me about a time when you had to manage conflicting priorities here we go."
    },
    {
      "id": 28,
      "text": "In my previous role I volunteered to help out on a project that was in danger of failing."
    },
    {
      "id": 29,
      "text": "Now in addition to this work I also had my regular duties to complete. It was my task to"
    },
    {
      "id": 30,
      "text": "successfully manage all conflicting priorities to ensure everything was finished on time. I started out"
    },
    {
      "id": 31,
      "text": "by speaking to the team members who were working on the failing project. I assessed the priorities"
    },
    {
      "id": 32,
      "text": "of this project and suggested ways I could contribute to the team's objectives. I also analyzed"
    },
    {
      "id": 33,
      "text": "my own workload and I drew up a list of which tasks were urgent and how long they would take"
    },
    {
      "id": 34,
      "text": "me to complete. This gave me a perfect picture of the work I needed to do for both the project"
    },
    {
      "id": 35,
      "text": "and my own responsibilities. Now to manage the conflicting priorities I stayed behind late for an hour"
    },
    {
      "id": 36,
      "text": "each day after work and I met up regularly with the project team members to ensure progress was being"
    },
    {
      "id": 37,
      "text": "made and that we had the necessary resources to get everything finished. Now after two weeks of"
    },
    {
      "id": 38,
      "text": "working on the project and by prioritising my own task I was able to effectively manage all conflicting"
    },
    {
      "id": 39,
      "text": "priorities much to the satisfaction of my manager. Example answer number two tell me about a time"
    },
    {
      "id": 40,
      "text": "when you had to manage conflicting priorities here we go. In my previous job my manager asked for"
    },
    {
      "id": 41,
      "text": "a volunteer to do the work of a team member who was going to be off sick for several weeks. I"
    },
    {
      "id": 42,
      "text": "volunteered to be that person. It was my responsibility to manage both my own workload and the"
    },
    {
      "id": 43,
      "text": "workload of my coworker to ensure all conflicting priorities were managed effectively. I started"
    },
    {
      "id": 44,
      "text": "out by drawing up a list of the responsibilities I would have for both roles putting each task"
    },
    {
      "id": 45,
      "text": "in order of priority. I then calculated how much time each task would take to complete"
    },
    {
      "id": 46,
      "text": "and I set to work. I dealt with all customer service responsibilities first as I felt these were"
    },
    {
      "id": 47,
      "text": "the priority before taking care of administrative duties answering internal queries, responding"
    },
    {
      "id": 48,
      "text": "to emails and maintaining stock levels. To prevent deadlines from getting missed I stayed behind"
    },
    {
      "id": 49,
      "text": "late after work as and when required. By using a structured approach to all tasks and responsibilities"
    },
    {
      "id": 50,
      "text": "I'm by being flexible with my working hours I was able to successfully manage all conflicting priorities."
    },
    {
      "id": 51,
      "text": "So there is two brilliant example answers to that really difficult interview question. Don't"
    },
    {
      "id": 52,
      "text": "forget to tell me in the comment section below which answer option you think is the strongest"
    },
    {
      "id": 53,
      "text": "thank you very much. If you want to accelerate your learning even further make sure you click"
    },
    {
      "id": 54,
      "text": "that link right now in the top right hand corner of the video. Head through to my website"
    },
    {
      "id": 55,
      "text": "passmaintovue.com and you can download my full set of 50 top scoring answers to difficult"
    },
    {
      "id": 56,
      "text": "interview questions. It comes as a PDF guide which means you can have it within your inbox within"
    },
    {
      "id": 57,
      "text": "two minutes from now and it's going to help make you be the standout candidate at your job"
    },
    {
      "id": 58,
      "text": "Finally don't forget to subscribe and please do hit the like button because that motivates"
    },
    {
      "id": 59,
      "text": "me to create more videos for you and don't forget to connect with me on LinkedIn. I have put my"
    },
    {
      "id": 60,
      "text": "LinkedIn link in the description below the video. It's always great to connect with like minded"
    },
    {
      "id": 61,
      "text": "professionals. Thank you very much for your support and I wish you all the best for passing your"
    },
    {
      "id": 62,
      "text": "interview have a brilliant day."
    }
  ]
}