{
  "file": "aWjoFr5JODU.wav",
  "text": " Hello there, my name is Richard McMunn from the interview training website, passmaintoview.com and in this presentation I will teach you how to prepare for an Amazon interview. So if you are applying for any job role with Amazon, make sure you stay tuned because I promise to help you pass your interview at the first attempt and to achieve that goal, this is what I will cover in this training video. Number one, I will tell you which Amazon interview questions you should prepare for. These questions come up all the time during Amazon interviews, you need to have a top scoring answer prepared. Number two, I will then give you two very important tips for answering each of those Amazon interview questions correctly. Number three, I am then going to give you a brilliant, unique top scoring answer to each Amazon interview question to help you pass your interview at the first attempt and then finally, number four, I will tell you where you can instantly download these slides with the answers plus an additional 21 brilliant responses to tough Amazon interview questions in APDF guide and just very quickly. If you are new to my YouTube channel, please make sure you hit that subscribe button right now. Thousands of you are passing your interviews at the first attempt, I can only help you if you are subscribed and please give the video a like hit that like button right now because that tells me you find these training videos useful and motivates me to create more content for you. Thank you very much indeed. Okay, the first Amazon interview question I want you to prepare for is tell me about yourself. Here's two important tips and I will then give you my top scoring example answer. So tip number one, make sure you practice your answer to this first Amazon interview question before you attend your job interview because it is important to come across as someone who is a confident communicator and also someone who has the skills and knowledge to meet the demands of the role and tip number two in your answer. I recommend you reference the leadership principles because these are crucial to your success in the position at Amazon. Amazon has a set of 16 leadership principles and they are the values that everyone must demonstrate in their work. I will talk more about these as we progress through this video. So here is a brilliant example answer to this first Amazon interview question to help you partial interview. Tell me about yourself here we go. My name is Richard and I have always been passionate about combining innovation with customer centricity and that's why I am excited about the opportunity to join Amazon. In my previous role at company X I worked on a team that successfully launched a game changing product by embodying the think big principle. We identified emerging market trends and created a product that gave the company a great return on investment. Throughout my career I have consistently exhibited ownership by taking responsibility for both successes and setbacks. For example when we lost two team members during a critical project deadline I stepped up, rallied the team and redistributed tasks to ensure we not only met the deadline but also delivered with uncompromising quality. My skills, qualifications and work ethic are a great match for the leadership principles and my work experience has given me a solid foundation which I believe will add value to the Amazon team. I am genuinely excited about the opportunity to contribute to Amazon's relentless pursuit of customer satisfaction and innovation and I believe my commitment to the leadership principles will enable me to thrive in this dynamic environment. So that is a really good answer to that first Amazon interview question. Tell me about yourself you are referencing those leadership principles giving an example early on of where you demonstrated them in your previous role and the response shows you are a confident communicator. Now you can either pause the video if you want to and write down the questions and answers as we work through them together or if you wait I will sing tell you where you can download the slides plus my full set of 21. Brilliant answers to difficult Amazon interview questions. There is an next question I recommend you prepare for and that is why Amazon. Let me give you two important tips. Tip number one. So this next common question features during I would say 95% of Amazon interviews. It is assessing your motivations for wanting to work for this brilliant organisation. I think personally Amazon is the best organisation in the world and if you get to work for them your skills and experience will accelerate at a great speed. Tip number two. In your answer consider saying you have set your sights on working for Amazon for some time and you want to work there because you will be pushed and challenged in your role. You may also decide once again to reference the leadership principles in your response. So here is another great example answer to help you pass your Amazon interview. My Amazon. Getting hired and building a long-term career at Amazon has been my number one goal. Amazon has long been in the market leader in numerous industries which tells me it is an organisation that is continually progressing delivers world class products and services and provides customer service that outperforms its competitors. This means I will be pushed and challenged in my work. My ideas will be listened to and I will be supported to be the best I can be. I also want to work for Amazon because the leadership principles are a set of standards I genuinely believe in and the inclusive work culture means there is opportunity for everyone. That is another great answer that puts you across as someone who has researched the organisation and you have genuine reason for wanting to work for this brilliant organisation. Now don't go anywhere because I still have more questions and answers to give you. But when you are ready click that link in the top right hand corner of the video. Head straight through to my website to passmainetiveu.com and you can download these slides plus my full set of 21 Amazon interview questions and top scoring answers in a PDF guide. But here is the next question I want you to prepare for these are very difficult questions to answer. That question is tell me about a time when you gave a simple solution to a complex problem. Now during your Amazon interview you must answer several behavioral interview questions that assess your experience around those leadership principles. I will give you another training video based on the leadership principles at the end of this tutorial. So don't worry you are going to be fully prepared for your Amazon interview tip number too. This is important. Take note, I recommend you use the star method to structure your answer. The star method stands for situation task action and result. So you commend your answer and you briefly explain the situation you were in. You then outline the task that needed doing. You then give in depth details about the action you took and you finish your answer with the results of your actions. Now when responding to the behavioral interview questions make sure you give specific situations you have been in where you demonstrated the leadership principle that is being assessed. So here is another brilliant answer to help you pass your interview and this time it uses the star method. Situation task action and result. Tell me about a time when you gave a simple solution to a complex problem. Here we go. My previous job we had an ongoing problem with communication updates on projects and task delegation were becoming increasingly difficult as the company expanded. I decided to find a simple solution to this issue. After researching online for the best workplace communication and productivity tools, I put together a short presentation on a tool called Evernote which would empower managers and team members to keep everyone updated on task and project progression. After watching my presentation my manager agreed to its implementation and within several weeks Evernote became a fundamental part of our workplace productivity scheduling and task management. You can see how effective the answer is when you use the star method. Situation task action and result. There you are giving a specific situation you have been in where you found a simple solution to a complex problem that was causing the company issues. It's a really good answer. The next question, the next common Amazon interview question is what are your strengths and weaknesses tip number one? This next common but challenging Amazon interview question must be answered in a specific way. Again give strengths that match the leadership principles and an example to back up your claims because anybody can give certain strengths in their job interview answer but actually backing them up is another thing. Tip number two, now for the weakness give one that is not a match for the job description and do not say I don't have any weaknesses. If you do, I believe you will fail your Amazon interview. So here is another great example response to help you. Don't forget if you are enjoying this video please hit that like button please make sure you subscribe. What are your strengths and weaknesses? My greatest strengths include my ability to take ownership of difficult problems and challenges, my cost conscious approach to work and my communication skills and confidence which empower me to professionally challenge key decisions to achieve the best outcomes. For example in my current job I disagreed with my manager on how to market a new product launch after providing data and information to back up my claim that we should focus on marketing efforts more online and offline. She agreed to change direction. My weakness is I find it difficult to say no to people. I automatically say yes when people ask me to get involved in additional tasks or projects when I should actually first assess my capacity for the extra work. You can see how these answers will help you beat the competition and pass your Amazon interview at the first attempt. Don't forget if you want to download them just click the link in the top right hand corner of the video at any time. Here is the next question. This is another behavioural interview question. Tell me about a time when you had to work with incomplete data or information. Tip number one so this is another behavioural interview question that is assessing those leadership principles. Once again use that star method when giving your answer situation task action and result. And tip number two in your response demonstrate your ability to achieve your objective despite their being missing information or data. So here's another brilliant example answer to help you pass your Amazon interview. Tell me about your time when you had to work with incomplete data or information. I was tasked with creating a presentation for my manager who was going to deliver a sales update to company bosses while collecting the sales data for the presentation. I noticed several months figures were unavailable due to a technical issue. I needed to find an alternative way to extract the sales data required to ensure the presentation was accurate. I analyzed stock levels at the beginning and end of each month where the sales data was missing and then calculated the total sales generated for each product and month which gave me an accurate income and profit calculation. Now although this approach took longer to complete, I was able to create a presentation that enabled my manager to present correct information to the company executives. So that is a really good answer because it shows you are using your initiative to get the information and data required and you still achieve your outcome. You are not the type of employee who goes back to their manager and says, I can't do this because I don't have the information available. You are taking ownership of the problem and achieving your outcome and that's how you need to respond to that difficult Amazon behavioral interview question. Here's an next interview question for Amazon. I recommend you prepare for. Why do you want to leave your current job? Here's two great tips to help you tip number one. So this next common Amazon interview question is assessing your attitude towards your previous employer and why you want to leave. Do not be negative in any way about your boss coworkers or the work environment. So here is a short but positive answer to help you pass your Amazon interview. Why do you want to leave your current job? I want to leave my current job because I have set my sights on working for Amazon for some time. The skills knowledge and expertise I have gained in my job mean I am now ready to apply. My employer has been great to work for. They have been very supportive and I have enjoyed my time there. However, I am ready for the next chapter of my career where I can accelerate my growth even further while working for a forward thinking company such as Amazon that pushes the boundaries of innovation and provides a positive workplace culture where everyone has a can do attitude. You can see how that type of positive answer is going to help you pass your Amazon interview here is the next question. Tell me about a time when you influence the change by only asking questions. This is a really difficult Amazon interview question to answer correctly but let me give you two tips to help you. Tip number one so this Amazon behavioral interview question is assessing the leadership principle of learn and be curious which is your ability to be curious about new opportunities tip number two. In your answer say which questions you asked and explain the change that was influenced by them. So here's a great example answer to help you pass your Amazon job interview. Tell me about a time when you influence the change by only asking questions here we go. I was attending a meeting at work discussing the environmental impact the company was having. I had several ideas for making improvements and it was my task to influence a change by asking three specific questions which I had prepared. The questions I asked were have we ever thought about how much waste we generate here? Do we think we could be more environmentally friendly in our office practices and have we ever considered implementing a recycling program? I then presented a recycling idea to my manager and he agreed it was a positive step forward in reducing our impact on the environment. After my suggestion was implemented we reduced our company waste by 75% and everyone in the company adopted a more responsible approach to waste. The idea also resulted in considerable cost savings for the company. So that's a really good example answer. You are saying the three questions that you asked in a team meeting and those questions influence a positive change for the organisation and people in the team adopted a more responsible approach to waste. So it's a really good example answer. Now the next thing to do is you want to accelerate your learning even further and make sure you are fully prepared for your Amazon interview is to click that link right now in the top right-hand corner of the video. Let's straight through to my website, passmaintevue.com and you can instantly download these slides plus my full set of 21. Amazon interview questions and top scoring example answers in a PDF guide which means you can have them in your inbox literally within two minutes from now. Make sure you check that link. So I click that link in the top right-hand corner of the video because it will also take you down at this page on YouTube to where I have put the link to another video that will teach you how to prepare your answers for those leadership principles. Make sure you watch that video. Don't forget to hit the like button. Please subscribe to the channel. It's really important. I'm very passionate about helping people like you to progress in your careers, partner interviews, get a pay rise and get promoted. I can only do those things if you are subscribed and don't forget to connect with me on LinkedIn. I have put my LinkedIn link in the description below the video. It's always an honor and a pleasure to connect with light-minded professionals such as yourself. Thank you for watching and for supporting my channel. I wish you all the best for passing your Amazon interview. Have a wonderful day.",
  "segments": [
    {
      "id": 0,
      "text": "Hello there, my name is Richard McMunn from the interview training website, passmaintoview.com"
    },
    {
      "id": 1,
      "text": "and in this presentation I will teach you how to prepare for an Amazon interview."
    },
    {
      "id": 2,
      "text": "So if you are applying for any job role with Amazon, make sure you stay tuned because"
    },
    {
      "id": 3,
      "text": "I promise to help you pass your interview at the first attempt and to achieve that goal,"
    },
    {
      "id": 4,
      "text": "this is what I will cover in this training video."
    },
    {
      "id": 5,
      "text": "Number one, I will tell you which Amazon interview questions you should prepare for."
    },
    {
      "id": 6,
      "text": "These questions come up all the time during Amazon interviews, you need to have a top scoring"
    },
    {
      "id": 7,
      "text": "answer prepared."
    },
    {
      "id": 8,
      "text": "Number two, I will then give you two very important tips for answering each of those"
    },
    {
      "id": 9,
      "text": "Amazon interview questions correctly."
    },
    {
      "id": 10,
      "text": "Number three, I am then going to give you a brilliant, unique top scoring answer to each"
    },
    {
      "id": 11,
      "text": "Amazon interview question to help you pass your interview at the first attempt and then"
    },
    {
      "id": 12,
      "text": "finally, number four, I will tell you where you can instantly download these slides with"
    },
    {
      "id": 13,
      "text": "the answers plus an additional 21 brilliant responses to tough Amazon interview questions"
    },
    {
      "id": 14,
      "text": "in APDF guide and just very quickly."
    },
    {
      "id": 15,
      "text": "If you are new to my YouTube channel, please make sure you hit that subscribe button right"
    },
    {
      "id": 16,
      "text": "now."
    },
    {
      "id": 17,
      "text": "Thousands of you are passing your interviews at the first attempt, I can only help you if you"
    },
    {
      "id": 18,
      "text": "are subscribed and please give the video a like hit that like button right now because"
    },
    {
      "id": 19,
      "text": "that tells me you find these training videos useful and motivates me to create more content"
    },
    {
      "id": 20,
      "text": "for you."
    },
    {
      "id": 21,
      "text": "Thank you very much indeed."
    },
    {
      "id": 22,
      "text": "Okay, the first Amazon interview question I want you to prepare for is tell me about"
    },
    {
      "id": 23,
      "text": "yourself."
    },
    {
      "id": 24,
      "text": "Here's two important tips and I will then give you my top scoring example answer."
    },
    {
      "id": 25,
      "text": "So tip number one, make sure you practice your answer to this first Amazon interview"
    },
    {
      "id": 26,
      "text": "question before you attend your job interview because it is important to come across as"
    },
    {
      "id": 27,
      "text": "someone who is a confident communicator and also someone who has the skills and knowledge"
    },
    {
      "id": 28,
      "text": "to meet the demands of the role and tip number two in your answer."
    },
    {
      "id": 29,
      "text": "I recommend you reference the leadership principles because these are crucial to your"
    },
    {
      "id": 30,
      "text": "success in the position at Amazon."
    },
    {
      "id": 31,
      "text": "Amazon has a set of 16 leadership principles and they are the values that everyone must"
    },
    {
      "id": 32,
      "text": "demonstrate in their work."
    },
    {
      "id": 33,
      "text": "I will talk more about these as we progress through this video."
    },
    {
      "id": 34,
      "text": "So here is a brilliant example answer to this first Amazon interview question to help you"
    },
    {
      "id": 35,
      "text": "partial interview."
    },
    {
      "id": 36,
      "text": "Tell me about yourself here we go."
    },
    {
      "id": 37,
      "text": "My name is Richard and I have always been passionate about combining innovation with customer"
    },
    {
      "id": 38,
      "text": "centricity and that's why I am excited about the opportunity to join Amazon."
    },
    {
      "id": 39,
      "text": "In my previous role at company X I worked on a team that successfully launched a game"
    },
    {
      "id": 40,
      "text": "changing product by embodying the think big principle."
    },
    {
      "id": 41,
      "text": "We identified emerging market trends and created a product that gave the company a great"
    },
    {
      "id": 42,
      "text": "return on investment."
    },
    {
      "id": 43,
      "text": "Throughout my career I have consistently exhibited ownership by taking responsibility"
    },
    {
      "id": 44,
      "text": "for both successes and setbacks."
    },
    {
      "id": 45,
      "text": "For example when we lost two team members during a critical project deadline I stepped"
    },
    {
      "id": 46,
      "text": "up, rallied the team and redistributed tasks to ensure we not only met the deadline but"
    },
    {
      "id": 47,
      "text": "also delivered with uncompromising quality."
    },
    {
      "id": 48,
      "text": "My skills, qualifications and work ethic are a great match for the leadership principles"
    },
    {
      "id": 49,
      "text": "and my work experience has given me a solid foundation which I believe will add value to"
    },
    {
      "id": 50,
      "text": "the Amazon team."
    },
    {
      "id": 51,
      "text": "I am genuinely excited about the opportunity to contribute to Amazon's relentless pursuit"
    },
    {
      "id": 52,
      "text": "of customer satisfaction and innovation and I believe my commitment to the leadership principles"
    },
    {
      "id": 53,
      "text": "will enable me to thrive in this dynamic environment."
    },
    {
      "id": 54,
      "text": "So that is a really good answer to that first Amazon interview question."
    },
    {
      "id": 55,
      "text": "Tell me about yourself you are referencing those leadership principles giving an example"
    },
    {
      "id": 56,
      "text": "early on of where you demonstrated them in your previous role and the response shows you"
    },
    {
      "id": 57,
      "text": "are a confident communicator."
    },
    {
      "id": 58,
      "text": "Now you can either pause the video if you want to and write down the questions and answers"
    },
    {
      "id": 59,
      "text": "as we work through them together or if you wait I will sing tell you where you can download"
    },
    {
      "id": 60,
      "text": "the slides plus my full set of 21."
    },
    {
      "id": 61,
      "text": "Brilliant answers to difficult Amazon interview questions."
    },
    {
      "id": 62,
      "text": "There is an next question I recommend you prepare for and that is why Amazon."
    },
    {
      "id": 63,
      "text": "Let me give you two important tips."
    },
    {
      "id": 64,
      "text": "Tip number one."
    },
    {
      "id": 65,
      "text": "So this next common question features during I would say 95% of Amazon interviews."
    },
    {
      "id": 66,
      "text": "It is assessing your motivations for wanting to work for this brilliant organisation."
    },
    {
      "id": 67,
      "text": "I think personally Amazon is the best organisation in the world and if you get to work for"
    },
    {
      "id": 68,
      "text": "them your skills and experience will accelerate at a great speed."
    },
    {
      "id": 69,
      "text": "Tip number two."
    },
    {
      "id": 70,
      "text": "In your answer consider saying you have set your sights on working for Amazon for some"
    },
    {
      "id": 71,
      "text": "time and you want to work there because you will be pushed and challenged in your role."
    },
    {
      "id": 72,
      "text": "You may also decide once again to reference the leadership principles in your response."
    },
    {
      "id": 73,
      "text": "So here is another great example answer to help you pass your Amazon interview."
    },
    {
      "id": 74,
      "text": "My Amazon."
    },
    {
      "id": 75,
      "text": "Getting hired and building a long-term career at Amazon has been my number one goal."
    },
    {
      "id": 76,
      "text": "Amazon has long been in the market leader in numerous industries which tells me it is an"
    },
    {
      "id": 77,
      "text": "organisation that is continually progressing delivers world class products and services"
    },
    {
      "id": 78,
      "text": "and provides customer service that outperforms its competitors."
    },
    {
      "id": 79,
      "text": "This means I will be pushed and challenged in my work."
    },
    {
      "id": 80,
      "text": "My ideas will be listened to and I will be supported to be the best I can be."
    },
    {
      "id": 81,
      "text": "I also want to work for Amazon because the leadership principles are a set of standards"
    },
    {
      "id": 82,
      "text": "I genuinely believe in and the inclusive work culture means there is opportunity for everyone."
    },
    {
      "id": 83,
      "text": "That is another great answer that puts you across as someone who has researched the"
    },
    {
      "id": 84,
      "text": "organisation and you have genuine reason for wanting to work for this brilliant organisation."
    },
    {
      "id": 85,
      "text": "Now don't go anywhere because I still have more questions and answers to give you."
    },
    {
      "id": 86,
      "text": "But when you are ready click that link in the top right hand corner of the video."
    },
    {
      "id": 87,
      "text": "Head straight through to my website to passmainetiveu.com and you can download these slides"
    },
    {
      "id": 88,
      "text": "plus my full set of 21 Amazon interview questions and top scoring answers in a PDF guide."
    },
    {
      "id": 89,
      "text": "But here is the next question I want you to prepare for these are very difficult questions"
    },
    {
      "id": 90,
      "text": "to answer."
    },
    {
      "id": 91,
      "text": "That question is tell me about a time when you gave a simple solution to a complex problem."
    },
    {
      "id": 92,
      "text": "Now during your Amazon interview you must answer several behavioral interview questions"
    },
    {
      "id": 93,
      "text": "that assess your experience around those leadership principles."
    },
    {
      "id": 94,
      "text": "I will give you another training video based on the leadership principles at the end of"
    },
    {
      "id": 95,
      "text": "this tutorial."
    },
    {
      "id": 96,
      "text": "So don't worry you are going to be fully prepared for your Amazon interview tip number"
    },
    {
      "id": 97,
      "text": "too."
    },
    {
      "id": 98,
      "text": "This is important."
    },
    {
      "id": 99,
      "text": "Take note, I recommend you use the star method to structure your answer."
    },
    {
      "id": 100,
      "text": "The star method stands for situation task action and result."
    },
    {
      "id": 101,
      "text": "So you commend your answer and you briefly explain the situation you were in."
    },
    {
      "id": 102,
      "text": "You then outline the task that needed doing."
    },
    {
      "id": 103,
      "text": "You then give in depth details about the action you took and you finish your answer with"
    },
    {
      "id": 104,
      "text": "the results of your actions."
    },
    {
      "id": 105,
      "text": "Now when responding to the behavioral interview questions make sure you give specific"
    },
    {
      "id": 106,
      "text": "situations you have been in where you demonstrated the leadership principle that is being"
    },
    {
      "id": 107,
      "text": "assessed."
    },
    {
      "id": 108,
      "text": "So here is another brilliant answer to help you pass your interview and this time it uses"
    },
    {
      "id": 109,
      "text": "the star method."
    },
    {
      "id": 110,
      "text": "Situation task action and result."
    },
    {
      "id": 111,
      "text": "Tell me about a time when you gave a simple solution to a complex problem."
    },
    {
      "id": 112,
      "text": "Here we go."
    },
    {
      "id": 113,
      "text": "My previous job we had an ongoing problem with communication updates on projects and"
    },
    {
      "id": 114,
      "text": "task delegation were becoming increasingly difficult as the company expanded."
    },
    {
      "id": 115,
      "text": "I decided to find a simple solution to this issue."
    },
    {
      "id": 116,
      "text": "After researching online for the best workplace communication and productivity tools, I put"
    },
    {
      "id": 117,
      "text": "together a short presentation on a tool called Evernote which would empower managers and"
    },
    {
      "id": 118,
      "text": "team members to keep everyone updated on task and project progression."
    },
    {
      "id": 119,
      "text": "After watching my presentation my manager agreed to its implementation and within several"
    },
    {
      "id": 120,
      "text": "weeks Evernote became a fundamental part of our workplace productivity scheduling and task management."
    },
    {
      "id": 121,
      "text": "You can see how effective the answer is when you use the star method."
    },
    {
      "id": 122,
      "text": "Situation task action and result."
    },
    {
      "id": 123,
      "text": "There you are giving a specific situation you have been in where you found a simple solution"
    },
    {
      "id": 124,
      "text": "to a complex problem that was causing the company issues."
    },
    {
      "id": 125,
      "text": "It's a really good answer."
    },
    {
      "id": 126,
      "text": "The next question, the next common Amazon interview question is what are your strengths"
    },
    {
      "id": 127,
      "text": "and weaknesses tip number one?"
    },
    {
      "id": 128,
      "text": "This next common but challenging Amazon interview question must be answered in a specific"
    },
    {
      "id": 129,
      "text": "way."
    },
    {
      "id": 130,
      "text": "Again give strengths that match the leadership principles and an example to back up your"
    },
    {
      "id": 131,
      "text": "claims because anybody can give certain strengths in their job interview answer but actually"
    },
    {
      "id": 132,
      "text": "backing them up is another thing."
    },
    {
      "id": 133,
      "text": "Tip number two, now for the weakness give one that is not a match for the job description"
    },
    {
      "id": 134,
      "text": "and do not say I don't have any weaknesses."
    },
    {
      "id": 135,
      "text": "If you do, I believe you will fail your Amazon interview."
    },
    {
      "id": 136,
      "text": "So here is another great example response to help you."
    },
    {
      "id": 137,
      "text": "Don't forget if you are enjoying this video please hit that like button please make sure"
    },
    {
      "id": 138,
      "text": "you subscribe."
    },
    {
      "id": 139,
      "text": "What are your strengths and weaknesses?"
    },
    {
      "id": 140,
      "text": "My greatest strengths include my ability to take ownership of difficult problems and"
    },
    {
      "id": 141,
      "text": "challenges, my cost conscious approach to work and my communication skills and confidence"
    },
    {
      "id": 142,
      "text": "which empower me to professionally challenge key decisions to achieve the best outcomes."
    },
    {
      "id": 143,
      "text": "For example in my current job I disagreed with my manager on how to market a new product"
    },
    {
      "id": 144,
      "text": "launch after providing data and information to back up my claim that we should focus"
    },
    {
      "id": 145,
      "text": "on marketing efforts more online and offline."
    },
    {
      "id": 146,
      "text": "She agreed to change direction."
    },
    {
      "id": 147,
      "text": "My weakness is I find it difficult to say no to people."
    },
    {
      "id": 148,
      "text": "I automatically say yes when people ask me to get involved in additional tasks or projects"
    },
    {
      "id": 149,
      "text": "when I should actually first assess my capacity for the extra work."
    },
    {
      "id": 150,
      "text": "You can see how these answers will help you beat the competition and pass your Amazon"
    },
    {
      "id": 151,
      "text": "interview at the first attempt."
    },
    {
      "id": 152,
      "text": "Don't forget if you want to download them just click the link in the top right hand corner"
    },
    {
      "id": 153,
      "text": "of the video at any time."
    },
    {
      "id": 154,
      "text": "Here is the next question."
    },
    {
      "id": 155,
      "text": "This is another behavioural interview question."
    },
    {
      "id": 156,
      "text": "Tell me about a time when you had to work with incomplete data or information."
    },
    {
      "id": 157,
      "text": "Tip number one so this is another behavioural interview question that is assessing those leadership"
    },
    {
      "id": 158,
      "text": "principles."
    },
    {
      "id": 159,
      "text": "Once again use that star method when giving your answer situation task action and"
    },
    {
      "id": 160,
      "text": "result."
    },
    {
      "id": 161,
      "text": "And tip number two in your response demonstrate your ability to achieve your objective despite"
    },
    {
      "id": 162,
      "text": "their being missing information or data."
    },
    {
      "id": 163,
      "text": "So here's another brilliant example answer to help you pass your Amazon interview."
    },
    {
      "id": 164,
      "text": "Tell me about your time when you had to work with incomplete data or information."
    },
    {
      "id": 165,
      "text": "I was tasked with creating a presentation for my manager who was going to deliver a sales"
    },
    {
      "id": 166,
      "text": "update to company bosses while collecting the sales data for the presentation."
    },
    {
      "id": 167,
      "text": "I noticed several months figures were unavailable due to a technical issue."
    },
    {
      "id": 168,
      "text": "I needed to find an alternative way to extract the sales data required to ensure the presentation"
    },
    {
      "id": 169,
      "text": "was accurate."
    },
    {
      "id": 170,
      "text": "I analyzed stock levels at the beginning and end of each month where the sales data"
    },
    {
      "id": 171,
      "text": "was missing and then calculated the total sales generated for each product and month"
    },
    {
      "id": 172,
      "text": "which gave me an accurate income and profit calculation."
    },
    {
      "id": 173,
      "text": "Now although this approach took longer to complete, I was able to create a presentation"
    },
    {
      "id": 174,
      "text": "that enabled my manager to present correct information to the company executives."
    },
    {
      "id": 175,
      "text": "So that is a really good answer because it shows you are using your initiative to get the"
    },
    {
      "id": 176,
      "text": "information and data required and you still achieve your outcome."
    },
    {
      "id": 177,
      "text": "You are not the type of employee who goes back to their manager and says, I can't do this"
    },
    {
      "id": 178,
      "text": "because I don't have the information available."
    },
    {
      "id": 179,
      "text": "You are taking ownership of the problem and achieving your outcome and that's how you need"
    },
    {
      "id": 180,
      "text": "to respond to that difficult Amazon behavioral interview question."
    },
    {
      "id": 181,
      "text": "Here's an next interview question for Amazon."
    },
    {
      "id": 182,
      "text": "I recommend you prepare for."
    },
    {
      "id": 183,
      "text": "Why do you want to leave your current job?"
    },
    {
      "id": 184,
      "text": "Here's two great tips to help you tip number one."
    },
    {
      "id": 185,
      "text": "So this next common Amazon interview question is assessing your attitude towards your previous"
    },
    {
      "id": 186,
      "text": "employer and why you want to leave."
    },
    {
      "id": 187,
      "text": "Do not be negative in any way about your boss coworkers or the work environment."
    },
    {
      "id": 188,
      "text": "So here is a short but positive answer to help you pass your Amazon interview."
    },
    {
      "id": 189,
      "text": "Why do you want to leave your current job?"
    },
    {
      "id": 190,
      "text": "I want to leave my current job because I have set my sights on working for Amazon for some"
    },
    {
      "id": 191,
      "text": "time."
    },
    {
      "id": 192,
      "text": "The skills knowledge and expertise I have gained in my job mean I am now ready to apply."
    },
    {
      "id": 193,
      "text": "My employer has been great to work for."
    },
    {
      "id": 194,
      "text": "They have been very supportive and I have enjoyed my time there."
    },
    {
      "id": 195,
      "text": "However, I am ready for the next chapter of my career where I can accelerate my growth"
    },
    {
      "id": 196,
      "text": "even further while working for a forward thinking company such as Amazon that pushes"
    },
    {
      "id": 197,
      "text": "the boundaries of innovation and provides a positive workplace culture where everyone has"
    },
    {
      "id": 198,
      "text": "a can do attitude."
    },
    {
      "id": 199,
      "text": "You can see how that type of positive answer is going to help you pass your Amazon interview"
    },
    {
      "id": 200,
      "text": "here is the next question."
    },
    {
      "id": 201,
      "text": "Tell me about a time when you influence the change by only asking questions."
    },
    {
      "id": 202,
      "text": "This is a really difficult Amazon interview question to answer correctly but let me give you"
    },
    {
      "id": 203,
      "text": "two tips to help you."
    },
    {
      "id": 204,
      "text": "Tip number one so this Amazon behavioral interview question is assessing the leadership"
    },
    {
      "id": 205,
      "text": "principle of learn and be curious which is your ability to be curious about new opportunities"
    },
    {
      "id": 206,
      "text": "tip number two."
    },
    {
      "id": 207,
      "text": "In your answer say which questions you asked and explain the change that was influenced"
    },
    {
      "id": 208,
      "text": "by them."
    },
    {
      "id": 209,
      "text": "So here's a great example answer to help you pass your Amazon job interview."
    },
    {
      "id": 210,
      "text": "Tell me about a time when you influence the change by only asking questions here we"
    },
    {
      "id": 211,
      "text": "go."
    },
    {
      "id": 212,
      "text": "I was attending a meeting at work discussing the environmental impact the company was having."
    },
    {
      "id": 213,
      "text": "I had several ideas for making improvements and it was my task to influence a change"
    },
    {
      "id": 214,
      "text": "by asking three specific questions which I had prepared."
    },
    {
      "id": 215,
      "text": "The questions I asked were have we ever thought about how much waste we generate here?"
    },
    {
      "id": 216,
      "text": "Do we think we could be more environmentally friendly in our office practices and have we"
    },
    {
      "id": 217,
      "text": "ever considered implementing a recycling program?"
    },
    {
      "id": 218,
      "text": "I then presented a recycling idea to my manager and he agreed it was a positive step"
    },
    {
      "id": 219,
      "text": "forward in reducing our impact on the environment."
    },
    {
      "id": 220,
      "text": "After my suggestion was implemented we reduced our company waste by 75% and everyone"
    },
    {
      "id": 221,
      "text": "in the company adopted a more responsible approach to waste."
    },
    {
      "id": 222,
      "text": "The idea also resulted in considerable cost savings for the company."
    },
    {
      "id": 223,
      "text": "So that's a really good example answer."
    },
    {
      "id": 224,
      "text": "You are saying the three questions that you asked in a team meeting and those questions"
    },
    {
      "id": 225,
      "text": "influence a positive change for the organisation and people in the team adopted a more"
    },
    {
      "id": 226,
      "text": "responsible approach to waste."
    },
    {
      "id": 227,
      "text": "So it's a really good example answer."
    },
    {
      "id": 228,
      "text": "Now the next thing to do is you want to accelerate your learning even further and make"
    },
    {
      "id": 229,
      "text": "sure you are fully prepared for your Amazon interview is to click that link right now"
    },
    {
      "id": 230,
      "text": "in the top right-hand corner of the video."
    },
    {
      "id": 231,
      "text": "Let's straight through to my website, passmaintevue.com and you can instantly download these"
    },
    {
      "id": 232,
      "text": "slides plus my full set of 21."
    },
    {
      "id": 233,
      "text": "Amazon interview questions and top scoring example answers in a PDF guide which means you"
    },
    {
      "id": 234,
      "text": "can have them in your inbox literally within two minutes from now."
    },
    {
      "id": 235,
      "text": "Make sure you check that link."
    },
    {
      "id": 236,
      "text": "So I click that link in the top right-hand corner of the video because it will also take"
    },
    {
      "id": 237,
      "text": "you down at this page on YouTube to where I have put the link to another video that will"
    },
    {
      "id": 238,
      "text": "teach you how to prepare your answers for those leadership principles."
    },
    {
      "id": 239,
      "text": "Make sure you watch that video."
    },
    {
      "id": 240,
      "text": "Don't forget to hit the like button."
    },
    {
      "id": 241,
      "text": "Please subscribe to the channel."
    },
    {
      "id": 242,
      "text": "It's really important."
    },
    {
      "id": 243,
      "text": "I'm very passionate about helping people like you to progress in your careers, partner interviews,"
    },
    {
      "id": 244,
      "text": "get a pay rise and get promoted."
    },
    {
      "id": 245,
      "text": "I can only do those things if you are subscribed and don't forget to connect with me on"
    },
    {
      "id": 246,
      "text": "LinkedIn."
    },
    {
      "id": 247,
      "text": "I have put my LinkedIn link in the description below the video."
    },
    {
      "id": 248,
      "text": "It's always an honor and a pleasure to connect with light-minded professionals such"
    },
    {
      "id": 249,
      "text": "as yourself."
    },
    {
      "id": 250,
      "text": "Thank you for watching and for supporting my channel."
    },
    {
      "id": 251,
      "text": "I wish you all the best for passing your Amazon interview."
    },
    {
      "id": 252,
      "text": "Have a wonderful day."
    }
  ]
}