{
  "file": "ccUFo04C_hg.wav",
  "text": " Hello there, my name is Richard McMann from the interview training website, passmindevu.com and in this tutorial, I will teach you how to use a star method to answer difficult interview questions. So if you have an interview coming up soon for any role or company, make sure you stay tuned because this tutorial is going to make a massive difference to your performance. And to help you pass your interview at the first attempt, this is what I will cover to help you. Number one, I will explain what the star method is and how you can use it to easily pass your interview. Number two, I will give you six tough, behavioral interview questions to prepare for, including example top scoring answers that use the star method. And then finally, number three, I will tell you where you can instantly download the answers in this tutorial, plus my full set of 23 star technique, interview questions, and answers in a PDF guide. And just very quickly, this is important. Please make sure you hit that subscribe button if you are new to my channel. Literally thousands of you are passing your job interviews at the first attempt, I can only help you if you are subscribed. And please hit that like button. Please give the video a like. I really do appreciate it. Likeing the video tells me you find these tutorials useful, and it also motivates me to create more content for you. Thank you very much indeed. Okay, let's get started. To begin with, what is the star method? Well, the star method is an easy to remember structure that is used by successful interview candidates to answer difficult, behavioral interview questions such as, given example of a time you worked under pressure. Tell me about a time you worked in a team, describe a time when you had a disagreement with a coworker, and tell me about a time you dealt with an ethical dilemma. Okay, so the star method is recognized by hiring managers as the best technique to use when answering behavioral interview questions. That is why it is so important to learn it and understand it. So what does star stand for? Well, star stands for situation, task, action, and result. So whenever answering difficult behavioral interview questions, you start your answer and tell the hiring manager the situation you were in. You then move on and briefly describe the task that needed doing. And this demonstrates your awareness of the situation. You then go into great detail about the action you took to achieve or complete the task before finishing off your answer and telling the hiring manager the result, following your actions. And it's really important to remember that the result should always be a positive outcome. Okay, let's start working through the most common behavioral interview questions with star method answers. Here's the first question. Given example of a time you worked under pressure, here's my top scoring response that uses a star method. In my last job, a new customer contacted the company and then quiet about placing a large order of goods. Now they needed the order to be ready in 48 hours. Now despite this order quantity usually taking five days to prepare, we didn't want to let the customer down, so we agreed to deliver it in the requested time frame of 48 hours. As a team, we allocated tasks based on each other's strengths and worked to strict deadlines. My job was to supervise everyone and quality check each order for accuracy. Throughout the two days, we supported each other and worked tirelessly without taking breaks. We managed to get the order ready, we've just one hour to spare, and the customer was delighted with our speed of service. That is a brilliant example answer. To that difficult behavioral interview question, given example of a time you worked under pressure that uses a star method. Now don't go anywhere because I still have more questions and answers to give you. But when you're ready, you can click that link in the top right-hand corner of the video, head through to my website, passmindervue.com, and you can download my full set of 23 star technique, interview questions and top scoring answers, including the ones we are working through together today in this tutorial. Here is an ex-question. Describe a time when you had a disagreement with a coworker. Wow, this is a really difficult question to answer. Here's my top scoring response that uses a star method, here we go. My coworker and I disagreed on how to resolve a customer complaint. My coworker was refusing to meet the customer's demands. In contrast, I wanted to resolve their complaint amicably to keep the customer happy and learn from the situation. My goal was to explain to my coworker why my suggestion was the best way forward for the customer and our company. After hearing their argument for not meeting the customer's demands, I explained how excellent customer service was essential for the company's success. The company's reputation could be damaged if we didn't resolve the complaint successfully. After listening to my opinion, my coworker agreed, my method was the best way forward and we worked hard to resolve the customer's complaint to their satisfaction. That is such a good answer because you are putting the needs of the customer and your organization first and you are protecting the company's reputation. You can see how effective these answers are when you use a star method. It's really worth learning. Here's an ex-question. Tell me about a time you had to adapt to change. This behavioural interview question is coming up all the time during job interviews. Here's my top scoring response that uses a star method. In my last job, a coworker went on long-term sick leave. I volunteered to cover their work until a replacement could be found. It was my task to learn their role, reorganize my workload to ensure I met the company's objectives and adapt to a change in my daily work schedule. I created a list of my coworkers' duties and integrated them into my workload. I then prioritized my new list against the company's objectives and set to work. Whenever I was unsure how to complete one of my co-workers' tasks, I took the time to learn it using online trained videos and manuals. After several days of working with the change in my daily work, I felt comfortable with my responsibilities and settled into the new schedule. That's a really good answer because you volunteer to cover the work of your co-worker. And if you are unsure how to complete a task, you take the time to learn it yourself, using online training videos and manuals. So it's a really good answer that shows you are an efficient and effective employee. Here's an next question. What's the most difficult problem you've had to solve? Here's my top scoring response that uses that fantastic technique, the star method. Here we go. I arrived at work early Monday morning and quickly noticed the company website wasn't working. Monday was our busiest day of the week and it was important the website was back up and running quickly. This was a complex problem to solve because I had no IT skills and my manager wasn't doing it work until the following day. I felt it was my responsibility to investigate the website issue and get it back operational again quickly. So I researched online for common website problems and using a process of elimination, I determined the problem was with the server. Now because I was not qualified to work on the server, the best option was to hire a web developer online using upwork.com. After finding a suitably qualified web developer and giving them a thorough brief, they quickly resolved the issue and got the website back up and running within the hour. It's a really good example answer because you are taking ownership of a really difficult situation. You come across a problem because you can't fix the website yourself but you use your initiative and hire a web developer online. It's a really good answer. Here is the next behavioral interview question. I want you to prepare for. This is one of the most common questions. Tell me about the time you worked in 18. Here's my example answer, top scoring answer that uses a star method. Here we go. In my last job, my manager asked the team I was a part of to create a marketing plan for a new company product we were launching. Now the team was responsible for creating a plan that gave the business excellent value for money from its marketing budget and generated the most sales. We started by discussing our target audience. Where and how we could reach them and our marketing message. We each put forward ideas about how we felt we could market the product to get the greatest return. While each team member was speaking, everyone listened and gave encouragement. Finally, we collated the best ideas into a marketing plan before presenting it to our manager. He then permitted us to market the product using the plan and we achieved the best sales for a new product in the company's history. That's a great answer. You're working as part of a team. You're taking it in turns to come up with ideas you are listening to each other and giving encouragement. And you're then achieving a brilliant outcome which is the best sales ever for a new product launch in the company's history. Top scoring answer. Okay, let's now move on to the next question. Wow, this is a really difficult one. Describe a situation when you had to deal with an ethical dilemma. This has to be one of the hardest behavioral interview questions to answer. But here's my top scoring response that uses a star method. Here we go. In my last job, a problem occurred where I felt it necessary to inform my manager about inappropriate language being used by some of the more senior team members. I had asked them to stop using the language but they refused. This was a challenging dilemma because they were my colleagues and I had to work closely with them. However, I decided to speak out for the good of the organization. I spoke to my manager and explained what I had heard and the effort I had taken to try and stop it. I further explained that the organization was at risk because customers or clients might hear the comments and someone may take serious offense to them. After I reported the situation to my manager, she thanked me for doing the right thing and an investigation was launched which resulted in a changing company culture. It's a really good example answer. It shows that you have integrity and the confidence to deal with this challenging situation. It's a really good answer. So the next thing to do is click that link right now in the top right-hand corner of the video. I had straight through to my website, pass my interview.com and you can instantly download my full set of 23 star technique interview questions and top scoring answers include in the ones I have worked through with you in this tutorial today. Make sure you check out that website because these 23 questions I recommend you prepare for you can download the answers. Please make sure you subscribe to the channel. As you can see, literally thousands and thousands of you are passing your interviews at the first attempt, I can only help you if you are subscribed. Please give the video a like. It's a small ask but it really does motivate me to create more content for you. If I see you liking the video, it tells me that you want more content and as I said it motivates me to create more for you. Also, don't forget to connect with me on LinkedIn. I have put my LinkedIn link in the description below the video. It is always a pleasure and an honour to connect with like-minded professionals such as yourself. Thank you so much for watching and I wish you all the best for passing your job interview and using the star method. Have a great day.",
  "segments": [
    {
      "id": 0,
      "text": "Hello there, my name is Richard McMann from the interview training website,"
    },
    {
      "id": 1,
      "text": "passmindevu.com and in this tutorial, I will teach you how to use a star method"
    },
    {
      "id": 2,
      "text": "to answer difficult interview questions."
    },
    {
      "id": 3,
      "text": "So if you have an interview coming up soon for any role or company,"
    },
    {
      "id": 4,
      "text": "make sure you stay tuned because this tutorial is going to make a massive difference"
    },
    {
      "id": 5,
      "text": "to your performance."
    },
    {
      "id": 6,
      "text": "And to help you pass your interview at the first attempt,"
    },
    {
      "id": 7,
      "text": "this is what I will cover to help you."
    },
    {
      "id": 8,
      "text": "Number one, I will explain what the star method is"
    },
    {
      "id": 9,
      "text": "and how you can use it to easily pass your interview."
    },
    {
      "id": 10,
      "text": "Number two, I will give you six tough,"
    },
    {
      "id": 11,
      "text": "behavioral interview questions to prepare for,"
    },
    {
      "id": 12,
      "text": "including example top scoring answers that use the star method."
    },
    {
      "id": 13,
      "text": "And then finally, number three, I will tell you where you can instantly download the answers in this tutorial,"
    },
    {
      "id": 14,
      "text": "plus my full set of 23 star technique, interview questions,"
    },
    {
      "id": 15,
      "text": "and answers in a PDF guide."
    },
    {
      "id": 16,
      "text": "And just very quickly, this is important."
    },
    {
      "id": 17,
      "text": "Please make sure you hit that subscribe button if you are new to my channel."
    },
    {
      "id": 18,
      "text": "Literally thousands of you are passing your job interviews at the first attempt,"
    },
    {
      "id": 19,
      "text": "I can only help you if you are subscribed."
    },
    {
      "id": 20,
      "text": "And please hit that like button."
    },
    {
      "id": 21,
      "text": "Please give the video a like."
    },
    {
      "id": 22,
      "text": "I really do appreciate it."
    },
    {
      "id": 23,
      "text": "Likeing the video tells me you find these tutorials useful,"
    },
    {
      "id": 24,
      "text": "and it also motivates me to create more content for you."
    },
    {
      "id": 25,
      "text": "Thank you very much indeed."
    },
    {
      "id": 26,
      "text": "Okay, let's get started."
    },
    {
      "id": 27,
      "text": "To begin with, what is the star method?"
    },
    {
      "id": 28,
      "text": "Well, the star method is an easy to remember structure"
    },
    {
      "id": 29,
      "text": "that is used by successful interview candidates to answer difficult,"
    },
    {
      "id": 30,
      "text": "behavioral interview questions such as,"
    },
    {
      "id": 31,
      "text": "given example of a time you worked under pressure."
    },
    {
      "id": 32,
      "text": "Tell me about a time you worked in a team,"
    },
    {
      "id": 33,
      "text": "describe a time when you had a disagreement with a coworker,"
    },
    {
      "id": 34,
      "text": "and tell me about a time you dealt with an ethical dilemma."
    },
    {
      "id": 35,
      "text": "Okay, so the star method is recognized by hiring managers"
    },
    {
      "id": 36,
      "text": "as the best technique to use when answering behavioral interview questions."
    },
    {
      "id": 37,
      "text": "That is why it is so important to learn it and understand it."
    },
    {
      "id": 38,
      "text": "So what does star stand for?"
    },
    {
      "id": 39,
      "text": "Well, star stands for situation, task, action, and result."
    },
    {
      "id": 40,
      "text": "So whenever answering difficult behavioral interview questions,"
    },
    {
      "id": 41,
      "text": "you start your answer and tell the hiring manager the situation you were in."
    },
    {
      "id": 42,
      "text": "You then move on and briefly describe the task that needed doing."
    },
    {
      "id": 43,
      "text": "And this demonstrates your awareness of the situation."
    },
    {
      "id": 44,
      "text": "You then go into great detail about the action you took to achieve or complete the task"
    },
    {
      "id": 45,
      "text": "before finishing off your answer and telling the hiring manager the result,"
    },
    {
      "id": 46,
      "text": "following your actions."
    },
    {
      "id": 47,
      "text": "And it's really important to remember that the result should always be a positive outcome."
    },
    {
      "id": 48,
      "text": "Okay, let's start working through the most common behavioral interview questions with star method answers."
    },
    {
      "id": 49,
      "text": "Here's the first question."
    },
    {
      "id": 50,
      "text": "Given example of a time you worked under pressure,"
    },
    {
      "id": 51,
      "text": "here's my top scoring response that uses a star method."
    },
    {
      "id": 52,
      "text": "In my last job, a new customer contacted the company and then quiet about placing a large order of goods."
    },
    {
      "id": 53,
      "text": "Now they needed the order to be ready in 48 hours."
    },
    {
      "id": 54,
      "text": "Now despite this order quantity usually taking five days to prepare,"
    },
    {
      "id": 55,
      "text": "we didn't want to let the customer down,"
    },
    {
      "id": 56,
      "text": "so we agreed to deliver it in the requested time frame of 48 hours."
    },
    {
      "id": 57,
      "text": "As a team, we allocated tasks based on each other's strengths and worked to strict deadlines."
    },
    {
      "id": 58,
      "text": "My job was to supervise everyone and quality check each order for accuracy."
    },
    {
      "id": 59,
      "text": "Throughout the two days, we supported each other and worked tirelessly without taking breaks."
    },
    {
      "id": 60,
      "text": "We managed to get the order ready, we've just one hour to spare,"
    },
    {
      "id": 61,
      "text": "and the customer was delighted with our speed of service."
    },
    {
      "id": 62,
      "text": "That is a brilliant example answer."
    },
    {
      "id": 63,
      "text": "To that difficult behavioral interview question,"
    },
    {
      "id": 64,
      "text": "given example of a time you worked under pressure that uses a star method."
    },
    {
      "id": 65,
      "text": "Now don't go anywhere because I still have more questions and answers to give you."
    },
    {
      "id": 66,
      "text": "But when you're ready, you can click that link in the top right-hand corner of the video,"
    },
    {
      "id": 67,
      "text": "head through to my website, passmindervue.com,"
    },
    {
      "id": 68,
      "text": "and you can download my full set of 23 star technique,"
    },
    {
      "id": 69,
      "text": "interview questions and top scoring answers,"
    },
    {
      "id": 70,
      "text": "including the ones we are working through together today in this tutorial."
    },
    {
      "id": 71,
      "text": "Here is an ex-question."
    },
    {
      "id": 72,
      "text": "Describe a time when you had a disagreement with a coworker."
    },
    {
      "id": 73,
      "text": "Wow, this is a really difficult question to answer."
    },
    {
      "id": 74,
      "text": "Here's my top scoring response that uses a star method, here we go."
    },
    {
      "id": 75,
      "text": "My coworker and I disagreed on how to resolve a customer complaint."
    },
    {
      "id": 76,
      "text": "My coworker was refusing to meet the customer's demands."
    },
    {
      "id": 77,
      "text": "In contrast, I wanted to resolve their complaint amicably to keep the customer happy and learn from the situation."
    },
    {
      "id": 78,
      "text": "My goal was to explain to my coworker why my suggestion was the best way forward for the customer and our company."
    },
    {
      "id": 79,
      "text": "After hearing their argument for not meeting the customer's demands,"
    },
    {
      "id": 80,
      "text": "I explained how excellent customer service was essential for the company's success."
    },
    {
      "id": 81,
      "text": "The company's reputation could be damaged if we didn't resolve the complaint successfully."
    },
    {
      "id": 82,
      "text": "After listening to my opinion, my coworker agreed, my method was the best way forward"
    },
    {
      "id": 83,
      "text": "and we worked hard to resolve the customer's complaint to their satisfaction."
    },
    {
      "id": 84,
      "text": "That is such a good answer because you are putting the needs of the customer"
    },
    {
      "id": 85,
      "text": "and your organization first and you are protecting the company's reputation."
    },
    {
      "id": 86,
      "text": "You can see how effective these answers are when you use a star method."
    },
    {
      "id": 87,
      "text": "It's really worth learning."
    },
    {
      "id": 88,
      "text": "Here's an ex-question."
    },
    {
      "id": 89,
      "text": "Tell me about a time you had to adapt to change."
    },
    {
      "id": 90,
      "text": "This behavioural interview question is coming up all the time during job interviews."
    },
    {
      "id": 91,
      "text": "Here's my top scoring response that uses a star method."
    },
    {
      "id": 92,
      "text": "In my last job, a coworker went on long-term sick leave."
    },
    {
      "id": 93,
      "text": "I volunteered to cover their work until a replacement could be found."
    },
    {
      "id": 94,
      "text": "It was my task to learn their role, reorganize my workload to ensure I met the company's objectives"
    },
    {
      "id": 95,
      "text": "and adapt to a change in my daily work schedule."
    },
    {
      "id": 96,
      "text": "I created a list of my coworkers' duties and integrated them into my workload."
    },
    {
      "id": 97,
      "text": "I then prioritized my new list against the company's objectives and set to work."
    },
    {
      "id": 98,
      "text": "Whenever I was unsure how to complete one of my co-workers' tasks,"
    },
    {
      "id": 99,
      "text": "I took the time to learn it using online trained videos and manuals."
    },
    {
      "id": 100,
      "text": "After several days of working with the change in my daily work,"
    },
    {
      "id": 101,
      "text": "I felt comfortable with my responsibilities and settled into the new schedule."
    },
    {
      "id": 102,
      "text": "That's a really good answer because you volunteer to cover the work of your co-worker."
    },
    {
      "id": 103,
      "text": "And if you are unsure how to complete a task, you take the time to learn it yourself,"
    },
    {
      "id": 104,
      "text": "using online training videos and manuals."
    },
    {
      "id": 105,
      "text": "So it's a really good answer that shows you are an efficient and effective employee."
    },
    {
      "id": 106,
      "text": "Here's an next question."
    },
    {
      "id": 107,
      "text": "What's the most difficult problem you've had to solve?"
    },
    {
      "id": 108,
      "text": "Here's my top scoring response that uses that fantastic technique, the star method."
    },
    {
      "id": 109,
      "text": "Here we go."
    },
    {
      "id": 110,
      "text": "I arrived at work early Monday morning and quickly noticed the company website wasn't working."
    },
    {
      "id": 111,
      "text": "Monday was our busiest day of the week and it was important the website was back up and running quickly."
    },
    {
      "id": 112,
      "text": "This was a complex problem to solve because I had no IT skills and my manager wasn't doing it work until the following day."
    },
    {
      "id": 113,
      "text": "I felt it was my responsibility to investigate the website issue and get it back operational again quickly."
    },
    {
      "id": 114,
      "text": "So I researched online for common website problems and using a process of elimination, I determined the problem was with the server."
    },
    {
      "id": 115,
      "text": "Now because I was not qualified to work on the server, the best option was to hire a web developer online using upwork.com."
    },
    {
      "id": 116,
      "text": "After finding a suitably qualified web developer and giving them a thorough brief, they quickly resolved the issue and got the website back up and running within the hour."
    },
    {
      "id": 117,
      "text": "It's a really good example answer because you are taking ownership of a really difficult situation."
    },
    {
      "id": 118,
      "text": "You come across a problem because you can't fix the website yourself but you use your initiative and hire a web developer online."
    },
    {
      "id": 119,
      "text": "It's a really good answer. Here is the next behavioral interview question."
    },
    {
      "id": 120,
      "text": "I want you to prepare for."
    },
    {
      "id": 121,
      "text": "This is one of the most common questions."
    },
    {
      "id": 122,
      "text": "Tell me about the time you worked in 18."
    },
    {
      "id": 123,
      "text": "Here's my example answer, top scoring answer that uses a star method."
    },
    {
      "id": 124,
      "text": "Here we go."
    },
    {
      "id": 125,
      "text": "In my last job, my manager asked the team I was a part of to create a marketing plan for a new company product we were launching."
    },
    {
      "id": 126,
      "text": "Now the team was responsible for creating a plan that gave the business excellent value for money from its marketing budget and generated the most sales."
    },
    {
      "id": 127,
      "text": "We started by discussing our target audience."
    },
    {
      "id": 128,
      "text": "Where and how we could reach them and our marketing message."
    },
    {
      "id": 129,
      "text": "We each put forward ideas about how we felt we could market the product to get the greatest return."
    },
    {
      "id": 130,
      "text": "While each team member was speaking, everyone listened and gave encouragement."
    },
    {
      "id": 131,
      "text": "Finally, we collated the best ideas into a marketing plan before presenting it to our manager."
    },
    {
      "id": 132,
      "text": "He then permitted us to market the product using the plan and we achieved the best sales for a new product in the company's history."
    },
    {
      "id": 133,
      "text": "That's a great answer. You're working as part of a team."
    },
    {
      "id": 134,
      "text": "You're taking it in turns to come up with ideas you are listening to each other and giving encouragement."
    },
    {
      "id": 135,
      "text": "And you're then achieving a brilliant outcome which is the best sales ever for a new product launch in the company's history."
    },
    {
      "id": 136,
      "text": "Top scoring answer."
    },
    {
      "id": 137,
      "text": "Okay, let's now move on to the next question."
    },
    {
      "id": 138,
      "text": "Wow, this is a really difficult one."
    },
    {
      "id": 139,
      "text": "Describe a situation when you had to deal with an ethical dilemma."
    },
    {
      "id": 140,
      "text": "This has to be one of the hardest behavioral interview questions to answer."
    },
    {
      "id": 141,
      "text": "But here's my top scoring response that uses a star method."
    },
    {
      "id": 142,
      "text": "Here we go."
    },
    {
      "id": 143,
      "text": "In my last job, a problem occurred where I felt it necessary to inform my manager about inappropriate language being used by some of the more"
    },
    {
      "id": 144,
      "text": "senior team members. I had asked them to stop using the language but they refused."
    },
    {
      "id": 145,
      "text": "This was a challenging dilemma because they were my colleagues and I had to work closely with them."
    },
    {
      "id": 146,
      "text": "However, I decided to speak out for the good of the organization."
    },
    {
      "id": 147,
      "text": "I spoke to my manager and explained what I had heard and the effort I had taken to try and stop it."
    },
    {
      "id": 148,
      "text": "I further explained that the organization was at risk because customers or clients might hear the comments and someone may take serious offense to them."
    },
    {
      "id": 149,
      "text": "After I reported the situation to my manager, she thanked me for doing the right thing and an investigation was launched which resulted in a changing company culture."
    },
    {
      "id": 150,
      "text": "It's a really good example answer. It shows that you have integrity and the confidence to deal with this challenging situation."
    },
    {
      "id": 151,
      "text": "It's a really good answer. So the next thing to do is click that link right now in the top right-hand corner of the video."
    },
    {
      "id": 152,
      "text": "I had straight through to my website, pass my interview.com and you can instantly download my full set of 23 star technique interview questions and top scoring answers include in the ones I have worked through with you in this tutorial today."
    },
    {
      "id": 153,
      "text": "Make sure you check out that website because these 23 questions I recommend you prepare for you can download the answers."
    },
    {
      "id": 154,
      "text": "Please make sure you subscribe to the channel. As you can see, literally thousands and thousands of you are passing your interviews at the first attempt, I can only help you if you are subscribed."
    },
    {
      "id": 155,
      "text": "Please give the video a like. It's a small ask but it really does motivate me to create more content for you."
    },
    {
      "id": 156,
      "text": "If I see you liking the video, it tells me that you want more content and as I said it motivates me to create more for you."
    },
    {
      "id": 157,
      "text": "Also, don't forget to connect with me on LinkedIn. I have put my LinkedIn link in the description below the video. It is always a pleasure and an honour to connect with like-minded professionals such as yourself."
    },
    {
      "id": 158,
      "text": "Thank you so much for watching and I wish you all the best for passing your job interview and using the star method. Have a great day."
    }
  ]
}