{
  "file": "cnNE83QYobk.wav",
  "text": " Hello, that my name is Richard McMunn from the interview training company PassMineTV.com and in this tutorial I am going to teach you how to pass a software engineer interview. So it does not matter which company or organization you have your software engineer interview with. Please do make sure you watch this from beginning to end because as always I promise you it will make a huge difference to your preparation and your performance at the interview. And this is what I will cover to make sure I achieve that objective for you. I will give you a number of tips for passing your software engineer interview. I will also give you example software engineer interview questions and also suggested answers to the more comment type of software engineer interview questions. I will also tell you three questions that I think you should ask at the end of your software engineer interview. And I will also give you further resources to help you be the standout candidate during your software engineer interview. So there are five really good reasons why you should watch this from beginning to end. Now before I get into the tutorial, a very warm welcome to this software engineer interview training tutorial. My name is Richard McMunn. That's me there in the center. I've been helping people for about 20 years now to pass their interviews. And I always do that by giving you top scoring answers to the interview questions. Please do make sure you subscribe to the channel by clicking the red button below the video and also turning on that all important notification bell. So you immediately get notified when I upload additional videos. We have about 250,000 subscribers now within the community here on YouTube. And many of you are passing your interviews as a result, which is great news. Please I would very much appreciate it. If you gave the video a like, that tells me you enjoy the content and I will therefore create more for you. Okay, let's get into the training those software engineer interview questions and answers. So the first question I want you to prepare for is tell me about yourself and why you want to become a software engineer. My tip for answering this question positively is in your answer to this interview question. Provide a list of skills and qualities you possess that will enable you to perform to a very high standard in the role of a software engineer. So here is my suggested answer to the interview question tell me about yourself and why you want to become a software engineer. Before applying for this software engineer role with your company, I spent time reading the job description and the person specification. I wanted to make sure I was both properly qualified for the role and that I also had the appropriate experience and skills to help drive the company forward. I am hardworking, driven, technically astute and someone who will work closely with people within your organization to achieve your commercial and financial objectives. I want to be a software engineer simply because it is a role that I am extremely passionate about. I also want to get a men's job satisfaction from, especially when I get to see firsthand the positive contribution my work makes to the organization I am working for. If you hire me as your software engineer, I will not only work hard to deliver consistent positive results, but I will also use my developing, researching analytical and technical skills to help the company continually thrive and develop. That is a very positive answer and it gives some really good reasons why you want to become a software engineer and also about yourself and why they should hire you. Let's now take a look at another software engineer interview question one that I want you to prepare for. Why do you want to work for our company as a software engineer? So this is pretty much guaranteed to come up during your software engineer interview and my tip for answering this question positively is to show the interviewer you have conducted some research into their organization. My advice is to be complimentary in your answer and talk about what makes their company unique. So let's take a look at a suggested answer to the interview question why do you want to work for our company as a software engineer? For me the company I work for is very important. I believe that to be able to perform your duties and responsibilities as a software engineer, competently you need the support of your employer and you also need to work with like minded people who are all working towards a common goal. During my research into your organization, it soon became apparent that you are not only a leader within this industry, but you also continually look for ways to grow and develop. You also clearly hide some of the best people available and this means I'll be working with other professionals who all genuinely care about the work they produce. I am someone who is ambitious. I don't like to sit back and just do the bare minimum and if you hire me, I feel confident you will be impressed with my work values, my ethics and my high standards. As a great answer, you are giving lots of valid reasons why you want to work for their company, you are being complementary and most importantly, it shows that you've conducted some research before applying for the position. Let's take a look at another software engineer interview question. How would you deal with a member of your team who disagreed with the work you carried out as a software engineer? Now my tip for answering this question. This interview question is subtly assessing your team working capabilities. Do you put the needs of your team and the organization first or are you more concerned about your own reputation and your competence? Here is my suggested answer to the interview question. How would you deal with a member of your team who disagreed with the work you carried out as a software engineer? I have a lot of experiences as a software engineer and I feel the work I produce is to a very high standard. Now having said that, I am also aware that when I do work as part of a team, it is important to listen to other people as they may have valid contributions to make. And on that basis, I would certainly be open to listening to why they felt the work I was carrying out could be altered or improved. At the end of the day, we are all working for the same organization. And if that means changing the way I do things for the benefit of the team goal, I will certainly do that. That is a really good answer and it shows that you are more concerned about the organization and the team objectives. Now I have got lots more questions to run through, but when you are ready, if you would like to download a copy of these slides to save you having to write things down, you can click the link in the top right hand corner of that video. It will take you through to my website where you can download a copy of these slides. Let's move on to the next question. In your opinion, what other skills and qualities needed to be a software engineer? So this is a question that gets asked a number of times during software engineer interviews. So this question is clearly assessing your understanding of the role of a software engineer. And the best way to answer this is to give them a definitive list of the skills and qualities that are needed to excel in the position. So here is my suggested answer to the interview question in your opinion, what are the skills and qualities needed to be a software engineer? And there is a clever way of answering this. Here we go. Whilst they are on numerous skills and qualities needed, they are on nine in particular that are essential to becoming an effective software engineer. Now in no particular order, these are technical competence, communication and interpersonal skills whilst in and we clients and internal team members, exceptional organizational and planning capabilities, a level of commercial awareness. And also an understanding of how important it is to maintain competence in your role through professional development. You also need an ability to explain technical information in a simple and concise manner, so people understand it. An awareness of current issues impacting the industry or working in, and also strong analytical and attention to detail skills. Now what I like about that answer is you are starting up and saying there are numerous skills needed, but there are nine in particular that are essential. That shows that you really do know your role inside out and then you can list those nine skills and qualities. And if you want to add some yourself, feel free to do so. Next software engineer interview question that we want to prepare for is. Tell me your time when you worked as part of a team to solve a complex task. So this is a behavioral type interview question and as such, my advice is to use a star technique to create your answer. So the question is tell me your time when you worked as part of a team to solve a complex task. You have to give a specific situation you have previously been in to score this answer highly. So use the star technique. What is that? Well, it is situation task action results. So you start off with your answer and you describe briefly the situation you were in. You then move on and explain the task that needed to be done. You then detail the action you took to achieve the task and you finish off your answer by revealing the results following your actions. So it's situation task action result. Let's take a look at a sample answer using the star technique to that interview question. Tell me a time when you worked as part of a team to solve a complex task. Here we go. I was part of a multi-agency project building a software application for an important client. Towards the end of the project, we encountered a number of bugs and problems with the software application and time was against us to get everything fixed before the official hand over date. I felt it was my responsibility to come up with a solution to get the issues fixed. I stayed behind late that evening with two other experienced team members to come up with a plan that would ensure the bugs were not only fully rectified, but that a support system was in place to respond to any future issues if they were to arise post-handover. We started off by creating a list of all bugs and issues with an attempted to recreate each bug so that we could assess what was causing the issue. We managed to recreate all of the bugs and it was then my task to create a time scale for rectifying and testing each issue. Once we had a planning place, we could then allocate tasks to team members based on their area of technical competence the following morning. Now by creating a plan of action and by working closely together as a team, we were able to tap into the combined team expertise and competence to not only provide a time sensitive solution to the problem, but to also implement a support mechanism for our client. That is an organized answer. It is concise and logic in the way you are answering it by using that star technique of situation task action result. And don't forget if you want to click the link in the top right and corner of the video, you can download these slides to save you the hassle of having to write everything down. Next interview question is, Tell me how you would handle the stress and pressure of being a software engineer. Now you and I know that being a software engineer can be a stressful role. So when you answer this software engineer and interview question, show you already have a planning place for dealing with the stress and pressure of the position. Here is my suggested answer. I think as a software engineer, you have to realise that stress and pressure is all part of the role. And in actual fact, I feel I tend to perform better when I am up against it and there is a definitive time frame to work towards. I manage stress in three ways. First and foremost, I ensure I plan my work well in advance, so I know what I need to do and buy what deadline. Now by having a planning place, it means I work more efficiently and I can decide which tasks need my attention first. The second way I handle stress and pressure is to make sure I work closely with other team members and that communication is a constant theme throughout the day. Finally, I handle stress and pressure by making sure I dedicate some time each week to keeping up to date with developments from within the industry. This gives me the confidence in my role as a software engineer and it also eliminates any unwelcome surprises when updates do come out or changes within the industry or released. So that shows that you know how to handle stress and pressure and you are essentially saying, it doesn't matter, I can handle this. It's all part and parcel of the role. I have a planning place, but I do tend to perform better when I am up against it. Next, software engineer interview question is, what's your biggest weakness? So if any software engineer interview question is going to catch you out, it is this one. Now the issue is, we have to give a weakness in our answer, but we do not want to give a weakness that is needed to be competent in the role of a professional software engineer. So here is a great answer to this question. We all have weaknesses and I know my own is the fact I find it really hard to strike a healthy work life balance. I love my job as a software engineer and even when I am not at work, I am usually spending time with compute systems or developing additional skills and qualities. So I continue to grow in the role much to the dissatisfaction of my partner. Now this is an area I have been working to approve a poll. And I am trying to spend more time relaxing with my family, so I can then maintain optimum energy levels when I am actually at work. Conversely, one of my strengths is the fact I am always prepared to listen to feedback, and I do genuinely want to improve and develop as a person on both a personal level and a professional level also. So that shows you are given a weakness that does not actually impact your chances of passing the interview and you are then saying what you are doing about it. But you will see that answer is actually quite clever because that weakness you give is actually a strength and it is attractive to any employer. Because you are saying you enjoy being at work, you are always working, you love your role and you are prepared to put the hours in necessary. Next interview questions, what are your salary expectations? Now again, this is a tricky interview question because on the one hand we don't want to go in with an unrealistic salary expectation, but on the other we don't want to devalue ourselves either. So your answer has to offer a win-win situation. One that is a benefit to you, but also to the hiring manager or the employer. So we can answer this in the following manner. I have conducted some research prior to attending the interview and what I feel would be a fair salary for this position. Now the average salary for a software engineer in this industry is 90,000 to $110,000. Now whilst I do feel I am worth the higher salary band, I understand you don't know me and I need to prove to you my worth. On that basis I would feel comfortable with a salary of $120,000 and I feel you will see a positive return on your investment at this level if you hire me. So you are not going in there over confidence, but you are not devaluing yourself either. So that is a win-win situation. So do your own research and look at what the average salary for a software engineer is within your industry and then look at the band and then go slightly above the middle of that average salary range. Okay, three questions to ask in your software engineer interview. So you get to the end of the interview and they say to you, do you have any questions you would like to ask? My advice is to ask three questions. Now these questions are designed to show that you are keen, you are enthusiastic and you have the success of their organization at the forefront of your mind. So the first question is, what is frustrated you about software engineers you have employed in the past? It's quite clever question because it shows that you want to go in there, you want to do a good job and you are putting their needs first above your own. Second question is, what are the plans for the company over the next five to ten years and how could I help you to achieve them? Again, you are looking to the future. These tells me that you are considering staying with my organization for many years to come and you want to help me achieve my goals and then finally, what's the first thing you would like me to concentrate on in this role? So those three questions are great because they put you across as a positive person and somebody who is interested more in the success of their company as opposed to the success of yourself. So don't forget download a copy of these slides by clicking the link in the top right and corner of the video. You can connect with me on LinkedIn if you want to. My LinkedIn description is, sorry, my LinkedIn link is in the description below the video. So go through to that, click it and connect with me on LinkedIn. It's always good to connect with like-minded professionals. Thank you for watching. Don't forget to subscribe and hit the like button. Thank you very much. And I wish you all the best to pass in your software, engineer, interview, have a brilliant day. Thank you very much.",
  "segments": [
    {
      "id": 0,
      "text": "Hello, that my name is Richard McMunn from the interview training company PassMineTV.com"
    },
    {
      "id": 1,
      "text": "and in this tutorial I am going to teach you how to pass a software engineer interview."
    },
    {
      "id": 2,
      "text": "So it does not matter which company or organization you have your software engineer interview with."
    },
    {
      "id": 3,
      "text": "Please do make sure you watch this from beginning to end because as always I promise you it will make a huge"
    },
    {
      "id": 4,
      "text": "difference to your preparation and your performance at the interview."
    },
    {
      "id": 5,
      "text": "And this is what I will cover to make sure I achieve that objective for you."
    },
    {
      "id": 6,
      "text": "I will give you a number of tips for passing your software engineer interview."
    },
    {
      "id": 7,
      "text": "I will also give you example software engineer interview questions and also suggested answers to the more comment type of software engineer interview questions."
    },
    {
      "id": 8,
      "text": "I will also tell you three questions that I think you should ask at the end of your software engineer interview."
    },
    {
      "id": 9,
      "text": "And I will also give you further resources to help you be the standout candidate during your software engineer interview."
    },
    {
      "id": 10,
      "text": "So there are five really good reasons why you should watch this from beginning to end."
    },
    {
      "id": 11,
      "text": "Now before I get into the tutorial, a very warm welcome to this software engineer interview training tutorial."
    },
    {
      "id": 12,
      "text": "My name is Richard McMunn. That's me there in the center. I've been helping people for about 20 years now to pass their interviews."
    },
    {
      "id": 13,
      "text": "And I always do that by giving you top scoring answers to the interview questions."
    },
    {
      "id": 14,
      "text": "Please do make sure you subscribe to the channel by clicking the red button below the video and also turning on that all important notification bell."
    },
    {
      "id": 15,
      "text": "So you immediately get notified when I upload additional videos."
    },
    {
      "id": 16,
      "text": "We have about 250,000 subscribers now within the community here on YouTube."
    },
    {
      "id": 17,
      "text": "And many of you are passing your interviews as a result, which is great news."
    },
    {
      "id": 18,
      "text": "Please I would very much appreciate it. If you gave the video a like, that tells me you enjoy the content and I will therefore create more for you."
    },
    {
      "id": 19,
      "text": "Okay, let's get into the training those software engineer interview questions and answers."
    },
    {
      "id": 20,
      "text": "So the first question I want you to prepare for is tell me about yourself and why you want to become a software engineer."
    },
    {
      "id": 21,
      "text": "My tip for answering this question positively is in your answer to this interview question."
    },
    {
      "id": 22,
      "text": "Provide a list of skills and qualities you possess that will enable you to perform to a very high standard in the role of a software engineer."
    },
    {
      "id": 23,
      "text": "So here is my suggested answer to the interview question tell me about yourself and why you want to become a software engineer."
    },
    {
      "id": 24,
      "text": "Before applying for this software engineer role with your company, I spent time reading the job description and the person specification."
    },
    {
      "id": 25,
      "text": "I wanted to make sure I was both properly qualified for the role and that I also had the appropriate experience and skills to help drive the company forward."
    },
    {
      "id": 26,
      "text": "I am hardworking, driven, technically astute and someone who will work closely with people within your organization to achieve your commercial and financial objectives."
    },
    {
      "id": 27,
      "text": "I want to be a software engineer simply because it is a role that I am extremely passionate about."
    },
    {
      "id": 28,
      "text": "I also want to get a men's job satisfaction from, especially when I get to see firsthand the positive contribution my work makes to the organization I am working for."
    },
    {
      "id": 29,
      "text": "If you hire me as your software engineer, I will not only work hard to deliver consistent positive results, but I will also use my developing, researching analytical and technical skills to help the company continually thrive and develop."
    },
    {
      "id": 30,
      "text": "That is a very positive answer and it gives some really good reasons why you want to become a software engineer and also about yourself and why they should hire you."
    },
    {
      "id": 31,
      "text": "Let's now take a look at another software engineer interview question one that I want you to prepare for."
    },
    {
      "id": 32,
      "text": "Why do you want to work for our company as a software engineer?"
    },
    {
      "id": 33,
      "text": "So this is pretty much guaranteed to come up during your software engineer interview and my tip for answering this question positively is to show the interviewer you have conducted some research into their organization."
    },
    {
      "id": 34,
      "text": "My advice is to be complimentary in your answer and talk about what makes their company unique."
    },
    {
      "id": 35,
      "text": "So let's take a look at a suggested answer to the interview question why do you want to work for our company as a software engineer?"
    },
    {
      "id": 36,
      "text": "For me the company I work for is very important."
    },
    {
      "id": 37,
      "text": "I believe that to be able to perform your duties and responsibilities as a software engineer,"
    },
    {
      "id": 38,
      "text": "competently you need the support of your employer and you also need to work with like minded people who are all working towards a common goal."
    },
    {
      "id": 39,
      "text": "During my research into your organization, it soon became apparent that you are not only a leader within this industry, but you also continually look for ways to grow and develop."
    },
    {
      "id": 40,
      "text": "You also clearly hide some of the best people available and this means I'll be working with other professionals who all genuinely care about the work they produce."
    },
    {
      "id": 41,
      "text": "I am someone who is ambitious."
    },
    {
      "id": 42,
      "text": "I don't like to sit back and just do the bare minimum and if you hire me, I feel confident you will be impressed with my work values, my ethics and my high standards."
    },
    {
      "id": 43,
      "text": "As a great answer, you are giving lots of valid reasons why you want to work for their company, you are being complementary and most importantly, it shows that you've conducted some research before applying for the position."
    },
    {
      "id": 44,
      "text": "Let's take a look at another software engineer interview question."
    },
    {
      "id": 45,
      "text": "How would you deal with a member of your team who disagreed with the work you carried out as a software engineer?"
    },
    {
      "id": 46,
      "text": "Now my tip for answering this question. This interview question is subtly assessing your team working capabilities."
    },
    {
      "id": 47,
      "text": "Do you put the needs of your team and the organization first or are you more concerned about your own reputation and your competence?"
    },
    {
      "id": 48,
      "text": "Here is my suggested answer to the interview question. How would you deal with a member of your team who disagreed with the work you carried out as a software engineer?"
    },
    {
      "id": 49,
      "text": "I have a lot of experiences as a software engineer and I feel the work I produce is to a very high standard."
    },
    {
      "id": 50,
      "text": "Now having said that, I am also aware that when I do work as part of a team, it is important to listen to other people as they may have valid contributions to make."
    },
    {
      "id": 51,
      "text": "And on that basis, I would certainly be open to listening to why they felt the work I was carrying out could be altered or improved."
    },
    {
      "id": 52,
      "text": "At the end of the day, we are all working for the same organization. And if that means changing the way I do things for the benefit of the team goal, I will certainly do that."
    },
    {
      "id": 53,
      "text": "That is a really good answer and it shows that you are more concerned about the organization and the team objectives."
    },
    {
      "id": 54,
      "text": "Now I have got lots more questions to run through, but when you are ready, if you would like to download a copy of these slides to save you having to write things down,"
    },
    {
      "id": 55,
      "text": "you can click the link in the top right hand corner of that video. It will take you through to my website where you can download a copy of these slides. Let's move on to the next question."
    },
    {
      "id": 56,
      "text": "In your opinion, what other skills and qualities needed to be a software engineer?"
    },
    {
      "id": 57,
      "text": "So this is a question that gets asked a number of times during software engineer interviews."
    },
    {
      "id": 58,
      "text": "So this question is clearly assessing your understanding of the role of a software engineer. And the best way to answer this is to give them a definitive list of the skills and qualities that are needed to excel in the position."
    },
    {
      "id": 59,
      "text": "So here is my suggested answer to the interview question in your opinion, what are the skills and qualities needed to be a software engineer? And there is a clever way of answering this. Here we go."
    },
    {
      "id": 60,
      "text": "Whilst they are on numerous skills and qualities needed, they are on nine in particular that are essential to becoming an effective software engineer."
    },
    {
      "id": 61,
      "text": "Now in no particular order, these are technical competence, communication and interpersonal skills whilst in and we clients and internal team members, exceptional organizational and planning capabilities, a level of commercial awareness."
    },
    {
      "id": 62,
      "text": "And also an understanding of how important it is to maintain competence in your role through professional development."
    },
    {
      "id": 63,
      "text": "You also need an ability to explain technical information in a simple and concise manner, so people understand it."
    },
    {
      "id": 64,
      "text": "An awareness of current issues impacting the industry or working in, and also strong analytical and attention to detail skills."
    },
    {
      "id": 65,
      "text": "Now what I like about that answer is you are starting up and saying there are numerous skills needed, but there are nine in particular that are essential."
    },
    {
      "id": 66,
      "text": "That shows that you really do know your role inside out and then you can list those nine skills and qualities."
    },
    {
      "id": 67,
      "text": "And if you want to add some yourself, feel free to do so."
    },
    {
      "id": 68,
      "text": "Next software engineer interview question that we want to prepare for is."
    },
    {
      "id": 69,
      "text": "Tell me your time when you worked as part of a team to solve a complex task."
    },
    {
      "id": 70,
      "text": "So this is a behavioral type interview question and as such, my advice is to use a star technique to create your answer."
    },
    {
      "id": 71,
      "text": "So the question is tell me your time when you worked as part of a team to solve a complex task."
    },
    {
      "id": 72,
      "text": "You have to give a specific situation you have previously been in to score this answer highly."
    },
    {
      "id": 73,
      "text": "So use the star technique. What is that? Well, it is situation task action results."
    },
    {
      "id": 74,
      "text": "So you start off with your answer and you describe briefly the situation you were in."
    },
    {
      "id": 75,
      "text": "You then move on and explain the task that needed to be done."
    },
    {
      "id": 76,
      "text": "You then detail the action you took to achieve the task and you finish off your answer by revealing the results following your actions."
    },
    {
      "id": 77,
      "text": "So it's situation task action result."
    },
    {
      "id": 78,
      "text": "Let's take a look at a sample answer using the star technique to that interview question."
    },
    {
      "id": 79,
      "text": "Tell me a time when you worked as part of a team to solve a complex task. Here we go."
    },
    {
      "id": 80,
      "text": "I was part of a multi-agency project building a software application for an important client."
    },
    {
      "id": 81,
      "text": "Towards the end of the project, we encountered a number of bugs and problems with the software application and time was against us to get everything fixed before the official hand over date."
    },
    {
      "id": 82,
      "text": "I felt it was my responsibility to come up with a solution to get the issues fixed."
    },
    {
      "id": 83,
      "text": "I stayed behind late that evening with two other experienced team members to come up with a plan that would ensure the bugs were not only fully rectified,"
    },
    {
      "id": 84,
      "text": "but that a support system was in place to respond to any future issues if they were to arise post-handover."
    },
    {
      "id": 85,
      "text": "We started off by creating a list of all bugs and issues with an attempted to recreate each bug so that we could assess what was causing the issue."
    },
    {
      "id": 86,
      "text": "We managed to recreate all of the bugs and it was then my task to create a time scale for rectifying and testing each issue."
    },
    {
      "id": 87,
      "text": "Once we had a planning place, we could then allocate tasks to team members based on their area of technical competence the following morning."
    },
    {
      "id": 88,
      "text": "Now by creating a plan of action and by working closely together as a team, we were able to tap into the combined team expertise and competence to not only provide a time sensitive solution to the problem,"
    },
    {
      "id": 89,
      "text": "but to also implement a support mechanism for our client."
    },
    {
      "id": 90,
      "text": "That is an organized answer. It is concise and logic in the way you are answering it by using that star technique of situation task action result."
    },
    {
      "id": 91,
      "text": "And don't forget if you want to click the link in the top right and corner of the video, you can download these slides to save you the hassle of having to write everything down."
    },
    {
      "id": 92,
      "text": "Next interview question is,"
    },
    {
      "id": 93,
      "text": "Tell me how you would handle the stress and pressure of being a software engineer. Now you and I know that being a software engineer can be a stressful role."
    },
    {
      "id": 94,
      "text": "So when you answer this software engineer and interview question,"
    },
    {
      "id": 95,
      "text": "show you already have a planning place for dealing with the stress and pressure of the position."
    },
    {
      "id": 96,
      "text": "Here is my suggested answer."
    },
    {
      "id": 97,
      "text": "I think as a software engineer, you have to realise that stress and pressure is all part of the role."
    },
    {
      "id": 98,
      "text": "And in actual fact, I feel I tend to perform better when I am up against it and there is a definitive time frame to work towards."
    },
    {
      "id": 99,
      "text": "I manage stress in three ways. First and foremost, I ensure I plan my work well in advance, so I know what I need to do and buy what deadline."
    },
    {
      "id": 100,
      "text": "Now by having a planning place, it means I work more efficiently and I can decide which tasks need my attention first."
    },
    {
      "id": 101,
      "text": "The second way I handle stress and pressure is to make sure I work closely with other team members and that communication is a constant theme throughout the day."
    },
    {
      "id": 102,
      "text": "Finally, I handle stress and pressure by making sure I dedicate some time each week to keeping up to date with developments from within the industry."
    },
    {
      "id": 103,
      "text": "This gives me the confidence in my role as a software engineer and it also eliminates any unwelcome surprises when updates do come out or changes within the industry or released."
    },
    {
      "id": 104,
      "text": "So that shows that you know how to handle stress and pressure and you are essentially saying, it doesn't matter, I can handle this."
    },
    {
      "id": 105,
      "text": "It's all part and parcel of the role. I have a planning place, but I do tend to perform better when I am up against it."
    },
    {
      "id": 106,
      "text": "Next, software engineer interview question is, what's your biggest weakness?"
    },
    {
      "id": 107,
      "text": "So if any software engineer interview question is going to catch you out, it is this one."
    },
    {
      "id": 108,
      "text": "Now the issue is, we have to give a weakness in our answer, but we do not want to give a weakness that is needed to be competent in the role of a professional software engineer."
    },
    {
      "id": 109,
      "text": "So here is a great answer to this question."
    },
    {
      "id": 110,
      "text": "We all have weaknesses and I know my own is the fact I find it really hard to strike a healthy work life balance."
    },
    {
      "id": 111,
      "text": "I love my job as a software engineer and even when I am not at work, I am usually spending time with compute systems or developing additional skills and qualities."
    },
    {
      "id": 112,
      "text": "So I continue to grow in the role much to the dissatisfaction of my partner."
    },
    {
      "id": 113,
      "text": "Now this is an area I have been working to approve a poll."
    },
    {
      "id": 114,
      "text": "And I am trying to spend more time relaxing with my family, so I can then maintain optimum energy levels when I am actually at work."
    },
    {
      "id": 115,
      "text": "Conversely, one of my strengths is the fact I am always prepared to listen to feedback, and I do genuinely want to improve and develop as a person on both a personal level and a professional level also."
    },
    {
      "id": 116,
      "text": "So that shows you are given a weakness that does not actually impact your chances of passing the interview and you are then saying what you are doing about it."
    },
    {
      "id": 117,
      "text": "But you will see that answer is actually quite clever because that weakness you give is actually a strength and it is attractive to any employer."
    },
    {
      "id": 118,
      "text": "Because you are saying you enjoy being at work, you are always working, you love your role and you are prepared to put the hours in necessary."
    },
    {
      "id": 119,
      "text": "Next interview questions, what are your salary expectations?"
    },
    {
      "id": 120,
      "text": "Now again, this is a tricky interview question because on the one hand we don't want to go in with an unrealistic salary expectation, but on the other we don't want to devalue ourselves either."
    },
    {
      "id": 121,
      "text": "So your answer has to offer a win-win situation."
    },
    {
      "id": 122,
      "text": "One that is a benefit to you, but also to the hiring manager or the employer."
    },
    {
      "id": 123,
      "text": "So we can answer this in the following manner."
    },
    {
      "id": 124,
      "text": "I have conducted some research prior to attending the interview and what I feel would be a fair salary for this position."
    },
    {
      "id": 125,
      "text": "Now the average salary for a software engineer in this industry is 90,000 to $110,000."
    },
    {
      "id": 126,
      "text": "Now whilst I do feel I am worth the higher salary band, I understand you don't know me and I need to prove to you my worth."
    },
    {
      "id": 127,
      "text": "On that basis I would feel comfortable with a salary of $120,000 and I feel you will see a positive return on your investment at this level if you hire me."
    },
    {
      "id": 128,
      "text": "So you are not going in there over confidence, but you are not devaluing yourself either."
    },
    {
      "id": 129,
      "text": "So that is a win-win situation."
    },
    {
      "id": 130,
      "text": "So do your own research and look at what the average salary for a software engineer is within your industry and then look at the band and then go slightly above the middle of that average salary range."
    },
    {
      "id": 131,
      "text": "Okay, three questions to ask in your software engineer interview. So you get to the end of the interview and they say to you, do you have any questions you would like to ask?"
    },
    {
      "id": 132,
      "text": "My advice is to ask three questions."
    },
    {
      "id": 133,
      "text": "Now these questions are designed to show that you are keen, you are enthusiastic and you have the success of their organization at the forefront of your mind."
    },
    {
      "id": 134,
      "text": "So the first question is, what is frustrated you about software engineers you have employed in the past?"
    },
    {
      "id": 135,
      "text": "It's quite clever question because it shows that you want to go in there, you want to do a good job and you are putting their needs first above your own."
    },
    {
      "id": 136,
      "text": "Second question is, what are the plans for the company over the next five to ten years and how could I help you to achieve them?"
    },
    {
      "id": 137,
      "text": "Again, you are looking to the future."
    },
    {
      "id": 138,
      "text": "These tells me that you are considering staying with my organization for many years to come and you want to help me achieve my goals and then finally, what's the first thing you would like me to concentrate on in this role?"
    },
    {
      "id": 139,
      "text": "So those three questions are great because they put you across as a positive person and somebody who is interested more in the success of their company as opposed to the success of yourself."
    },
    {
      "id": 140,
      "text": "So don't forget download a copy of these slides by clicking the link in the top right and corner of the video."
    },
    {
      "id": 141,
      "text": "You can connect with me on LinkedIn if you want to. My LinkedIn description is, sorry, my LinkedIn link is in the description below the video."
    },
    {
      "id": 142,
      "text": "So go through to that, click it and connect with me on LinkedIn. It's always good to connect with like-minded professionals."
    },
    {
      "id": 143,
      "text": "Thank you for watching. Don't forget to subscribe and hit the like button. Thank you very much."
    },
    {
      "id": 144,
      "text": "And I wish you all the best to pass in your software, engineer, interview, have a brilliant day. Thank you very much."
    }
  ]
}