{
  "file": "crzHgef-x1c.wav",
  "text": " Hello there, my name is Richard McMunn from the Interview Training website, passmaintovue.com, and in this very important interview training video, I will teach you the best way to answer difficult, behavioral interview questions. During your job interview, you will have to answer questions such as, tell me about a time when you worked on a team, and tell me about a time when you had to work under pressure. It is imperative you answer these questions by using the star method. So if you want to pass your interview at the first attempt, please make sure you stay tuned, because I will cover the following four things in this video. Number one, I will tell you what the 17 most asked behavioral interview questions are. Number two, I will then teach you how to use the star method for answering these challenging interview questions. Number three, I am then going to give you a brilliant example answer to each behavioral interview question, to ensure you pass your interview at the first attempt. And then finally, number four, I will tell you where you can instantly download my full set of 17 scripted top scoring answers to difficult, behavioral interview questions, and just very quickly. If you are new to my channel, please make sure you hit that subscribe button. Thousands of you, and I mean thousands of you, are passing your interviews at the first attempt. It makes it far easier for me to teach you when you are subscribed, and please hit the like button, because that really does motivate me to create more great content for you. Thank you very much indeed. Now in the first part of this training lesson, I will teach you how to use the star method for answering behavioral interview questions, now the star method is a recognized structure for correctly answering behavioral interview questions. If you use the star method, the hiring manager will be more likely to offer you the job. Now star stands for situation, task, action, and result. So whenever you are answering any behavioral interview question, make sure you use the star method. So you start your answer by briefly explaining the situation you were in. You will next explain the task that needed doing, the task that needed your attention. You will then move on and give in depth details of the action you took to achieve the task before finally, telling the hiring manager the results following your actions. Now in the example answers that follow, you will notice I use the star method. It is a brilliant way to structure your answers to behavioral interview questions. Now one of the first most common behavioral interview questions is, can you describe a time when you worked well in a team? Now you have to give a specific situation when you collaborated as part of a team to achieve a common goal. So let me now give you a brilliant example answer that uses the star method, situation, task, action, and result. Can you describe a time when you worked well in a team? Here we go. In my previous role, I worked as part of a team to launch a new company product. My task was to collaborate with my team and different company departments to ensure the company's new product sales were strong. I initiated a team meeting to brainstorm ideas. After the meeting, we had a list of five great ideas ranging from targeting new customers on social media to offering previous customers a discount code, and also prominently displaying the new product on the company's website homepage. We then allocated tasks to team members based on their strengths with a clear brief. Those with marketing skills took care of social media, advertising, and the IT department arranged for a homepage upgrade. By having a plan, ensuring everyone new, or combined objectives, and setting a timeline for implementation, the product was launched with great success yielding a 17% increase in sales compared to previous launches. So that is a brilliant example answer that uses a star method that is guaranteed to score highly with any hiring manager during a job interview. Let's now move on to the second most common behavioral interview question. And that is, tell me about a time you faced a challenging problem at work. How did you solve it? So let me give you another brilliant example answer again that uses the fantastic star method. Tell me about a time you faced a challenging problem at work. How did you solve it? Here we go. In my previous job, I noticed that we had received several negative online reviews, which were starting to impact sales. My task was to investigate the cause of the negative reviews to ensure the company succeeded. After reading all of the negative reviews and speaking to customers on the telephone, I established that there had been unacceptable delays in them receiving their orders. Further investigation revealed that a supplier was failing to meet their contract requirements to deliver all goods directly to customers within 48 hours. After contacting the supplier, they could not provide adequate reasons for the delay. With the permission of my manager, I sourced a new supplier with a reputation for quality and speed of delivery. After signing a contract with the new supplier, that included penalties for late delivery, customer satisfaction and online reviews improved significantly. So that is another really good example answer again that uses the star method of situation task action and result. It's a brilliant example of when you have took action to solve a difficult problem at work. Now don't go anywhere because I still have many more behavioral interview questions and top scoring answers to give you. But when you are ready, click the link in the top right hand corner of the video and you can head straight through to my website, passmain to view.com, where you can instantly download these slides plus my full set of 17 top scoring scripted answers to behavioral interview questions. But here is the next question that comes up all the time in job interviews. Describe a situation where you have to make a quick decision under pressure. So this example answer is also useful for the question, tell me about the time when you have to work under pressure. Here is my brilliant example star method answer. Describe a situation where you have to make a quick decision under pressure. In a previous role, I gave a presentation to my team on improving customer service standards, part way through the presentation the project has stopped working. Now my task was to continue delivering the presentation using a different format. Now I remained calm and quickly assessed my options. There was a flip chart in the room, so I delivered my presentation from memory using a more engaging presentation style. I asked the team during the presentation, how they felt we could improve customer service standards while also incorporating what I could remember from my presentation slides. At the end of the presentation, my manager praised my quick thinking and everyone on the team felt a presentation was more effective due to the increased audience engagement. So that is a really good example answer. When you are thinking on your feet, you are under pressure, but you make a quick decision that enables you to achieve your objective. It is a brilliant example answer again that uses our star method. Behavioral interview question number four, tell me about the time you had a conflict with a coworker. How did you handle it? Now this is a really difficult question to answer, but let me give you another top scoring response that uses the star method. Tell me about the time you had a conflict with a coworker. How did you handle it? I overheard a colleague making inappropriate comments towards a new team member in a previous role. My task was to challenge their behavior and also educate them on why their actions were hurtful and how they went against company policy. I calmly challenged them while they were making the comments. They became defensive. I asked to speak to them privately. During the meeting, I outlined the company's policy on inappropriate behavior before explaining how their comments were upsetting to the new team member who needed our support while integrating into the team. After listening, they agreed not to repeat their comments before apologizing to the new team member. Now, at the next team meeting, I reinforced to all team members the importance of mutual respect in the workplace. That is a really good answer because you are not afraid to challenge inappropriate behavior. You have a conflict, but you are able to resolve it for the team's benefit. It's another really good top scoring answer that will definitely impress any hiring manager. Behavioral Interview Question Number Five. Can you give an example of when you made a mistake at work? How did you handle it? Now, do not say, I never make mistakes. If you do, you will probably fail your interview. This question, this behavioral question, is assessing your willingness to take ownership of your mistakes and also improve. So, let me give you my star method answer to this difficult behavioral interview question. Can you give an example of when you made a mistake at work? How did you handle it? Here we go. I accidentally gave a customer incorrect pricing information on the telephone for a product they wanted to purchase. As soon as I got off the phone, I realized the information I had provided was inaccurate. I needed to take responsibility for the mistake and contact the customer to explain what had happened. Before calling the customer, I planned what I would say and the solution I would offer them. I called the customer to apologize. I was honest, sincere, and empathetic before telling them the correct price. Now, because the actual price was outside of their budget, I gave them several alternative products that I felt would better suit their needs. I also provided a 10% discount on the price due to my mistake and the inconvenience it had caused. Now, the customer thanked me for my honesty and they took up the offer of a 10% discount. To ensure the same mistake was not made again, I created a product pricing list sheet and placed it next to my phone, so that I had the correct pricing information directly in front of me when talking to customers. That is a really good answer. It shows that you take ownership of any mistake you make, you apologise, you are honest. You also take action to help deliver excellent customer service because you are offering a 10% discount, but you are then taking steps to make sure the same mistake never happens again. And that is crucial when answering that common behavioral interview question. Let's now move on to question number six. Describe a time when you took the lead on a project or task without being asked. Now, this is a really difficult answer, but let me give you another top scoring star method response. Describe a time when you took the lead on a project or task without being asked, here we go. In my previous role, I noticed a recurring issue. Many customers were struggling to use one of our products. This led to a surging complaints and an increased workload for customer service agents who spent at least five minutes per call, explaining basic product functions. Now, despite this being a persistent issue, no proactive steps had been taken to resolve it. I decided to take the lead and find a solution to improve customer service standards. I initiated a solution by designing clear step-by-step instructions to be included in every product package. To ensure these instructions were used, I collaborated with colleagues to test them and refine the wording. Additionally, I proposed creating a short instructional video with a QR code printed on the packaging, allowing customers to scan and watch a demonstration. Now, the implementation of the solution led to a significant reduction in customer complaints and customer service agents were able to redirect their time to more complex inquiries. Now, ultimately, this improved overall customer satisfaction and brand perception. That, I am sure you will agree, is a brilliant, top scoring answer that's going to help you pass your interview. Behavioral interview question number seven, give me an example of when you had to collaborate with a difficult colleague. Wow, this is a really top one to answer, but let me give you a great response again that uses our star method situation task action and result. Give me an example of when you had to collaborate with a difficult colleague. Here we go. In a previous role, a long-serving team member was constantly late with task completion and they often spread this information to other team members about the direction of the company creating dissatisfaction and low morale. Now, because I cared about the company, I decided to speak to them about their words and actions to increase productivity and also improve team morale. Now, I asked to speak to them privately away from the other team members. I explained that their timekeeping was setting a poor example to the rest of the team and also asked them what they hoped to gain from spreading disinformation. I gave them several examples of false information they had given to the team and it also raised concerns about how their words were starting to affect team morale. Once I reinforced how important their experience and expertise were to the team and how they had a duty to help create a positive work environment, they agreed to change their ways. Now, several weeks later, I noticed a marked improvement in their work output and attitude. So that's a really good example where you are not afraid to deal with a difficult colleague to achieve a successful outcome. It's great because you are saying you care about the company and you want the team to be effective. So you are being calm and professional in your actions. It's a really good example response. Let's now move on to behavioral interview question number eight. Tell me about a time when you have to act quickly to solve a difficult problem. Here is a fantastic top scoring answer that uses the star method this will definitely impress every hiring manager. Here we go. Tell me about a time when you had to act quickly to solve a difficult problem. At my last job, I received a call from a local hotel informing me that the company scheduled meeting the following day could not be held due to a flood that had occurred at the hotel overnight. Now, 20 people were due to attend the meeting. I decided to show leadership skills and act quickly to source a new venue for the meeting. I called around suitable alternative venues in the local area and chose one that was cost effective close to transport links and could provide refreshments during the meeting. Once the venue had been confirmed, I informed my manager about the situation and my actions. He thanked me for my quick thinking actions before permitting me to contact all meeting attendees with the updated venue change. Now, that is another great response. Now you will see that we have covered eight behavioral interview questions. Now here is a list of the other behavioral interview questions that come up all the time during job interviews question number nine. Tell me about a time when you received constructive criticism. How did you respond? Question number 10. Tell me about a situation where you have to persuade others to see things your way. Question 11. Tell me about a time when your actions had a positive impact on a team. Behavioral interview question 12. Tell me about a time when you went above and beyond at work. Number 13. Describe a time in your work when you dealt with ambiguity. Wow, that is a really tricky one to answer. Question 14. Tell me about a time when you had to make an important decision with limited information. Number 15. Tell me about a time you helped to co-worker learn a new skill or develop an existing one. Number 16. Tell me about a time when you had to adapt to significant changes at work. Finally, question number 17. Describe a situation where you had multiple deadlines to meet. How did you prioritize your work? So there's 17 most common behavioral interview questions. Now if you want to download the answers I have just given you plus brilliant star method answers to those other questions. I mean, you get brilliant responses to all 17 click that link right now in the top right and corner of the video. You can head straight through to my website to passmain interview.com and you can instantly download these slides with those eight behavioral interview questions and answers plus you get top scoring responses. To the remainder of those questions, I just showed you on the previous slide. Click the link to get them right now. Also, don't forget to hit that subscribe button. I am serious. Thousands of you literally thousands and thousands of you are passing your job interviews at the first attempt. I am very passionate about helping you achieve your career goals. I can only help you when you are subscribed. Please hit the like button because a lot of time and effort goes into making these videos. And if I see you liking the content that motivates me to create more for you and also don't forget to connect with me on LinkedIn. I have put my LinkedIn link in the description below the video. I am always an absolute honor and a pleasure to connect with like my professional such as yourself. Thank you very much for watching and I wish you the very best for passing your job interview. Have a brilliant day.",
  "segments": [
    {
      "id": 0,
      "text": "Hello there, my name is Richard McMunn from the Interview Training website, passmaintovue.com,"
    },
    {
      "id": 1,
      "text": "and in this very important interview training video, I will teach you the best way to answer difficult,"
    },
    {
      "id": 2,
      "text": "behavioral interview questions. During your job interview, you will have to answer questions such as,"
    },
    {
      "id": 3,
      "text": "tell me about a time when you worked on a team, and tell me about a time when you had to work under pressure."
    },
    {
      "id": 4,
      "text": "It is imperative you answer these questions by using the star method."
    },
    {
      "id": 5,
      "text": "So if you want to pass your interview at the first attempt, please make sure you stay tuned,"
    },
    {
      "id": 6,
      "text": "because I will cover the following four things in this video."
    },
    {
      "id": 7,
      "text": "Number one, I will tell you what the 17 most asked behavioral interview questions are."
    },
    {
      "id": 8,
      "text": "Number two, I will then teach you how to use the star method for answering these challenging interview questions."
    },
    {
      "id": 9,
      "text": "Number three, I am then going to give you a brilliant example answer to each behavioral interview question,"
    },
    {
      "id": 10,
      "text": "to ensure you pass your interview at the first attempt."
    },
    {
      "id": 11,
      "text": "And then finally, number four, I will tell you where you can instantly download my full set of 17 scripted top scoring answers"
    },
    {
      "id": 12,
      "text": "to difficult, behavioral interview questions, and just very quickly."
    },
    {
      "id": 13,
      "text": "If you are new to my channel, please make sure you hit that subscribe button."
    },
    {
      "id": 14,
      "text": "Thousands of you, and I mean thousands of you, are passing your interviews at the first attempt."
    },
    {
      "id": 15,
      "text": "It makes it far easier for me to teach you when you are subscribed, and please hit the like button,"
    },
    {
      "id": 16,
      "text": "because that really does motivate me to create more great content for you."
    },
    {
      "id": 17,
      "text": "Thank you very much indeed."
    },
    {
      "id": 18,
      "text": "Now in the first part of this training lesson, I will teach you how to use the star method for answering behavioral interview questions,"
    },
    {
      "id": 19,
      "text": "now the star method is a recognized structure for correctly answering behavioral interview questions."
    },
    {
      "id": 20,
      "text": "If you use the star method, the hiring manager will be more likely to offer you the job."
    },
    {
      "id": 21,
      "text": "Now star stands for situation, task, action, and result."
    },
    {
      "id": 22,
      "text": "So whenever you are answering any behavioral interview question, make sure you use the star method."
    },
    {
      "id": 23,
      "text": "So you start your answer by briefly explaining the situation you were in."
    },
    {
      "id": 24,
      "text": "You will next explain the task that needed doing, the task that needed your attention."
    },
    {
      "id": 25,
      "text": "You will then move on and give in depth details of the action you took to achieve the task before finally,"
    },
    {
      "id": 26,
      "text": "telling the hiring manager the results following your actions."
    },
    {
      "id": 27,
      "text": "Now in the example answers that follow, you will notice I use the star method."
    },
    {
      "id": 28,
      "text": "It is a brilliant way to structure your answers to behavioral interview questions."
    },
    {
      "id": 29,
      "text": "Now one of the first most common behavioral interview questions is, can you describe a time when you worked well in a team?"
    },
    {
      "id": 30,
      "text": "Now you have to give a specific situation when you collaborated as part of a team to achieve a common goal."
    },
    {
      "id": 31,
      "text": "So let me now give you a brilliant example answer that uses the star method, situation, task, action, and result."
    },
    {
      "id": 32,
      "text": "Can you describe a time when you worked well in a team?"
    },
    {
      "id": 33,
      "text": "Here we go."
    },
    {
      "id": 34,
      "text": "In my previous role, I worked as part of a team to launch a new company product."
    },
    {
      "id": 35,
      "text": "My task was to collaborate with my team and different company departments to ensure the company's new product sales were strong."
    },
    {
      "id": 36,
      "text": "I initiated a team meeting to brainstorm ideas."
    },
    {
      "id": 37,
      "text": "After the meeting, we had a list of five great ideas ranging from targeting new customers on social media to offering previous customers a discount code,"
    },
    {
      "id": 38,
      "text": "and also prominently displaying the new product on the company's website homepage."
    },
    {
      "id": 39,
      "text": "We then allocated tasks to team members based on their strengths with a clear brief."
    },
    {
      "id": 40,
      "text": "Those with marketing skills took care of social media, advertising, and the IT department arranged for a homepage upgrade."
    },
    {
      "id": 41,
      "text": "By having a plan, ensuring everyone new, or combined objectives, and setting a timeline for implementation, the product was launched with great success yielding a 17% increase in sales compared to previous launches."
    },
    {
      "id": 42,
      "text": "So that is a brilliant example answer that uses a star method that is guaranteed to score highly with any hiring manager during a job interview."
    },
    {
      "id": 43,
      "text": "Let's now move on to the second most common behavioral interview question."
    },
    {
      "id": 44,
      "text": "And that is, tell me about a time you faced a challenging problem at work."
    },
    {
      "id": 45,
      "text": "How did you solve it? So let me give you another brilliant example answer again that uses the fantastic star method."
    },
    {
      "id": 46,
      "text": "Tell me about a time you faced a challenging problem at work. How did you solve it? Here we go."
    },
    {
      "id": 47,
      "text": "In my previous job, I noticed that we had received several negative online reviews, which were starting to impact sales."
    },
    {
      "id": 48,
      "text": "My task was to investigate the cause of the negative reviews to ensure the company succeeded."
    },
    {
      "id": 49,
      "text": "After reading all of the negative reviews and speaking to customers on the telephone, I established that there had been unacceptable delays in them receiving their orders."
    },
    {
      "id": 50,
      "text": "Further investigation revealed that a supplier was failing to meet their contract requirements to deliver all goods directly to customers within 48 hours."
    },
    {
      "id": 51,
      "text": "After contacting the supplier, they could not provide adequate reasons for the delay."
    },
    {
      "id": 52,
      "text": "With the permission of my manager, I sourced a new supplier with a reputation for quality and speed of delivery."
    },
    {
      "id": 53,
      "text": "After signing a contract with the new supplier, that included penalties for late delivery, customer satisfaction and online reviews improved significantly."
    },
    {
      "id": 54,
      "text": "So that is another really good example answer again that uses the star method of situation task action and result."
    },
    {
      "id": 55,
      "text": "It's a brilliant example of when you have took action to solve a difficult problem at work."
    },
    {
      "id": 56,
      "text": "Now don't go anywhere because I still have many more behavioral interview questions and top scoring answers to give you."
    },
    {
      "id": 57,
      "text": "But when you are ready, click the link in the top right hand corner of the video and you can head straight through to my website, passmain to view.com, where you can instantly download these slides plus my full set of 17 top scoring scripted answers to behavioral interview questions."
    },
    {
      "id": 58,
      "text": "But here is the next question that comes up all the time in job interviews."
    },
    {
      "id": 59,
      "text": "Describe a situation where you have to make a quick decision under pressure."
    },
    {
      "id": 60,
      "text": "So this example answer is also useful for the question, tell me about the time when you have to work under pressure."
    },
    {
      "id": 61,
      "text": "Here is my brilliant example star method answer."
    },
    {
      "id": 62,
      "text": "Describe a situation where you have to make a quick decision under pressure."
    },
    {
      "id": 63,
      "text": "In a previous role, I gave a presentation to my team on improving customer service standards, part way through the presentation the project has stopped working."
    },
    {
      "id": 64,
      "text": "Now my task was to continue delivering the presentation using a different format."
    },
    {
      "id": 65,
      "text": "Now I remained calm and quickly assessed my options."
    },
    {
      "id": 66,
      "text": "There was a flip chart in the room, so I delivered my presentation from memory using a more engaging presentation style."
    },
    {
      "id": 67,
      "text": "I asked the team during the presentation, how they felt we could improve customer service standards while also incorporating what I could remember from my presentation slides."
    },
    {
      "id": 68,
      "text": "At the end of the presentation, my manager praised my quick thinking and everyone on the team felt a presentation was more effective due to the increased audience engagement."
    },
    {
      "id": 69,
      "text": "So that is a really good example answer."
    },
    {
      "id": 70,
      "text": "When you are thinking on your feet, you are under pressure, but you make a quick decision that enables you to achieve your objective."
    },
    {
      "id": 71,
      "text": "It is a brilliant example answer again that uses our star method."
    },
    {
      "id": 72,
      "text": "Behavioral interview question number four, tell me about the time you had a conflict with a coworker."
    },
    {
      "id": 73,
      "text": "How did you handle it?"
    },
    {
      "id": 74,
      "text": "Now this is a really difficult question to answer, but let me give you another top scoring response that uses the star method."
    },
    {
      "id": 75,
      "text": "Tell me about the time you had a conflict with a coworker."
    },
    {
      "id": 76,
      "text": "How did you handle it?"
    },
    {
      "id": 77,
      "text": "I overheard a colleague making inappropriate comments towards a new team member in a previous role."
    },
    {
      "id": 78,
      "text": "My task was to challenge their behavior and also educate them on why their actions were hurtful and how they went against company policy."
    },
    {
      "id": 79,
      "text": "I calmly challenged them while they were making the comments."
    },
    {
      "id": 80,
      "text": "They became defensive. I asked to speak to them privately."
    },
    {
      "id": 81,
      "text": "During the meeting, I outlined the company's policy on inappropriate behavior before explaining how their comments were upsetting to the new team member who needed our support while integrating into the team."
    },
    {
      "id": 82,
      "text": "After listening, they agreed not to repeat their comments before apologizing to the new team member."
    },
    {
      "id": 83,
      "text": "Now, at the next team meeting, I reinforced to all team members the importance of mutual respect in the workplace."
    },
    {
      "id": 84,
      "text": "That is a really good answer because you are not afraid to challenge inappropriate behavior."
    },
    {
      "id": 85,
      "text": "You have a conflict, but you are able to resolve it for the team's benefit."
    },
    {
      "id": 86,
      "text": "It's another really good top scoring answer that will definitely impress any hiring manager."
    },
    {
      "id": 87,
      "text": "Behavioral Interview Question Number Five."
    },
    {
      "id": 88,
      "text": "Can you give an example of when you made a mistake at work?"
    },
    {
      "id": 89,
      "text": "How did you handle it?"
    },
    {
      "id": 90,
      "text": "Now, do not say, I never make mistakes."
    },
    {
      "id": 91,
      "text": "If you do, you will probably fail your interview."
    },
    {
      "id": 92,
      "text": "This question, this behavioral question, is assessing your willingness to take ownership of your mistakes and also improve."
    },
    {
      "id": 93,
      "text": "So, let me give you my star method answer to this difficult behavioral interview question."
    },
    {
      "id": 94,
      "text": "Can you give an example of when you made a mistake at work?"
    },
    {
      "id": 95,
      "text": "How did you handle it? Here we go."
    },
    {
      "id": 96,
      "text": "I accidentally gave a customer incorrect pricing information on the telephone for a product they wanted to purchase."
    },
    {
      "id": 97,
      "text": "As soon as I got off the phone, I realized the information I had provided was inaccurate."
    },
    {
      "id": 98,
      "text": "I needed to take responsibility for the mistake and contact the customer to explain what had happened."
    },
    {
      "id": 99,
      "text": "Before calling the customer, I planned what I would say and the solution I would offer them."
    },
    {
      "id": 100,
      "text": "I called the customer to apologize."
    },
    {
      "id": 101,
      "text": "I was honest, sincere, and empathetic before telling them the correct price."
    },
    {
      "id": 102,
      "text": "Now, because the actual price was outside of their budget, I gave them several alternative products that I felt"
    },
    {
      "id": 103,
      "text": "would better suit their needs."
    },
    {
      "id": 104,
      "text": "I also provided a 10% discount on the price due to my mistake and the inconvenience it had caused."
    },
    {
      "id": 105,
      "text": "Now, the customer thanked me for my honesty and they took up the offer of a 10% discount."
    },
    {
      "id": 106,
      "text": "To ensure the same mistake was not made again, I created a product pricing list sheet and placed it next to my phone,"
    },
    {
      "id": 107,
      "text": "so that I had the correct pricing information directly in front of me when talking to customers."
    },
    {
      "id": 108,
      "text": "That is a really good answer. It shows that you take ownership of any mistake you make, you apologise, you are honest."
    },
    {
      "id": 109,
      "text": "You also take action to help deliver excellent customer service because you are offering a 10% discount,"
    },
    {
      "id": 110,
      "text": "but you are then taking steps to make sure the same mistake never happens again."
    },
    {
      "id": 111,
      "text": "And that is crucial when answering that common behavioral interview question."
    },
    {
      "id": 112,
      "text": "Let's now move on to question number six."
    },
    {
      "id": 113,
      "text": "Describe a time when you took the lead on a project or task without being asked."
    },
    {
      "id": 114,
      "text": "Now, this is a really difficult answer, but let me give you another top scoring star method response."
    },
    {
      "id": 115,
      "text": "Describe a time when you took the lead on a project or task without being asked, here we go."
    },
    {
      "id": 116,
      "text": "In my previous role, I noticed a recurring issue. Many customers were struggling to use one of our products."
    },
    {
      "id": 117,
      "text": "This led to a surging complaints and an increased workload for customer service agents who spent at least five minutes per call, explaining basic product functions."
    },
    {
      "id": 118,
      "text": "Now, despite this being a persistent issue, no proactive steps had been taken to resolve it."
    },
    {
      "id": 119,
      "text": "I decided to take the lead and find a solution to improve customer service standards."
    },
    {
      "id": 120,
      "text": "I initiated a solution by designing clear step-by-step instructions to be included in every product package."
    },
    {
      "id": 121,
      "text": "To ensure these instructions were used, I collaborated with colleagues to test them and refine the wording."
    },
    {
      "id": 122,
      "text": "Additionally, I proposed creating a short instructional video with a QR code printed on the packaging, allowing customers to scan and watch a demonstration."
    },
    {
      "id": 123,
      "text": "Now, the implementation of the solution led to a significant reduction in customer complaints and customer service agents were able to redirect their time to more complex inquiries."
    },
    {
      "id": 124,
      "text": "Now, ultimately, this improved overall customer satisfaction and brand perception."
    },
    {
      "id": 125,
      "text": "That, I am sure you will agree, is a brilliant, top scoring answer that's going to help you pass your interview."
    },
    {
      "id": 126,
      "text": "Behavioral interview question number seven, give me an example of when you had to collaborate with a difficult colleague."
    },
    {
      "id": 127,
      "text": "Wow, this is a really top one to answer, but let me give you a great response again that uses our star method situation task action and result."
    },
    {
      "id": 128,
      "text": "Give me an example of when you had to collaborate with a difficult colleague. Here we go."
    },
    {
      "id": 129,
      "text": "In a previous role, a long-serving team member was constantly late with task completion and they often spread this information to other team members about the direction of the company creating dissatisfaction and low morale."
    },
    {
      "id": 130,
      "text": "Now, because I cared about the company, I decided to speak to them about their words and actions to increase productivity and also improve team morale."
    },
    {
      "id": 131,
      "text": "Now, I asked to speak to them privately away from the other team members. I explained that their timekeeping was setting a poor example to the rest of the team and also asked them what they hoped to gain from spreading disinformation."
    },
    {
      "id": 132,
      "text": "I gave them several examples of false information they had given to the team and it also raised concerns about how their words were starting to affect team morale."
    },
    {
      "id": 133,
      "text": "Once I reinforced how important their experience and expertise were to the team and how they had a duty to help create a positive work environment, they agreed to change their ways."
    },
    {
      "id": 134,
      "text": "Now, several weeks later, I noticed a marked improvement in their work output and attitude. So that's a really good example where you are not afraid to deal with a difficult colleague to achieve a successful outcome."
    },
    {
      "id": 135,
      "text": "It's great because you are saying you care about the company and you want the team to be effective. So you are being calm and professional in your actions. It's a really good example response."
    },
    {
      "id": 136,
      "text": "Let's now move on to behavioral interview question number eight. Tell me about a time when you have to act quickly to solve a difficult problem."
    },
    {
      "id": 137,
      "text": "Here is a fantastic top scoring answer that uses the star method this will definitely impress every hiring manager. Here we go."
    },
    {
      "id": 138,
      "text": "Tell me about a time when you had to act quickly to solve a difficult problem."
    },
    {
      "id": 139,
      "text": "At my last job, I received a call from a local hotel informing me that the company scheduled meeting the following day could not be held due to a flood that had occurred at the hotel overnight."
    },
    {
      "id": 140,
      "text": "Now, 20 people were due to attend the meeting. I decided to show leadership skills and act quickly to source a new venue for the meeting."
    },
    {
      "id": 141,
      "text": "I called around suitable alternative venues in the local area and chose one that was cost effective close to transport links and could provide refreshments during the meeting."
    },
    {
      "id": 142,
      "text": "Once the venue had been confirmed, I informed my manager about the situation and my actions. He thanked me for my quick thinking actions before permitting me to contact all meeting attendees with the updated venue change."
    },
    {
      "id": 143,
      "text": "Now, that is another great response. Now you will see that we have covered eight behavioral interview questions."
    },
    {
      "id": 144,
      "text": "Now here is a list of the other behavioral interview questions that come up all the time during job interviews question number nine."
    },
    {
      "id": 145,
      "text": "Tell me about a time when you received constructive criticism. How did you respond? Question number 10. Tell me about a situation where you have to persuade others to see things your way."
    },
    {
      "id": 146,
      "text": "Question 11. Tell me about a time when your actions had a positive impact on a team."
    },
    {
      "id": 147,
      "text": "Behavioral interview question 12. Tell me about a time when you went above and beyond at work."
    },
    {
      "id": 148,
      "text": "Number 13. Describe a time in your work when you dealt with ambiguity. Wow, that is a really tricky one to answer. Question 14."
    },
    {
      "id": 149,
      "text": "Tell me about a time when you had to make an important decision with limited information."
    },
    {
      "id": 150,
      "text": "Number 15. Tell me about a time you helped to co-worker learn a new skill or develop an existing one."
    },
    {
      "id": 151,
      "text": "Number 16. Tell me about a time when you had to adapt to significant changes at work."
    },
    {
      "id": 152,
      "text": "Finally, question number 17. Describe a situation where you had multiple deadlines to meet. How did you prioritize your work?"
    },
    {
      "id": 153,
      "text": "So there's 17 most common behavioral interview questions. Now if you want to download the answers I have just given you plus brilliant star method answers to those other questions."
    },
    {
      "id": 154,
      "text": "I mean, you get brilliant responses to all 17 click that link right now in the top right and corner of the video."
    },
    {
      "id": 155,
      "text": "You can head straight through to my website to passmain interview.com and you can instantly download these slides with those eight behavioral interview questions and answers plus you get top scoring responses."
    },
    {
      "id": 156,
      "text": "To the remainder of those questions, I just showed you on the previous slide. Click the link to get them right now."
    },
    {
      "id": 157,
      "text": "Also, don't forget to hit that subscribe button. I am serious. Thousands of you literally thousands and thousands of you are passing your job interviews at the first attempt."
    },
    {
      "id": 158,
      "text": "I am very passionate about helping you achieve your career goals. I can only help you when you are subscribed. Please hit the like button because a lot of time and effort goes into making these videos."
    },
    {
      "id": 159,
      "text": "And if I see you liking the content that motivates me to create more for you and also don't forget to connect with me on LinkedIn. I have put my LinkedIn link in the description below the video."
    },
    {
      "id": 160,
      "text": "I am always an absolute honor and a pleasure to connect with like my professional such as yourself. Thank you very much for watching and I wish you the very best for passing your job interview. Have a brilliant day."
    }
  ]
}