{
  "file": "EClRCB6E0Fw.wav",
  "text": " Hi there, my name is Richard McMunn from the Interview Training website, PassMineToview.com and in this tutorial I am going to give you an Amazon mock interview to work through live on the screen. So if you have a job interview coming up with Amazon for any role whatsoever, make sure you watch this presentation from start to finish try the mock interview questions live on the screen because I believe it will help you to pass your interview. Now this is what I will cover during this Amazon mock interview. I will give you a list of Amazon interview questions to try live on the screen. So you will get three answer options to choose from for each interview question. So you choose which answer you would give during your real Amazon interview and we will then work through the best answers together. So this tutorial is going to help you to prepare fully for your Amazon interview. So let's start the mock interview. Now here are the rules of this Amazon mock interview. Step one, an interview question is going to appear live on the screen. Step two, you will then get three answer options to choose from. Step three, you then have just 10 seconds to decide which answer option you would choose during the real Amazon interview. So it's your job to tell me in the comments section below the video, which answer option you would choose for each interview question and I will mark your answers for you. So let's get into this Amazon mock interview. Now on the right hand side of the screen, you will see a timer and you have just 10 seconds to answer each question. So question number one, why do you want to work for Amazon? Answer option A, say you want to work for Amazon because it is a place you will get decent pay and benefits while working alongside happy and positive people. Answer option B, say you want to work for Amazon because it is an innovative company that is always moving forward and you will get to put your skills, qualities and experience to good use while working alongside other like minded professionals or answer options C, say you want to work for Amazon because it is the next stage in your career development and you only want to work for the best company, which answer will you choose for question number one? Tell me in the comments section below the video, here's your timer. Okay question number two of our Amazon mock interview, give me an example of a time when you couldn't find a solution to a problem. Would you choose answer option A? Tell the interviewer you have never been in a situation where you couldn't find a solution to a problem, would you choose answer option B? Give the interviewer a specific situation where you genuinely couldn't find a solution to a problem and what you learned from the experience or answer option C give the interviewer a specific situation where you genuinely couldn't find a solution to a problem and to overcome this challenge you utilize the skills knowledge and experience of the people in your team and then tell the interviewer what you learned from the experience, which would you choose A, B or C, here is your timer. Amazon mock interview question number three. Tell me about a time you had a conflict with a work colleague. Would you choose answer option A? Tell the interviewer about a time you experienced conflict with a work colleague and how you quickly took steps to resolve it amicably for the benefit of the wider team or would you choose answer option B? Tell the interviewer you've never experienced conflict with a work colleague and that you tend to get on with everyone or answer option C? Tell the interviewer about a time when you experience conflict with a work colleague and how you asked your manager for guidance on how to resolve it. Answer option A, B or C, which would you choose, here's a time. Amazon mock interview question number four. Tell me about a time when you were going to be late to with a deadline. Would you choose A, B or C? A, tell the interviewer you've never been late with a deadline and that you always make sure you complete all tasks and projects on time. Answer option B, tell the interviewer about a time when you did fail to meet a deadline and what you learned from the situation or answer option C? Tell the interviewer about a time when you thought you were going to be late with a deadline but you turned things around by working late and putting in the extra hours needed here's a time. Amazon mock interview question number five. What will you do if you get offered a great job from another company with a better salary after 12 months of starting worker Amazon? Would you tell the interviewer you are committed to working at Amazon and the money is not a motivating factor so you would turn down the job offer. Answer option B, tell the interviewer you want to stay working at Amazon and that you would discuss your salary with your manager to see if a rise was available or answer option C, tell the interviewer it is perfectly normal for you to move jobs after 12 months and you would seriously consider the job offer if it was from a reputable company which would you choose? Here's a timer. Amazon mock interview question number six if we asked you to complete a task you'd never done before how would you react? Answer option A, tell the interviewer you would agree to do the task quickly find out how to do it before then completing it on time and to a high standard. Option B, tell the interviewer you would suggest they see if anyone else in the team could do it because they may have the experience needed or answer option C, tell the interviewer you would ask them for help or guidance on how to complete the task and then do it to the best of your ability. A, B, or C in the comments section below here's a timer. Amazon mock interview question number seven tell me about a time when you took a calculated risk how would you answer this Amazon interview question? Option A, tell the interviewer you do not take risks because it would be wrong to put an organization in unnecessary danger. Answer option B, tell the interviewer about a time when you took a risk at work after you'd carefully weighed up the options and realize the benefits to the organization of taking the risk far outweigh the consequences or options C, tell the interviewer about a time when you considered taking a risk at work but after careful consideration you decided not to proceed with it. A, B, or C, here is a timer. Amazon mock interview question number eight, how would you deal with a rude customer? Answer option A, tell the interviewer you would inform the customer that you would not tolerate rude language or behavior from them and that they must stop before you proceeded to help them. Option B, tell the interviewer you would not take their comments or actions personally, you would listen to the establish what the problem was and then go all out to try and resolve any issues for them or C, tell the interviewer you would listen to the customer carefully, inform them that you would not tolerate rude behavior before then taking steps to resolve any issues for them. A, B, or C. A, B, or C, or C, or C, or C, or C, or C, or C, or C, or C, or C, or C, or C, or C, or C, or C, or C, or C, or C, or C, or C, Amazon mock interview question number nine, given an example of a time when you asked a customer for feedback, would you answer it A, tell the interviewer about a time when you asked a customer for feedback, then explaining detail how you used the feedback to improve the efficiency and performance of the business or answer option B, tell the interviewer about a time when you asked a customer for feedback, and then passed on the information to your manager or supervisor for them to implement, or answer option C, tell the interviewer you've never been in a position where you've had to ask a customer for feedback. A, B, or C in the comments section below, here is a time. Amazon mock interview question ten, how would you build trust with your work colleagues at Amazon? Would you say A? Say you would build trust by taking steps to get to know your work colleagues, by offering to support them in their work, and by making sure the work you do is to a high standard and on time, answer option B, say you would build trust by meeting up with your work colleagues outside of work to socialise. This is the best way to get to know your work colleagues on a personal level, which will then help to build trust quicker than any other method you know, or answer option C, say you will build trust by keeping your head down, carrying out your work to a high standard and on time. And if your work colleagues see that you are reliable, they will trust you. A, B, or C, here is a timer. And finally, question eleven before we start working through the answers together, how would you deal with a work colleague who was resisting to help you? Answer option A, say you would ignore them and seek help from someone else. You are a resilient person and you will always find a way around a problem. Answer option B, say you would inform your supervisor that they were not being helpful. So they could take the necessary action, or C, say you would take steps to build a better relationship with them and try and find out why they were resisting to help you. To achieve your goals at work, you will need the assistance of your work colleagues. A, B, or C, which one would you choose in the comment section below, here's a timer. Okay, well done for reaching the end. Now, we are going to work through the answers to the mock interview in a second. But it's important you tell me how many you got correct out of 11 in the comment section below the video. And just quickly before we work through those answers, when you're ready, if you click that link in the top right hand corner of the video, head over to my website, passmaintovie.com and you can download my full set of 22. Great answers to top Amazon interview questions. So if you want model exam pal answers to help you prepare for your Amazon interview, make sure you check that out once we've worked through these answers. So question one was, why do you want to work for Amazon A, B, or C? I would choose B. Say you want to work for Amazon because it is an innovative company that is always moving forward and you will get to put your skills, quality and experience to good use while working alongside other like-minded professionals. Question number two, give me an example of a time when you couldn't find a solution to a problem, I would choose answer options C. Give the interviewer a specific situation where you genuinely couldn't find a solution and to overcome it, you utilize the skills and knowledge and experience of the people in your team and then say what you learn from the experience. That's the best way to answer that Amazon interview question. Question three, tell me about a time you had a conflict with a colleague, choose A, tell the interviewer about a time you experience conflict with a work colleague and how you quickly took steps to resolve it amicably for the benefit of the wider team. We don't want to be informing our manager or supervisor, we need to sort out the conflict ourselves for the benefit of the team. Question four, tell me about a time when you were going to be late with a deadline, I would choose C, tell the interviewer about a time when you thought you were going to be late, but you turned things around by working late and putting in the extra hours needed. That's what I would want to hear from you, joining that Amazon interview question. Question five, what will you do if you get offered a great job from another company with a better salary after 12 months of starting worker Amazon these only one answer option? I would choose A, okay because I'm committed to Amazon I've already agreed to salary so I would turn it down because I believe Amazon is the best company anyway. Question six, if we asked you to complete a task you'd never done before, how would you react? Again I'd choose A, tell the interviewer you would agree to do the task, find out yourself how to do it and then complete it on time into a high standard. Question seven, tell me about a time when you took a calculated risk, this is a difficult one but I would go for B. Tell the interviewer about a time when you took a risk at work after you'd carefully weighed up the options and realised the benefits to the organisation of taking a risk that it far outweigh the consequences. Amazon takes calculated risks, it would not be as successful as it is if it had never taken a risk. Question eight, how would you deal with a rude customer? Amazon always puts customers first so I would choose B. Tell the interviewer you wouldn't take their comments or actions personally. You would listen to the customer, establish what the problem was and then go all out to try and resolve any issues for them. Question nine, given an example of a time when you asked a customer for feedback, again Amazon always puts the customer first so I would say, tell the interviewer about a time when you did ask a customer for feedback and you used the feedback to improve the efficiency and performance of the business. Number ten, how would you build trust with your work colleagues at Amazon? 100% A, say you would build trust by taking steps to get to know them, by offering to support them, by making sure the work you do is to a high standard on time and 11, how would you deal with a work colleague who was resisting you? To help you, C, say you would take steps to build a better relationship, find out why they were resisting you, because to achieve your goals, you have to work with work colleague, you need their assistance so that's the one I would choose. So tell me in the comments section below how many you got right out of 11. Did you get 11 out of 11? And the next thing of course, if you want example answers to all Amazon interview questions, click that link right now in the top right hand corner of the video and head over to my website, passmaintevue.com. I hope you've enjoyed that tutorial and I wish you all the best for passing your Amazon interview and have a brilliant day.",
  "segments": [
    {
      "id": 0,
      "text": "Hi there, my name is Richard McMunn from the Interview Training website,"
    },
    {
      "id": 1,
      "text": "PassMineToview.com and in this tutorial I am going to give you an Amazon mock interview"
    },
    {
      "id": 2,
      "text": "to work through live on the screen. So if you have a job interview coming up with Amazon"
    },
    {
      "id": 3,
      "text": "for any role whatsoever, make sure you watch this presentation from start to finish"
    },
    {
      "id": 4,
      "text": "try the mock interview questions live on the screen because I believe it will help you"
    },
    {
      "id": 5,
      "text": "to pass your interview. Now this is what I will cover during this Amazon mock interview."
    },
    {
      "id": 6,
      "text": "I will give you a list of Amazon interview questions to try live on the screen."
    },
    {
      "id": 7,
      "text": "So you will get three answer options to choose from for each interview question. So you choose"
    },
    {
      "id": 8,
      "text": "which answer you would give during your real Amazon interview and we will then work through the"
    },
    {
      "id": 9,
      "text": "best answers together. So this tutorial is going to help you to prepare fully for your Amazon"
    },
    {
      "id": 10,
      "text": "interview. So let's start the mock interview. Now here are the rules of this Amazon mock"
    },
    {
      "id": 11,
      "text": "interview. Step one, an interview question is going to appear live on the screen. Step two,"
    },
    {
      "id": 12,
      "text": "you will then get three answer options to choose from. Step three, you then have just 10 seconds"
    },
    {
      "id": 13,
      "text": "to decide which answer option you would choose during the real Amazon interview. So it's your"
    },
    {
      "id": 14,
      "text": "job to tell me in the comments section below the video, which answer option you would choose for each"
    },
    {
      "id": 15,
      "text": "interview question and I will mark your answers for you. So let's get into this Amazon mock"
    },
    {
      "id": 16,
      "text": "interview. Now on the right hand side of the screen, you will see a timer and you have just"
    },
    {
      "id": 17,
      "text": "10 seconds to answer each question. So question number one, why do you want to work for Amazon?"
    },
    {
      "id": 18,
      "text": "Answer option A, say you want to work for Amazon because it is a place you will get decent"
    },
    {
      "id": 19,
      "text": "pay and benefits while working alongside happy and positive people. Answer option B, say you want to"
    },
    {
      "id": 20,
      "text": "work for Amazon because it is an innovative company that is always moving forward and you will"
    },
    {
      "id": 21,
      "text": "get to put your skills, qualities and experience to good use while working alongside other"
    },
    {
      "id": 22,
      "text": "like minded professionals or answer options C, say you want to work for Amazon because it is"
    },
    {
      "id": 23,
      "text": "the next stage in your career development and you only want to work for the best company, which"
    },
    {
      "id": 24,
      "text": "answer will you choose for question number one? Tell me in the comments section below the video,"
    },
    {
      "id": 25,
      "text": "here's your timer."
    },
    {
      "id": 26,
      "text": "Okay question number two of our Amazon mock interview, give me an example of a time when you"
    },
    {
      "id": 27,
      "text": "couldn't find a solution to a problem. Would you choose answer option A? Tell the interviewer"
    },
    {
      "id": 28,
      "text": "you have never been in a situation where you couldn't find a solution to a problem,"
    },
    {
      "id": 29,
      "text": "would you choose answer option B? Give the interviewer a specific situation where you genuinely"
    },
    {
      "id": 30,
      "text": "couldn't find a solution to a problem and what you learned from the experience or answer"
    },
    {
      "id": 31,
      "text": "option C give the interviewer a specific situation where you genuinely couldn't find a solution to a"
    },
    {
      "id": 32,
      "text": "problem and to overcome this challenge you utilize the skills knowledge and experience of the"
    },
    {
      "id": 33,
      "text": "people in your team and then tell the interviewer what you learned from the experience, which would"
    },
    {
      "id": 34,
      "text": "you choose A, B or C, here is your timer. Amazon mock interview question number three. Tell me"
    },
    {
      "id": 35,
      "text": "about a time you had a conflict with a work colleague. Would you choose answer option A? Tell"
    },
    {
      "id": 36,
      "text": "the interviewer about a time you experienced conflict with a work colleague and how you quickly"
    },
    {
      "id": 37,
      "text": "took steps to resolve it amicably for the benefit of the wider team or would you choose answer"
    },
    {
      "id": 38,
      "text": "option B? Tell the interviewer you've never experienced conflict with a work colleague and that you"
    },
    {
      "id": 39,
      "text": "tend to get on with everyone or answer option C? Tell the interviewer about a time when you"
    },
    {
      "id": 40,
      "text": "experience conflict with a work colleague and how you asked your manager for guidance on how to resolve"
    },
    {
      "id": 41,
      "text": "it. Answer option A, B or C, which would you choose, here's a time."
    },
    {
      "id": 42,
      "text": "Amazon mock interview question number four. Tell me about a time when you were going to be late"
    },
    {
      "id": 43,
      "text": "to with a deadline. Would you choose A, B or C? A, tell the interviewer you've never been late with"
    },
    {
      "id": 44,
      "text": "a deadline and that you always make sure you complete all tasks and projects on time. Answer"
    },
    {
      "id": 45,
      "text": "option B, tell the interviewer about a time when you did fail to meet a deadline and what you learned"
    },
    {
      "id": 46,
      "text": "from the situation or answer option C? Tell the interviewer about a time when you thought you were"
    },
    {
      "id": 47,
      "text": "going to be late with a deadline but you turned things around by working late and putting in"
    },
    {
      "id": 48,
      "text": "the extra hours needed here's a time. Amazon mock interview question number five. What will you do"
    },
    {
      "id": 49,
      "text": "if you get offered a great job from another company with a better salary after 12 months of starting"
    },
    {
      "id": 50,
      "text": "worker Amazon? Would you tell the interviewer you are committed to working at Amazon and the money"
    },
    {
      "id": 51,
      "text": "is not a motivating factor so you would turn down the job offer. Answer option B, tell the interviewer"
    },
    {
      "id": 52,
      "text": "you want to stay working at Amazon and that you would discuss your salary with your manager to see"
    },
    {
      "id": 53,
      "text": "if a rise was available or answer option C, tell the interviewer it is perfectly normal for you"
    },
    {
      "id": 54,
      "text": "to move jobs after 12 months and you would seriously consider the job offer if it was from a"
    },
    {
      "id": 55,
      "text": "reputable company which would you choose? Here's a timer. Amazon mock interview question number six"
    },
    {
      "id": 56,
      "text": "if we asked you to complete a task you'd never done before how would you react? Answer option A,"
    },
    {
      "id": 57,
      "text": "tell the interviewer you would agree to do the task quickly find out how to do it before then"
    },
    {
      "id": 58,
      "text": "completing it on time and to a high standard. Option B, tell the interviewer you would suggest they see"
    },
    {
      "id": 59,
      "text": "if anyone else in the team could do it because they may have the experience needed or answer"
    },
    {
      "id": 60,
      "text": "option C, tell the interviewer you would ask them for help or guidance on how to complete the task"
    },
    {
      "id": 61,
      "text": "and then do it to the best of your ability. A, B, or C in the comments section below here's a timer."
    },
    {
      "id": 62,
      "text": "Amazon mock interview question number seven tell me about a time when you took a calculated risk"
    },
    {
      "id": 63,
      "text": "how would you answer this Amazon interview question? Option A, tell the interviewer you do not take"
    },
    {
      "id": 64,
      "text": "risks because it would be wrong to put an organization in unnecessary danger. Answer option B,"
    },
    {
      "id": 65,
      "text": "tell the interviewer about a time when you took a risk at work after you'd carefully weighed up"
    },
    {
      "id": 66,
      "text": "the options and realize the benefits to the organization of taking the risk far outweigh the consequences"
    },
    {
      "id": 67,
      "text": "or options C, tell the interviewer about a time when you considered taking a risk at work"
    },
    {
      "id": 68,
      "text": "but after careful consideration you decided not to proceed with it. A, B, or C, here is a timer."
    },
    {
      "id": 69,
      "text": "Amazon mock interview question number eight, how would you deal with a rude customer? Answer option A,"
    },
    {
      "id": 70,
      "text": "tell the interviewer you would inform the customer that you would not tolerate rude language or"
    },
    {
      "id": 71,
      "text": "behavior from them and that they must stop before you proceeded to help them. Option B, tell the"
    },
    {
      "id": 72,
      "text": "interviewer you would not take their comments or actions personally, you would listen to the"
    },
    {
      "id": 73,
      "text": "establish what the problem was and then go all out to try and resolve any issues for them or"
    },
    {
      "id": 74,
      "text": "C, tell the interviewer you would listen to the customer carefully, inform them that you would not"
    },
    {
      "id": 75,
      "text": "tolerate rude behavior before then taking steps to resolve any issues for them. A, B, or C."
    },
    {
      "id": 76,
      "text": "A, B, or C, or C, or C, or C, or C, or C, or C, or C, or C, or C, or C, or C, or C, or C, or C, or C, or C, or C, or C, or C,"
    },
    {
      "id": 77,
      "text": "Amazon mock interview question number nine, given an example of a time when you asked a customer for feedback,"
    },
    {
      "id": 78,
      "text": "would you answer it A, tell the interviewer about a time when you asked a customer for feedback,"
    },
    {
      "id": 79,
      "text": "then explaining detail how you used the feedback to improve the efficiency and performance of the business"
    },
    {
      "id": 80,
      "text": "or answer option B, tell the interviewer about a time when you asked a customer for feedback,"
    },
    {
      "id": 81,
      "text": "and then passed on the information to your manager or supervisor for them to implement,"
    },
    {
      "id": 82,
      "text": "or answer option C, tell the interviewer you've never been in a position where you've had to"
    },
    {
      "id": 83,
      "text": "ask a customer for feedback. A, B, or C in the comments section below, here is a time."
    },
    {
      "id": 84,
      "text": "Amazon mock interview question ten, how would you build trust with your work colleagues at Amazon?"
    },
    {
      "id": 85,
      "text": "Would you say A? Say you would build trust by taking steps to get to know your work colleagues,"
    },
    {
      "id": 86,
      "text": "by offering to support them in their work, and by making sure the work you do is to a high standard"
    },
    {
      "id": 87,
      "text": "and on time, answer option B, say you would build trust by meeting up with your work colleagues"
    },
    {
      "id": 88,
      "text": "outside of work to socialise. This is the best way to get to know your work colleagues on a personal"
    },
    {
      "id": 89,
      "text": "level, which will then help to build trust quicker than any other method you know, or answer"
    },
    {
      "id": 90,
      "text": "option C, say you will build trust by keeping your head down, carrying out your work to a high"
    },
    {
      "id": 91,
      "text": "standard and on time. And if your work colleagues see that you are reliable, they will trust you."
    },
    {
      "id": 92,
      "text": "A, B, or C, here is a timer. And finally, question eleven before we start working through"
    },
    {
      "id": 93,
      "text": "the answers together, how would you deal with a work colleague who was resisting to help you?"
    },
    {
      "id": 94,
      "text": "Answer option A, say you would ignore them and seek help from someone else. You are a resilient"
    },
    {
      "id": 95,
      "text": "person and you will always find a way around a problem. Answer option B, say you would inform your"
    },
    {
      "id": 96,
      "text": "supervisor that they were not being helpful. So they could take the necessary action, or"
    },
    {
      "id": 97,
      "text": "C, say you would take steps to build a better relationship with them and try and find out why they"
    },
    {
      "id": 98,
      "text": "were resisting to help you. To achieve your goals at work, you will need the assistance of your"
    },
    {
      "id": 99,
      "text": "work colleagues. A, B, or C, which one would you choose in the comment section below, here's a timer."
    },
    {
      "id": 100,
      "text": "Okay, well done for reaching the end. Now, we are going to work through the answers to the"
    },
    {
      "id": 101,
      "text": "mock interview in a second. But it's important you tell me how many you got correct out of 11"
    },
    {
      "id": 102,
      "text": "in the comment section below the video. And just quickly before we work through those answers,"
    },
    {
      "id": 103,
      "text": "when you're ready, if you click that link in the top right hand corner of the video,"
    },
    {
      "id": 104,
      "text": "head over to my website, passmaintovie.com and you can download my full set of 22."
    },
    {
      "id": 105,
      "text": "Great answers to top Amazon interview questions. So if you want model exam pal answers to help"
    },
    {
      "id": 106,
      "text": "you prepare for your Amazon interview, make sure you check that out once we've worked through"
    },
    {
      "id": 107,
      "text": "these answers. So question one was, why do you want to work for Amazon A, B, or C? I would choose"
    },
    {
      "id": 108,
      "text": "B. Say you want to work for Amazon because it is an innovative company that is always moving forward"
    },
    {
      "id": 109,
      "text": "and you will get to put your skills, quality and experience to good use while working alongside"
    },
    {
      "id": 110,
      "text": "other like-minded professionals. Question number two, give me an example of a time when you"
    },
    {
      "id": 111,
      "text": "couldn't find a solution to a problem, I would choose answer options C. Give the interviewer a"
    },
    {
      "id": 112,
      "text": "specific situation where you genuinely couldn't find a solution and to overcome it, you utilize"
    },
    {
      "id": 113,
      "text": "the skills and knowledge and experience of the people in your team and then say what you learn from"
    },
    {
      "id": 114,
      "text": "the experience. That's the best way to answer that Amazon interview question. Question three,"
    },
    {
      "id": 115,
      "text": "tell me about a time you had a conflict with a colleague, choose A, tell the interviewer about"
    },
    {
      "id": 116,
      "text": "a time you experience conflict with a work colleague and how you quickly took steps to resolve it"
    },
    {
      "id": 117,
      "text": "amicably for the benefit of the wider team. We don't want to be informing our manager or"
    },
    {
      "id": 118,
      "text": "supervisor, we need to sort out the conflict ourselves for the benefit of the team. Question four,"
    },
    {
      "id": 119,
      "text": "tell me about a time when you were going to be late with a deadline, I would choose C,"
    },
    {
      "id": 120,
      "text": "tell the interviewer about a time when you thought you were going to be late, but you turned things"
    },
    {
      "id": 121,
      "text": "around by working late and putting in the extra hours needed. That's what I would want to hear"
    },
    {
      "id": 122,
      "text": "from you, joining that Amazon interview question. Question five, what will you do if you get"
    },
    {
      "id": 123,
      "text": "offered a great job from another company with a better salary after 12 months of starting worker"
    },
    {
      "id": 124,
      "text": "Amazon these only one answer option? I would choose A, okay because I'm committed to Amazon"
    },
    {
      "id": 125,
      "text": "I've already agreed to salary so I would turn it down because I believe Amazon is the best company"
    },
    {
      "id": 126,
      "text": "anyway. Question six, if we asked you to complete a task you'd never done before, how would you"
    },
    {
      "id": 127,
      "text": "react? Again I'd choose A, tell the interviewer you would agree to do the task, find out"
    },
    {
      "id": 128,
      "text": "yourself how to do it and then complete it on time into a high standard. Question seven, tell me"
    },
    {
      "id": 129,
      "text": "about a time when you took a calculated risk, this is a difficult one but I would go for B."
    },
    {
      "id": 130,
      "text": "Tell the interviewer about a time when you took a risk at work after you'd carefully weighed up"
    },
    {
      "id": 131,
      "text": "the options and realised the benefits to the organisation of taking a risk that it far outweigh"
    },
    {
      "id": 132,
      "text": "the consequences. Amazon takes calculated risks, it would not be as successful as it is"
    },
    {
      "id": 133,
      "text": "if it had never taken a risk. Question eight, how would you deal with a rude customer? Amazon always"
    },
    {
      "id": 134,
      "text": "puts customers first so I would choose B. Tell the interviewer you wouldn't take their"
    },
    {
      "id": 135,
      "text": "comments or actions personally. You would listen to the customer, establish what the problem was"
    },
    {
      "id": 136,
      "text": "and then go all out to try and resolve any issues for them. Question nine, given an example of a"
    },
    {
      "id": 137,
      "text": "time when you asked a customer for feedback, again Amazon always puts the customer first so I would"
    },
    {
      "id": 138,
      "text": "say, tell the interviewer about a time when you did ask a customer for feedback and you used the"
    },
    {
      "id": 139,
      "text": "feedback to improve the efficiency and performance of the business. Number ten, how would you build"
    },
    {
      "id": 140,
      "text": "trust with your work colleagues at Amazon? 100% A, say you would build trust by taking steps to get"
    },
    {
      "id": 141,
      "text": "to know them, by offering to support them, by making sure the work you do is to a high standard"
    },
    {
      "id": 142,
      "text": "on time and 11, how would you deal with a work colleague who was resisting you? To help you, C, say you"
    },
    {
      "id": 143,
      "text": "would take steps to build a better relationship, find out why they were resisting you, because"
    },
    {
      "id": 144,
      "text": "to achieve your goals, you have to work with work colleague, you need their assistance so that's the"
    },
    {
      "id": 145,
      "text": "one I would choose. So tell me in the comments section below how many you got right out of 11. Did you"
    },
    {
      "id": 146,
      "text": "get 11 out of 11? And the next thing of course, if you want example answers to all Amazon"
    },
    {
      "id": 147,
      "text": "interview questions, click that link right now in the top right hand corner of the video and head"
    },
    {
      "id": 148,
      "text": "over to my website, passmaintevue.com. I hope you've enjoyed that tutorial and I wish you all"
    },
    {
      "id": 149,
      "text": "the best for passing your Amazon interview and have a brilliant day."
    }
  ]
}