{
  "file": "eLxA6hPaStw.wav",
  "text": " I hope I'm able to stand out in this interview. What if I said the wrong thing? Wow, they both look really professional. Am I dressed correctly? If a job you've applied to has a lot of other applicants, chances are you might find yourself starting the interview process in a group setting. But don't be alarmed. Group interviews are a great way for employers to get an initial read on you and your work ethic. And above all, they want to see how you communicate and how you work with a team. While they might seem daunting at first, they don't have to be if you go in with the right mindset. Today, we're going to highlight some best practices for a group interview. With them in mind, securing a one-on-one interview after the group interview should be no problem. Morning, everyone. I'm Ann. Good morning. Nice to meet you. Chloe. I'll Chloe. What's great here is that all three candidates are early to the interview. That's a must. But notice how the first two weren't speaking when Ann walked in. Avoid the urge to check your phone or sit silently while waiting for the interviewer to arrive. Like Ann did, start the conversation right away and get to know the other candidates. This will only help during the actual interview. Speaking of, the interviewer has now arrived. So let's get into it. Chloe, how would you describe yourself? Let's see. I've worked in customer service for the last six years, starting in the restaurant industry and then eventually making my way to retail. When asked during a group interview about yourself, don't just recite what can be found on your resume. Share a personal story. Something that the interviewer will remember. I am extremely passionate about working with people. I was named Employee of the Month two times in my current role because of my problem solving nature in those situations. And I'm excited to hopefully do that soon here as well. That was a great finish. Don't be afraid to brag a little during a group interview when asked about yourself. Be confident and bring up your accomplishments, especially if it pertains to the job you're applying for. This will help differentiate you from the other candidates. Let's continue. Michael, tell me about a time you work through a challenging situation. I thrive in challenges. There was this one time that the computer's going down in the middle of the holiday rush and my co-workers started to panic. So I told them, I'll handle it. I briefly close the store until I was able to get the computers back up and running. While Michael shows initiative in his response, there's a glaring problem with his answer. He only focuses on himself. Employers ask questions about past challenges because they want to see if you're a team player. You can show your leadership capabilities, but also recognize it takes more than just you to get a job done. Moving along. And how will your strength benefit our company? Great question. Above all, I think my team focus mentality makes me a great fit for this role. Team dynamic is so... Oh, wait, sorry. One final thing I wanted to add to what I said before is that I feel very comfortable leading a team. Stop right there. One of the biggest mistakes you can make during a group interview is cutting another candidate off or trying to speak over them. All group interviews can kick up our competitive nature. Trying to make yourself the loudest in the room will only raise red flags with the employer. Wait until a candidate is done speaking before asking the interviewer if you can chime in. Let's go back to Anne and this time without the interruption. Anne, how will your strength benefit our company? That's a great question. Above all, I think my team focus mentality makes me a great fit for this role. Team dynamic is so important to me and I know that when we're in sync as a unit, we'll have the best outcomes with our customers. I'm also very patient in stressful situations. I love a Chloe said earlier about working through issues with customers. Often my coworkers will come to me in those situations, especially when they get a little bit heated, because I'm able to diffuse them and come up with a solution. That was brilliant. There's so much to like in this answer. Anne made teamwork one of her core strengths, which will be a good sign to any employer. Not only that, but she specifically referenced another candidate's answer in her response and added to it. This shows that she is listening to the room and also moving the conversation forward. Well done. While a group interview might be out of your comfort zone, there's no need to fear heading into one. Be yourself, speak confidently, listen to what the other candidates are saying and don't speak over them. You'll be on your way to that next round of a solo interview in no time. For more interview help, make sure to like and subscribe. Oh, that's funny. Are you going to keep us in? Hello, Charlie. Money.",
  "segments": [
    {
      "id": 0,
      "text": "I hope I'm able to stand out in this interview."
    },
    {
      "id": 1,
      "text": "What if I said the wrong thing?"
    },
    {
      "id": 2,
      "text": "Wow, they both look really professional."
    },
    {
      "id": 3,
      "text": "Am I dressed correctly?"
    },
    {
      "id": 4,
      "text": "If a job you've applied to has a lot of other applicants, chances are you might find yourself"
    },
    {
      "id": 5,
      "text": "starting the interview process in a group setting."
    },
    {
      "id": 6,
      "text": "But don't be alarmed."
    },
    {
      "id": 7,
      "text": "Group interviews are a great way for employers to get an initial read on you and your work ethic."
    },
    {
      "id": 8,
      "text": "And above all, they want to see how you communicate and how you work with a team."
    },
    {
      "id": 9,
      "text": "While they might seem daunting at first, they don't have to be if you go in with the right mindset."
    },
    {
      "id": 10,
      "text": "Today, we're going to highlight some best practices for a group interview."
    },
    {
      "id": 11,
      "text": "With them in mind, securing a one-on-one interview after the group interview should be no problem."
    },
    {
      "id": 12,
      "text": "Morning, everyone. I'm Ann."
    },
    {
      "id": 13,
      "text": "Good morning."
    },
    {
      "id": 14,
      "text": "Nice to meet you."
    },
    {
      "id": 15,
      "text": "Chloe."
    },
    {
      "id": 16,
      "text": "I'll Chloe."
    },
    {
      "id": 17,
      "text": "What's great here is that all three candidates are early to the interview."
    },
    {
      "id": 18,
      "text": "That's a must."
    },
    {
      "id": 19,
      "text": "But notice how the first two weren't speaking when Ann walked in."
    },
    {
      "id": 20,
      "text": "Avoid the urge to check your phone or sit silently while waiting for the interviewer to arrive."
    },
    {
      "id": 21,
      "text": "Like Ann did, start the conversation right away and get to know the other candidates."
    },
    {
      "id": 22,
      "text": "This will only help during the actual interview."
    },
    {
      "id": 23,
      "text": "Speaking of, the interviewer has now arrived."
    },
    {
      "id": 24,
      "text": "So let's get into it."
    },
    {
      "id": 25,
      "text": "Chloe, how would you describe yourself?"
    },
    {
      "id": 26,
      "text": "Let's see."
    },
    {
      "id": 27,
      "text": "I've worked in customer service for the last six years, starting in the restaurant industry and then eventually making my way to retail."
    },
    {
      "id": 28,
      "text": "When asked during a group interview about yourself, don't just recite what can be found on your resume."
    },
    {
      "id": 29,
      "text": "Share a personal story."
    },
    {
      "id": 30,
      "text": "Something that the interviewer will remember."
    },
    {
      "id": 31,
      "text": "I am extremely passionate about working with people."
    },
    {
      "id": 32,
      "text": "I was named Employee of the Month two times in my current role because of my problem solving nature in those situations."
    },
    {
      "id": 33,
      "text": "And I'm excited to hopefully do that soon here as well."
    },
    {
      "id": 34,
      "text": "That was a great finish."
    },
    {
      "id": 35,
      "text": "Don't be afraid to brag a little during a group interview when asked about yourself."
    },
    {
      "id": 36,
      "text": "Be confident and bring up your accomplishments, especially if it pertains to the job you're applying for."
    },
    {
      "id": 37,
      "text": "This will help differentiate you from the other candidates."
    },
    {
      "id": 38,
      "text": "Let's continue."
    },
    {
      "id": 39,
      "text": "Michael, tell me about a time you work through a challenging situation."
    },
    {
      "id": 40,
      "text": "I thrive in challenges."
    },
    {
      "id": 41,
      "text": "There was this one time that the computer's going down in the middle of the holiday rush and my co-workers started to panic."
    },
    {
      "id": 42,
      "text": "So I told them, I'll handle it."
    },
    {
      "id": 43,
      "text": "I briefly close the store until I was able to get the computers back up and running."
    },
    {
      "id": 44,
      "text": "While Michael shows initiative in his response, there's a glaring problem with his answer."
    },
    {
      "id": 45,
      "text": "He only focuses on himself."
    },
    {
      "id": 46,
      "text": "Employers ask questions about past challenges because they want to see if you're a team player."
    },
    {
      "id": 47,
      "text": "You can show your leadership capabilities, but also recognize it takes more than just you to get a job done."
    },
    {
      "id": 48,
      "text": "Moving along."
    },
    {
      "id": 49,
      "text": "And how will your strength benefit our company?"
    },
    {
      "id": 50,
      "text": "Great question."
    },
    {
      "id": 51,
      "text": "Above all, I think my team focus mentality makes me a great fit for this role."
    },
    {
      "id": 52,
      "text": "Team dynamic is so..."
    },
    {
      "id": 53,
      "text": "Oh, wait, sorry."
    },
    {
      "id": 54,
      "text": "One final thing I wanted to add to what I said before is that I feel very comfortable leading a team."
    },
    {
      "id": 55,
      "text": "Stop right there."
    },
    {
      "id": 56,
      "text": "One of the biggest mistakes you can make during a group interview is cutting another candidate off or trying to speak over them."
    },
    {
      "id": 57,
      "text": "All group interviews can kick up our competitive nature."
    },
    {
      "id": 58,
      "text": "Trying to make yourself the loudest in the room will only raise red flags with the employer."
    },
    {
      "id": 59,
      "text": "Wait until a candidate is done speaking before asking the interviewer if you can chime in."
    },
    {
      "id": 60,
      "text": "Let's go back to Anne and this time without the interruption."
    },
    {
      "id": 61,
      "text": "Anne, how will your strength benefit our company?"
    },
    {
      "id": 62,
      "text": "That's a great question."
    },
    {
      "id": 63,
      "text": "Above all, I think my team focus mentality makes me a great fit for this role."
    },
    {
      "id": 64,
      "text": "Team dynamic is so important to me and I know that when we're in sync as a unit, we'll have the best outcomes with our customers."
    },
    {
      "id": 65,
      "text": "I'm also very patient in stressful situations."
    },
    {
      "id": 66,
      "text": "I love a Chloe said earlier about working through issues with customers."
    },
    {
      "id": 67,
      "text": "Often my coworkers will come to me in those situations, especially when they get a little bit heated,"
    },
    {
      "id": 68,
      "text": "because I'm able to diffuse them and come up with a solution."
    },
    {
      "id": 69,
      "text": "That was brilliant."
    },
    {
      "id": 70,
      "text": "There's so much to like in this answer."
    },
    {
      "id": 71,
      "text": "Anne made teamwork one of her core strengths, which will be a good sign to any employer."
    },
    {
      "id": 72,
      "text": "Not only that, but she specifically referenced another candidate's answer in her response and added to it."
    },
    {
      "id": 73,
      "text": "This shows that she is listening to the room and also moving the conversation forward."
    },
    {
      "id": 74,
      "text": "Well done."
    },
    {
      "id": 75,
      "text": "While a group interview might be out of your comfort zone, there's no need to fear heading into one."
    },
    {
      "id": 76,
      "text": "Be yourself, speak confidently, listen to what the other candidates are saying and don't speak over them."
    },
    {
      "id": 77,
      "text": "You'll be on your way to that next round of a solo interview in no time."
    },
    {
      "id": 78,
      "text": "For more interview help, make sure to like and subscribe."
    },
    {
      "id": 79,
      "text": "Oh, that's funny."
    },
    {
      "id": 80,
      "text": "Are you going to keep us in?"
    },
    {
      "id": 81,
      "text": "Hello, Charlie."
    },
    {
      "id": 82,
      "text": "Money."
    }
  ]
}