{
  "file": "EP-G1nKljS0.wav",
  "text": " Hello there, my name is Richard McMunn from the Interview Training website, PassMainToview.com, and in this training video I will teach you how to pass an Amazon phone interview. If you are applying for any job role with the brilliant organisation that is Amazon, and you have to undertake a phone interview, make sure you stay tuned because the tips, questions and sample answers I am about to give you will help you pass at the first attempt. And to achieve that goal, I will cover the following four things in this training tutorial. Number one, I will give you four very important tips for preparing for your Amazon phone interview. You must ensure you follow these four tips to prepare fully. Number two, I will tell you which questions feature the most often during Amazon phone screening interviews plus give you two very important tips for giving a top scoring answer. Number three, I will then give you a brilliant example response to each Amazon phone interview question, and then finally, number four, I will tell you where you can instantly download my 17 great example answers to Amazon phone interview questions and just very quickly, if you are new to my channel, please make sure you hit that subscribe button. Thousands of you are getting hired at the first attempt. I can only help you if you are subscribed, please hit the like button and please tell me the name of the job you are being interviewed for at Amazon in the comment section below the video and I will give you some extra tips to help you pass your interview. Okay, let's get started with the training. First of all, I want to give you four essential tips for preparing properly for an Amazon phone screening interview. Please make sure you take notes. Tip number one is to make sure you read and learn the 16 leadership principles. Now, Amazon has 16 brilliant leadership principles that are the foundations of its success. Now, you will have to answer questions based on your ability to demonstrate the leadership principles in your phone interview. For example, one of the 16 leadership principles is called take ownership. Now, the take ownership leadership principle emphasises that Amazon employees act like owners and they take responsibility for their work decisions. Decisions and overall business impact. Now, they don't wait for someone else to solve problems nor do they limit their responsibility to just their job description. So, if there is a problem while working at Amazon, they want all of their employees to act like owners and take responsibility for the difficult situation. So, for example, during your phone interview, you might have to answer the question, tell me about a time when you took the lead on a project. And that question assesses the taking ownership leadership principle. And later on in this tutorial, I will give you a brilliant example answer to that difficult interview question. So, make sure you study and learn the 16 Amazon leadership principles. Now, even though there is still much more time for us to work through in this video, I also have a separate tutorial, which you can access at any time by clicking that link that will teach you how to answer the 16 Amazon leadership principles into view questions. Let's now move on to Amazon phone interview tip number two. And that is phone interview preparation. I want you to do the following four things when preparing for your Amazon phone interview number one, make sure you undertake your phone interview in a quiet location without background noise. And I will explain very soon why these four things are essential. Number two, make sure the Wi-Fi signal is strong. If you are using a mobile or cell phone and make sure your battery is fully charged. Number three, and this is important. Make sure you have a copy of your CV or resume with you during the phone interview, so you can refer to it. And then number four, have paper and pen with you so you can take notes. Now, it's important that you do these four things because one of the leadership principles is insist on the highest standards. So if you are not fully prepared for your phone interview, for example, if the Wi-Fi signal cuts out or there is background noise, it tells the hiring manager, you don't have the highest standards. Now, the Amazon leadership principle of higher standards means that all employees must set high expectations for themselves and their teams, and also ensure that these standards are continuously met. So if you are ill prepared for your phone interview, you won't get hired, because you can't demonstrate the leadership principle of insist on the highest standards. Let's now move on. Two, Amazon phone interview tip number three. Now this is a very, very important one. Take notes. Now, I strongly recommend you use the star method when answering interview questions based on the leadership principles. Now, when you answer any behavioral question during the phone interview that assesses your ability to demonstrate those 16 leadership principles, make sure you use the star method. The star method stands for situation, task, action and result. So for example, let's assume that you are undertaking your phone interview with Amazon. You are sitting down at home in your chair on the phone talking to the hiring manager and they say to you, tell me about your time when you faced a difficult problem that had several possible solutions. Now, this is called a behavioral interview question. And this one is assessing the leadership principle of bias for action. Now, whenever the hiring manager asks you a behavioral question that focuses on any of the 16 leadership principles, I want you to automatically think of the star method. And you should construct your response by using situation, task, action and result. So you begin your answer and you outline the situation you were faced with. You then tell the hiring manager, the task that needed your attention, you will then give the hiring manager in depth details about the action you took to achieve the task and then you will finish off and tell them about the results following your actions. And very soon, I will give you an example answer to that question. I just put up on the screen that uses the star method. Please make sure you learn and use the star method when answering any of the Amazon behavioral interview questions. Let's now move on to tip number four before we start working through my sample Amazon phoning to view questions and brilliant example answers. So tip four is to make sure you prepare three questions to ask the Amazon hiring manager. I recommend you ask three smart questions that demonstrate your desire to have a positive impact on your team at Amazon. So to all the end of your Amazon phone interview, the hiring manager will likely say to you, do you have any questions for me? I recommend you ask three smart questions. Here's three brilliant ones that you can write down on your paper and having front of you at your Amazon phone interview question number one. What opportunities are there for professional growth in this role? That's a brilliant question because one of the leadership principles is higher and develop the best. Now you can only be the best you can possibly be if you are open to continuous improvement and professional growth. The second question to ask is, what are some of the biggest challenges that team faces in consistently exceeding customer expectations and how could I contribute to solving them? That's a brilliant question. Now the number one, the first Amazon leadership principle is customer obsession. Now you and I know having used Amazon services many, many times in the past that they have outstanding customer service. And they have outstanding customer service because they are obsessive with their customers and that question shows you understand how important customer obsession is. And the final question to ask is, can you describe the team's culture and working style? So that shows that you are a close collaborator and you understand how important team culture is. So those are three great questions to ask at the end of your Amazon phone interview. Don't forget to write them down and ask those questions and any other ones you want to ask at the end of your phone interview. Okay, let's now start working through the Amazon phone interview questions. My tips and example answers. Don't forget very soon. I will tell you where you can download my 17 brilliant Amazon phone interview questions and answers. Question number one. Tell me about yourself. Now obviously this will come at the start of your phone interview. Let me give you two tips for giving a great response tip number one. So this will likely be the first question you must answer at your Amazon phone interview. Make sure you practice your answer several times before your interview because that will help demonstrate good communication skills. Don't forget if you are on your phone they can't see you. So I recommend you have your answers prepared printed out in front of you. And you can refer to them as a when you need to during the Amazon phone interview. Don't forget soon. I will tell you where you can download my example responses and tip number two. I will answer to this first Amazon interview question. Tell me about yourself. You can talk about the skills you have that match the Amazon job description. The experience you can bring to Amazon. Details of any achievements you have gained in your life so far and also don't forget to reference those 16 leadership principles. So here is a brilliant example answer to help you. Tell me about yourself. Here we go. Thank you for the opportunity to undertake a phone interview to work at Amazon. I am a diligent collaborative loyal and self motivated employee with experience to match the job description and Amazon's 16 leadership principles. I have held several job roles that have prepared me well for the role of insert the job role you are applying for at Amazon. My experiences diverse and includes working on small and large teams helping streamline company processes and reducing costs and delivering on time sensitive projects. I am a high achiever. In my last position I won employee of the month and was praised by my manager for how I constantly asked customers for feedback based on their experience with the company to help drive improvements and sales. I have completed training courses in health and safety, Microsoft office applications, manual handling and customer service. My experience, obsession with customer service, knowledge, passion for this industry and unwavering commitment to continuous improvement mean. I will be a great asset to the Amazon team and I look forward to sharing additional details in the phone interview regarding my suitability for this position and how I commit the requirements of the 16 leadership principles. I love that response. It's a great in depth answer to that first question. Tell me about yourself. Here is the next question that comes up all the time during Amazon phone interviews. Why Amazon? Why do you want to work for Amazon? Here's two great tips. Tip number one. So this next common Amazon phone interview question assesses your motivations for wanting to work at this brilliant organization. In my opinion, Amazon is the greatest organization in the world. I don't say that lightly. I think they are fantastic. Now lots of people want to work for Amazon but this question is assessing your motivations for choosing this brilliant organization. Make sure you demonstrate passion for wanting to work at Amazon and also give more than one reason for wanting to work there and tip number two. Good things to include in your answer are the fact that their Amazon tries to be the earth's best employer. The positive workplace culture at Amazon, the work life balance and also how those 16 leadership principles align with your values and your strong work ethic. So here is another brilliant example answer to help you share your Amazon phone interview. Why Amazon? Here we go. I want to work at Amazon for four reasons. The first is that Amazon strives to be the earth's best employer. That means I will get to collaborate on exciting projects at the cutting edge of technology and innovation. The second reason is that Amazon is a safe workplace and my ideas and suggestions will be valued and trialed. My research tells me that Amazon offers a workplace culture where there is the opportunity for everyone to contribute to the company's success. The third reason I want to work at Amazon is that having used your products and services for several years, I have been impressed with how you treat your customers. Outstanding customer service is rare in business today and your obsession with customers has convinced me that you push the boundaries of innovation. I will get to work alongside some of the brightest and most talented people out there. And finally, I want to work at Amazon because I genuinely believe in your 16 leadership principles. Having studied these, I am confident my professional values and strong work ethic will empower me to have a successful career at Amazon. That is another brilliant answer that will help you pass your Amazon phone interview. Now don't go anywhere because I still have more questions tips and answers to give you. But when you are ready, click the link in the top right-hand corner of the video. Head straight through to my website, plus main to view.com and you can download my full set of 17 Amazon phone interview questions and top scoring answers including the ones we are working through together today. Here is an next question. What do you know about Amazon? Tip number one. Now I strongly recommend you research Amazon before your phone interview. If the hiring manager asks you this question and you then struggle to give an answer, you will not get hired. Tip number two, I strongly recommend you read Amazon's latest new stories and find out what their plans are. You are all of this by going to the website about Amazon.com. That should be your number one website to visit to research Amazon before your phone interview. But here is my brilliant example answer for you to use. What do you know about Amazon? Amazon is one of the world's largest and most influential companies known for its customer centric approach, innovation and operational excellence. It was founded by Jeff Bezos in 1994 as an online bookstore and has since evolved into a global technology and the commerce giant offering a vast range of products and services including cloud computing artificial intelligence digital streaming and smart devices. Another Amazon's key strengths is its relentless focus on customer obsession which is the first of its 16 leadership principles. This commitment drives Amazon's innovation such as Prime which offers fast shipping and exclusive entertainment and Amazon web services, the leading cloud computing platform used by businesses worldwide. Amazon also prioritizes efficiency and continuous improvement evident in its advanced logistics network automation and AI driven innovation such as Alexa and Amazon go stores. Additionally the company is committed to sustainability with its climate pledge aiming to reach net zero carbon emissions by 2040. Amazon's workplace culture is built around high standards, ownership and a bias for action encouraging employees to take initiative and think big. These principles have helped Amazon maintain its leadership position across industries from e-commerce to cloud computing. For all, Amazon is not just a retailer, it's a technology driven company that constantly evolves to meet customer needs while promoting a culture of innovation and leadership. I am particularly excited about the opportunity to contribute to Amazon's ongoing success. So that is a brilliant comprehensive answer that shows you know a lot about Amazon don't forget you can print that answer off by clicking the link in the top right hand corner of the video and having it in front of you during your Amazon phone interview. So this is a common Amazon phone interview question that assesses the leadership principles of our right a lot bias for action and ownership. Tip number two don't forget to use the star method to structure your answer situation task action and results. So here is my star method example answer to help you pass your Amazon phone interview. Tell me about the time when you faced a difficult problem that had several possible solutions here we go. In my previous role one of our suppliers kept letting the company down their inconsistency resulted in delays to customer orders which was unacceptable. The delays also started to impact the company's online reviews so I decided to take action. It was my task to analyze the possible solutions to this problem and decide on a course of action that benefited our valued customers and the company's reputation. During my investigation I spoke directly to the company supplier they informed me that the delays were due to a supply chain issue and that this would be resolved soon. At the end of my investigation I had several options. Give the supplier the opportunity to put things right or choose a new supplier. After weighing the pros and cons and consulting other team members I decided to find a new supplier. The current suppliers unreliability had gone on too long and our valued customers had suffered enough which was unacceptable. After spending several days researching new suppliers I found one with an excellent track record of delivery times. I insisted that they sign a contract that included penalties for late deliveries and normal service for our customers quickly resumed. My manager praised my leadership skills and customer obsession. That is a brilliant example response to that common Amazon phone interview question and you can see how effective the star method is. And that response demonstrates lots of the leadership principles you are taking responsibility for a difficult situation. You are consulting your team members and then you are taking action that improves the customer service standards and improves the reputation of your employer. Here is the next question. This one comes up all the time during Amazon phone interviews. Tell me about the time when you made a mistake. Tip number one. Now this next common Amazon phone interview question is assessing three things. Self awareness and the desire to improve. Do not say you have never made a mistake. Tip number two again. Make sure you use the star method to structure your answer. Situation task action and result. Here is a brilliant example response. Tell me about a time when you made a mistake. In my previous role, while handling multiple tasks, I sent an important email to a client without thoroughly reviewing it. After sending it, I realized it contained several spelling and grammar errors. Since this email reflected both my professionalism and the company standards I knew I had made a mistake. It was my responsibility to ensure all client communications work clear, professional and error-free. I needed to address the situation immediately to maintain the client's confidence in our company. As soon as I realized the mistake, I took ownership of it. I promptly sent a follow-up email to the client, apologising for the errors and attaching a corrected version of the message. Additionally, I called the client to acknowledge the mistake personally, reassure them of my commitment to high communications standards, and ensure they had the correct information. To prevent this from happening again, I installed the Grammally Chrome extension for Gmail, which helped me catch spelling and grammatical errors before sending any future emails. The client appreciated my prompt response and professionalism in handling the situation and our business relationship remains strong. Implementing Grammally significantly improved the accuracy and professionalism of my emails, ensuring that such mistakes did not happen again. So that is another really good example answer, and it shows that you take ownership for your mistakes, you are honest about them, but more importantly, you take steps to learn and improve so they don't happen again. Okay, now the next thing to do, to accelerate your learning even further, is click the link right now in the top right-hand corner of the video, head straight through to my website, passmaintivue.com, and you can instantly download these slides of all the tips and sample answers plus my full set of 17 great answers to difficult Amazon phone interview questions. This guide comes as a PDF guide, which means you can have it in your inbox literally within two minutes from now by clicking that link. Also, please make sure you hit the subscribe button. Please give the video a like because that motivates me and make sure you connect with me on LinkedIn. I have put my LinkedIn link in the description below the video. It is always an honor and a pleasure to connect with like-minded professional such as yourself. Thank you very much for watching and I wish you the very best for passing your Amazon phone interview. Have a wonderful day.",
  "segments": [
    {
      "id": 0,
      "text": "Hello there, my name is Richard McMunn from the Interview Training website, PassMainToview.com,"
    },
    {
      "id": 1,
      "text": "and in this training video I will teach you how to pass an Amazon phone interview."
    },
    {
      "id": 2,
      "text": "If you are applying for any job role with the brilliant organisation that is Amazon,"
    },
    {
      "id": 3,
      "text": "and you have to undertake a phone interview, make sure you stay tuned because the tips,"
    },
    {
      "id": 4,
      "text": "questions and sample answers I am about to give you will help you pass at the first attempt."
    },
    {
      "id": 5,
      "text": "And to achieve that goal, I will cover the following four things in this training tutorial."
    },
    {
      "id": 6,
      "text": "Number one, I will give you four very important tips for preparing for your Amazon phone interview."
    },
    {
      "id": 7,
      "text": "You must ensure you follow these four tips to prepare fully. Number two, I will tell you which questions feature the most often"
    },
    {
      "id": 8,
      "text": "during Amazon phone screening interviews plus give you two very important tips for giving a top scoring answer."
    },
    {
      "id": 9,
      "text": "Number three, I will then give you a brilliant example response to each Amazon phone interview question,"
    },
    {
      "id": 10,
      "text": "and then finally, number four, I will tell you where you can instantly download my 17 great"
    },
    {
      "id": 11,
      "text": "example answers to Amazon phone interview questions and just very quickly,"
    },
    {
      "id": 12,
      "text": "if you are new to my channel, please make sure you hit that subscribe button."
    },
    {
      "id": 13,
      "text": "Thousands of you are getting hired at the first attempt."
    },
    {
      "id": 14,
      "text": "I can only help you if you are subscribed, please hit the like button and please tell me the name"
    },
    {
      "id": 15,
      "text": "of the job you are being interviewed for at Amazon in the comment section below the video and I will give you some extra tips to help you pass your interview."
    },
    {
      "id": 16,
      "text": "Okay, let's get started with the training."
    },
    {
      "id": 17,
      "text": "First of all, I want to give you four essential tips for preparing properly for an Amazon phone screening interview."
    },
    {
      "id": 18,
      "text": "Please make sure you take notes. Tip number one is to make sure you read and learn the 16 leadership principles."
    },
    {
      "id": 19,
      "text": "Now, Amazon has 16 brilliant leadership principles that are the foundations of its success."
    },
    {
      "id": 20,
      "text": "Now, you will have to answer questions based on your ability to demonstrate the leadership principles in your phone interview."
    },
    {
      "id": 21,
      "text": "For example, one of the 16 leadership principles is called take ownership."
    },
    {
      "id": 22,
      "text": "Now, the take ownership leadership principle emphasises that Amazon employees act like owners and they take responsibility for their work decisions."
    },
    {
      "id": 23,
      "text": "Decisions and overall business impact."
    },
    {
      "id": 24,
      "text": "Now, they don't wait for someone else to solve problems nor do they limit their responsibility to just their job description."
    },
    {
      "id": 25,
      "text": "So, if there is a problem while working at Amazon, they want all of their employees to act like owners and take responsibility for the difficult situation."
    },
    {
      "id": 26,
      "text": "So, for example, during your phone interview, you might have to answer the question, tell me about a time when you took the lead on a project."
    },
    {
      "id": 27,
      "text": "And that question assesses the taking ownership leadership principle."
    },
    {
      "id": 28,
      "text": "And later on in this tutorial, I will give you a brilliant example answer to that difficult interview question."
    },
    {
      "id": 29,
      "text": "So, make sure you study and learn the 16 Amazon leadership principles."
    },
    {
      "id": 30,
      "text": "Now, even though there is still much more time for us to work through in this video, I also have a separate tutorial, which you can access at any time by clicking that link that will teach you how to answer the 16 Amazon leadership principles into view questions."
    },
    {
      "id": 31,
      "text": "Let's now move on to Amazon phone interview tip number two."
    },
    {
      "id": 32,
      "text": "And that is phone interview preparation."
    },
    {
      "id": 33,
      "text": "I want you to do the following four things when preparing for your Amazon phone interview number one,"
    },
    {
      "id": 34,
      "text": "make sure you undertake your phone interview in a quiet location without background noise."
    },
    {
      "id": 35,
      "text": "And I will explain very soon why these four things are essential."
    },
    {
      "id": 36,
      "text": "Number two, make sure the Wi-Fi signal is strong."
    },
    {
      "id": 37,
      "text": "If you are using a mobile or cell phone and make sure your battery is fully charged."
    },
    {
      "id": 38,
      "text": "Number three, and this is important."
    },
    {
      "id": 39,
      "text": "Make sure you have a copy of your CV or resume with you during the phone interview, so you can refer to it."
    },
    {
      "id": 40,
      "text": "And then number four, have paper and pen with you so you can take notes."
    },
    {
      "id": 41,
      "text": "Now, it's important that you do these four things because one of the leadership principles is insist on the highest standards."
    },
    {
      "id": 42,
      "text": "So if you are not fully prepared for your phone interview, for example, if the Wi-Fi signal cuts out or there is background noise, it tells the hiring manager, you don't have the highest standards."
    },
    {
      "id": 43,
      "text": "Now, the Amazon leadership principle of higher standards means that all employees must set high expectations for themselves and their teams,"
    },
    {
      "id": 44,
      "text": "and also ensure that these standards are continuously met."
    },
    {
      "id": 45,
      "text": "So if you are ill prepared for your phone interview, you won't get hired, because you can't demonstrate the leadership principle of insist on the highest standards."
    },
    {
      "id": 46,
      "text": "Let's now move on. Two, Amazon phone interview tip number three. Now this is a very, very important one."
    },
    {
      "id": 47,
      "text": "Take notes. Now, I strongly recommend you use the star method when answering interview questions based on the leadership principles."
    },
    {
      "id": 48,
      "text": "Now, when you answer any behavioral question during the phone interview that assesses your ability to demonstrate those 16 leadership principles,"
    },
    {
      "id": 49,
      "text": "make sure you use the star method. The star method stands for situation, task, action and result."
    },
    {
      "id": 50,
      "text": "So for example, let's assume that you are undertaking your phone interview with Amazon. You are sitting down at home in your chair on the phone talking to the hiring manager and they say to you,"
    },
    {
      "id": 51,
      "text": "tell me about your time when you faced a difficult problem that had several possible solutions. Now, this is called a behavioral interview question."
    },
    {
      "id": 52,
      "text": "And this one is assessing the leadership principle of bias for action."
    },
    {
      "id": 53,
      "text": "Now, whenever the hiring manager asks you a behavioral question that focuses on any of the 16 leadership principles,"
    },
    {
      "id": 54,
      "text": "I want you to automatically think of the star method. And you should construct your response by using situation, task, action and result."
    },
    {
      "id": 55,
      "text": "So you begin your answer and you outline the situation you were faced with. You then tell the hiring manager, the task that needed your attention,"
    },
    {
      "id": 56,
      "text": "you will then give the hiring manager in depth details about the action you took to achieve the task and then you will finish off and tell them about the results following your actions."
    },
    {
      "id": 57,
      "text": "And very soon, I will give you an example answer to that question. I just put up on the screen that uses the star method. Please make sure you learn and use the star method when answering any of the Amazon behavioral interview questions."
    },
    {
      "id": 58,
      "text": "Let's now move on to tip number four before we start working through my sample Amazon phoning to view questions and brilliant example answers. So tip four is to make sure you prepare three questions to ask the Amazon hiring manager."
    },
    {
      "id": 59,
      "text": "I recommend you ask three smart questions that demonstrate your desire to have a positive impact on your team at Amazon."
    },
    {
      "id": 60,
      "text": "So to all the end of your Amazon phone interview, the hiring manager will likely say to you, do you have any questions for me?"
    },
    {
      "id": 61,
      "text": "I recommend you ask three smart questions. Here's three brilliant ones that you can write down on your paper and having front of you at your Amazon phone interview question number one."
    },
    {
      "id": 62,
      "text": "What opportunities are there for professional growth in this role? That's a brilliant question because one of the leadership principles is higher and develop the best."
    },
    {
      "id": 63,
      "text": "Now you can only be the best you can possibly be if you are open to continuous improvement and professional growth."
    },
    {
      "id": 64,
      "text": "The second question to ask is, what are some of the biggest challenges that team faces in consistently exceeding customer expectations and how could I contribute to solving them?"
    },
    {
      "id": 65,
      "text": "That's a brilliant question. Now the number one, the first Amazon leadership principle is customer obsession."
    },
    {
      "id": 66,
      "text": "Now you and I know having used Amazon services many, many times in the past that they have outstanding customer service."
    },
    {
      "id": 67,
      "text": "And they have outstanding customer service because they are obsessive with their customers and that question shows you understand how important customer obsession is."
    },
    {
      "id": 68,
      "text": "And the final question to ask is, can you describe the team's culture and working style?"
    },
    {
      "id": 69,
      "text": "So that shows that you are a close collaborator and you understand how important team culture is."
    },
    {
      "id": 70,
      "text": "So those are three great questions to ask at the end of your Amazon phone interview."
    },
    {
      "id": 71,
      "text": "Don't forget to write them down and ask those questions and any other ones you want to ask at the end of your phone interview."
    },
    {
      "id": 72,
      "text": "Okay, let's now start working through the Amazon phone interview questions. My tips and example answers. Don't forget very soon. I will tell you where you can download my 17 brilliant Amazon phone interview questions and answers. Question number one."
    },
    {
      "id": 73,
      "text": "Tell me about yourself. Now obviously this will come at the start of your phone interview. Let me give you two tips for giving a great response tip number one."
    },
    {
      "id": 74,
      "text": "So this will likely be the first question you must answer at your Amazon phone interview. Make sure you practice your answer several times before your interview because that will help demonstrate good communication skills."
    },
    {
      "id": 75,
      "text": "Don't forget if you are on your phone they can't see you. So I recommend you have your answers prepared printed out in front of you."
    },
    {
      "id": 76,
      "text": "And you can refer to them as a when you need to during the Amazon phone interview. Don't forget soon. I will tell you where you can download my example responses and tip number two."
    },
    {
      "id": 77,
      "text": "I will answer to this first Amazon interview question. Tell me about yourself. You can talk about the skills you have that match the Amazon job description. The experience you can bring to Amazon."
    },
    {
      "id": 78,
      "text": "Details of any achievements you have gained in your life so far and also don't forget to reference those 16 leadership principles. So here is a brilliant example answer to help you."
    },
    {
      "id": 79,
      "text": "Tell me about yourself. Here we go. Thank you for the opportunity to undertake a phone interview to work at Amazon."
    },
    {
      "id": 80,
      "text": "I am a diligent collaborative loyal and self motivated employee with experience to match the job description and Amazon's 16 leadership principles."
    },
    {
      "id": 81,
      "text": "I have held several job roles that have prepared me well for the role of insert the job role you are applying for at Amazon."
    },
    {
      "id": 82,
      "text": "My experiences diverse and includes working on small and large teams helping streamline company processes and reducing costs and delivering on time sensitive projects."
    },
    {
      "id": 83,
      "text": "I am a high achiever. In my last position I won employee of the month and was praised by my manager for how I constantly asked customers for feedback based on their experience with the company to help drive improvements and sales."
    },
    {
      "id": 84,
      "text": "I have completed training courses in health and safety, Microsoft office applications, manual handling and customer service."
    },
    {
      "id": 85,
      "text": "My experience, obsession with customer service, knowledge, passion for this industry and unwavering commitment to continuous improvement mean."
    },
    {
      "id": 86,
      "text": "I will be a great asset to the Amazon team and I look forward to sharing additional details in the phone interview regarding my suitability for this position and how I commit the requirements of the 16 leadership principles."
    },
    {
      "id": 87,
      "text": "I love that response. It's a great in depth answer to that first question. Tell me about yourself."
    },
    {
      "id": 88,
      "text": "Here is the next question that comes up all the time during Amazon phone interviews. Why Amazon? Why do you want to work for Amazon?"
    },
    {
      "id": 89,
      "text": "Here's two great tips. Tip number one. So this next common Amazon phone interview question assesses your motivations for wanting to work at this brilliant organization."
    },
    {
      "id": 90,
      "text": "In my opinion, Amazon is the greatest organization in the world. I don't say that lightly. I think they are fantastic."
    },
    {
      "id": 91,
      "text": "Now lots of people want to work for Amazon but this question is assessing your motivations for choosing this brilliant organization."
    },
    {
      "id": 92,
      "text": "Make sure you demonstrate passion for wanting to work at Amazon and also give more than one reason for wanting to work there and tip number two."
    },
    {
      "id": 93,
      "text": "Good things to include in your answer are the fact that their Amazon tries to be the earth's best employer."
    },
    {
      "id": 94,
      "text": "The positive workplace culture at Amazon, the work life balance and also how those 16 leadership principles align with your values and your strong work ethic."
    },
    {
      "id": 95,
      "text": "So here is another brilliant example answer to help you share your Amazon phone interview. Why Amazon? Here we go."
    },
    {
      "id": 96,
      "text": "I want to work at Amazon for four reasons. The first is that Amazon strives to be the earth's best employer."
    },
    {
      "id": 97,
      "text": "That means I will get to collaborate on exciting projects at the cutting edge of technology and innovation."
    },
    {
      "id": 98,
      "text": "The second reason is that Amazon is a safe workplace and my ideas and suggestions will be valued and trialed."
    },
    {
      "id": 99,
      "text": "My research tells me that Amazon offers a workplace culture where there is the opportunity for everyone to contribute to the company's success."
    },
    {
      "id": 100,
      "text": "The third reason I want to work at Amazon is that having used your products and services for several years, I have been impressed with how you treat your customers."
    },
    {
      "id": 101,
      "text": "Outstanding customer service is rare in business today and your obsession with customers has convinced me that you push the boundaries of innovation."
    },
    {
      "id": 102,
      "text": "I will get to work alongside some of the brightest and most talented people out there."
    },
    {
      "id": 103,
      "text": "And finally, I want to work at Amazon because I genuinely believe in your 16 leadership principles."
    },
    {
      "id": 104,
      "text": "Having studied these, I am confident my professional values and strong work ethic will empower me to have a successful career at Amazon."
    },
    {
      "id": 105,
      "text": "That is another brilliant answer that will help you pass your Amazon phone interview. Now don't go anywhere because I still have more questions tips and answers to give you."
    },
    {
      "id": 106,
      "text": "But when you are ready, click the link in the top right-hand corner of the video."
    },
    {
      "id": 107,
      "text": "Head straight through to my website, plus main to view.com and you can download my full set of 17 Amazon phone interview questions and top scoring answers including the ones we are working through together today."
    },
    {
      "id": 108,
      "text": "Here is an next question. What do you know about Amazon? Tip number one. Now I strongly recommend you research Amazon before your phone interview."
    },
    {
      "id": 109,
      "text": "If the hiring manager asks you this question and you then struggle to give an answer, you will not get hired. Tip number two, I strongly recommend you read Amazon's latest new stories and find out what their plans are."
    },
    {
      "id": 110,
      "text": "You are all of this by going to the website about Amazon.com. That should be your number one website to visit to research Amazon before your phone interview."
    },
    {
      "id": 111,
      "text": "But here is my brilliant example answer for you to use. What do you know about Amazon?"
    },
    {
      "id": 112,
      "text": "Amazon is one of the world's largest and most influential companies known for its customer centric approach, innovation and operational excellence."
    },
    {
      "id": 113,
      "text": "It was founded by Jeff Bezos in 1994 as an online bookstore and has since evolved into a global technology and the commerce giant offering a vast range of products and services including cloud computing artificial intelligence digital streaming and smart devices."
    },
    {
      "id": 114,
      "text": "Another Amazon's key strengths is its relentless focus on customer obsession which is the first of its 16 leadership principles."
    },
    {
      "id": 115,
      "text": "This commitment drives Amazon's innovation such as Prime which offers fast shipping and exclusive entertainment and Amazon web services, the leading cloud computing platform used by businesses worldwide."
    },
    {
      "id": 116,
      "text": "Amazon also prioritizes efficiency and continuous improvement evident in its advanced logistics network automation and AI driven innovation such as Alexa and Amazon go stores."
    },
    {
      "id": 117,
      "text": "Additionally the company is committed to sustainability with its climate pledge aiming to reach net zero carbon emissions by 2040."
    },
    {
      "id": 118,
      "text": "Amazon's workplace culture is built around high standards, ownership and a bias for action encouraging employees to take initiative and think big."
    },
    {
      "id": 119,
      "text": "These principles have helped Amazon maintain its leadership position across industries from e-commerce to cloud computing."
    },
    {
      "id": 120,
      "text": "For all, Amazon is not just a retailer, it's a technology driven company that constantly evolves to meet customer needs while promoting a culture of innovation and leadership."
    },
    {
      "id": 121,
      "text": "I am particularly excited about the opportunity to contribute to Amazon's ongoing success."
    },
    {
      "id": 122,
      "text": "So that is a brilliant comprehensive answer that shows you know a lot about Amazon don't forget you can print that answer off by clicking the link in the top right hand corner of the video and having it in front of you during your Amazon phone interview."
    },
    {
      "id": 123,
      "text": "So this is a common Amazon phone interview question that assesses the leadership principles of our right a lot bias for action and ownership."
    },
    {
      "id": 124,
      "text": "Tip number two don't forget to use the star method to structure your answer situation task action and results. So here is my star method example answer to help you pass your Amazon phone interview."
    },
    {
      "id": 125,
      "text": "Tell me about the time when you faced a difficult problem that had several possible solutions here we go."
    },
    {
      "id": 126,
      "text": "In my previous role one of our suppliers kept letting the company down their inconsistency resulted in delays to customer orders which was unacceptable."
    },
    {
      "id": 127,
      "text": "The delays also started to impact the company's online reviews so I decided to take action."
    },
    {
      "id": 128,
      "text": "It was my task to analyze the possible solutions to this problem and decide on a course of action that benefited our valued customers and the company's reputation."
    },
    {
      "id": 129,
      "text": "During my investigation I spoke directly to the company supplier they informed me that the delays were due to a supply chain issue and that this would be resolved soon."
    },
    {
      "id": 130,
      "text": "At the end of my investigation I had several options."
    },
    {
      "id": 131,
      "text": "Give the supplier the opportunity to put things right or choose a new supplier."
    },
    {
      "id": 132,
      "text": "After weighing the pros and cons and consulting other team members I decided to find a new supplier."
    },
    {
      "id": 133,
      "text": "The current suppliers unreliability had gone on too long and our valued customers had suffered enough which was unacceptable."
    },
    {
      "id": 134,
      "text": "After spending several days researching new suppliers I found one with an excellent track record of delivery times."
    },
    {
      "id": 135,
      "text": "I insisted that they sign a contract that included penalties for late deliveries and normal service for our customers quickly resumed."
    },
    {
      "id": 136,
      "text": "My manager praised my leadership skills and customer obsession."
    },
    {
      "id": 137,
      "text": "That is a brilliant example response to that common Amazon phone interview question and you can see how effective the star method is."
    },
    {
      "id": 138,
      "text": "And that response demonstrates lots of the leadership principles you are taking responsibility for a difficult situation."
    },
    {
      "id": 139,
      "text": "You are consulting your team members and then you are taking action that improves the customer service standards and improves the reputation of your employer."
    },
    {
      "id": 140,
      "text": "Here is the next question. This one comes up all the time during Amazon phone interviews."
    },
    {
      "id": 141,
      "text": "Tell me about the time when you made a mistake. Tip number one."
    },
    {
      "id": 142,
      "text": "Now this next common Amazon phone interview question is assessing three things."
    },
    {
      "id": 143,
      "text": "Self awareness and the desire to improve. Do not say you have never made a mistake. Tip number two again."
    },
    {
      "id": 144,
      "text": "Make sure you use the star method to structure your answer."
    },
    {
      "id": 145,
      "text": "Situation task action and result. Here is a brilliant example response. Tell me about a time when you made a mistake."
    },
    {
      "id": 146,
      "text": "In my previous role, while handling multiple tasks, I sent an important email to a client"
    },
    {
      "id": 147,
      "text": "without thoroughly reviewing it. After sending it, I realized it contained several spelling"
    },
    {
      "id": 148,
      "text": "and grammar errors. Since this email reflected both my professionalism and the company standards"
    },
    {
      "id": 149,
      "text": "I knew I had made a mistake. It was my responsibility to ensure all client communications"
    },
    {
      "id": 150,
      "text": "work clear, professional and error-free. I needed to address the situation immediately"
    },
    {
      "id": 151,
      "text": "to maintain the client's confidence in our company. As soon as I realized the mistake,"
    },
    {
      "id": 152,
      "text": "I took ownership of it. I promptly sent a follow-up email to the client, apologising for"
    },
    {
      "id": 153,
      "text": "the errors and attaching a corrected version of the message. Additionally, I called the client"
    },
    {
      "id": 154,
      "text": "to acknowledge the mistake personally, reassure them of my commitment to high communications"
    },
    {
      "id": 155,
      "text": "standards, and ensure they had the correct information. To prevent this from happening"
    },
    {
      "id": 156,
      "text": "again, I installed the Grammally Chrome extension for Gmail, which helped me catch spelling"
    },
    {
      "id": 157,
      "text": "and grammatical errors before sending any future emails. The client appreciated my prompt"
    },
    {
      "id": 158,
      "text": "response and professionalism in handling the situation and our business relationship remains"
    },
    {
      "id": 159,
      "text": "strong. Implementing Grammally significantly improved the accuracy and professionalism"
    },
    {
      "id": 160,
      "text": "of my emails, ensuring that such mistakes did not happen again. So that is another really"
    },
    {
      "id": 161,
      "text": "good example answer, and it shows that you take ownership for your mistakes, you are honest"
    },
    {
      "id": 162,
      "text": "about them, but more importantly, you take steps to learn and improve so they don't happen"
    },
    {
      "id": 163,
      "text": "again. Okay, now the next thing to do, to accelerate your learning even further, is click the link"
    },
    {
      "id": 164,
      "text": "right now in the top right-hand corner of the video, head straight through to my website, passmaintivue.com,"
    },
    {
      "id": 165,
      "text": "and you can instantly download these slides of all the tips and sample answers plus my full set of"
    },
    {
      "id": 166,
      "text": "17 great answers to difficult Amazon phone interview questions. This guide comes as a PDF guide,"
    },
    {
      "id": 167,
      "text": "which means you can have it in your inbox literally within two minutes from now by clicking that link."
    },
    {
      "id": 168,
      "text": "Also, please make sure you hit the subscribe button. Please give the video a like because that"
    },
    {
      "id": 169,
      "text": "motivates me and make sure you connect with me on LinkedIn. I have put my LinkedIn link in the"
    },
    {
      "id": 170,
      "text": "description below the video. It is always an honor and a pleasure to connect with like-minded"
    },
    {
      "id": 171,
      "text": "professional such as yourself. Thank you very much for watching and I wish you the very best"
    },
    {
      "id": 172,
      "text": "for passing your Amazon phone interview. Have a wonderful day."
    }
  ]
}