{
  "file": "hUDOSqaAb0A.wav",
  "text": " Hello there my name is Richard McMunn from the interview training website, pass my interview.com and in this presentation I will teach you how to pass an Amazon interview and in particular I am going to give you a number of Amazon behavioral interview questions to prepare for now if you have a job interview coming up with Amazon make sure you stay tuned because I will help you to succeed and to achieve that goal this is what I will cover. So I will give you a list of Amazon behavioral interview questions that I strongly recommend you prepare for. I will then give you unique example answers to common Amazon behavioral interview questions. I will also give you some really important tips on how you can stand out during your Amazon job interview. And finally I will tell you how you can access further resources including these slides and the answers to help you succeed. And please don't forget to connect with me on LinkedIn. I have put my LinkedIn link in the description below the video and it's always great to connect with like my new professionals such as yourself. Don't forget to subscribe to the channel lots of you are passing your interviews as a result of the content I don't want you to miss out. And please just give the video a like because that tells me you find the content useful. And to make your life easier I have also placed the timestamps to each question in the description below the video. So if you want to jump to a particular question you can do that with ease by checking out the links in the description below the video. Let's get started. So the first Amazon behavioral interview question I recommend you prepare for is tell me about a time when you asked a customer for feedback. Now Amazon has been successful over the years because it fully understands the importance of the customer. It's what sets them apart from other online organizations. Now in your answer to this first behavioral interview question give a specific example of a situation when you sort feedback from a customer and then use it to the company's advantage. So here's my example answer to help you. Tell me about a time when you asked a customer for feedback here we go. I was dealing with a customer in a previous role on the telephone and they didn't sound particularly happy with our service. Now although they weren't making a direct complaint I could detect in their voice that they weren't entirely satisfied. I asked them how their experience had been whilst ordering from us and I found their response in lightning. They said our website was not easy to navigate and they were disappointed there was no option for a faster delivery time other than the standard postal service. I asked them a few questions about the issues they were experiencing online and I took notes as they spoke. Now after they had finished placing their order over the telephone I thanked them for their feedback. I then spoke to my manager to explain what the customer had said and I gave my opinion about how offering a faster delivery service. Could increase revenue and customer satisfaction levels to which he agreed. Now two weeks later the navigation issues had been resolved and we had added a new next day service to the website which helped to increase sales and customer satisfaction levels moving forward. So that's a brilliant example of how you have detected that a customer is not happy. You have asked for feedback and you have then implemented their recommendations to the advantage of the company so it's a really good response. Here is the next Amazon behavioral interview question that I recommend you prepare for. Tell me about a time when you found a simple solution to a challenging problem. Now your ability to use your initiative in difficult situations will help you to stand out from the other candidates during your Amazon interview. My advice is to give an example when you considered your options carefully and then took decisive action to solve a problem at work. So here's my example answer to help you. Tell me about a time when you found a simple solution to a challenging problem. I was working on a technical project and it was late on a Friday afternoon. To finish my element of the project before the end of the working day I needed advice from another team member who was off on annual leave. Now this was really frustrating because he wasn't back at work until Monday but I needed to get my part of the project finished by the end of the day to ensure we stayed on track. Now I considered my options and I came up with a simple solution. I went on to the website StackOverflow.com to ask the question I needed the answer to and within a few minutes I had a response but I needed to double check the answer to make sure it was accurate. Now we always worked to very high standards in the team so it was vital I sought a second opinion. I then went on to the website Upwork.com and posted a job for a developer. I paid a developer for one hour of work to answer the same question. Now he confirmed the initial answer I'd received was correct and then went on and finished my element of the project by the clothes of office that day. That's a really good answer you have found a simple solution to a problem that could hinder the progress of your project. So you have found a way forward and that is what somebody would do who works for Amazon. They would find a way forward to solve their problem. Now don't go anywhere because I still have many more questions and answers to give you. But when you're ready click that link in the top right and corner of the video. It will take you through to my website PassMainTV.com and you can download my full set of 21 Amazon Behavioral Interview Questions and Top Scoring Answer including the ones we are working through together today. But here's the next question to help you prepare. Tell me about a time when you had to make a quick decision that was going to have a significant impact on the business. Now this is a very difficult interview question to answer correctly. My advice is to demonstrate to the Amazon hiring manager that you are not afraid to make quick decisions and you always weigh up the options before deciding on the best course of action to take. Here's my example answer to help you. Tell me about a time when you had to make a quick decision that was going to have a significant impact on the business. Here we go. I was working in a previous role deputizing for my manager who was away on annual leave. Now a problem occurred with one of our suppliers who informed us that they were not able to deliver the products we had ordered for another 14 days. Now this delay would impact negatively on our customers. So I needed to make a quick decision. I had the option of either contacting all customers to apologize for the delay which was out of our control or I could quickly source an alternative supplier which would then eat into the company's profits. But the customers would still receive their orders on time. Now in total 48 customers will be affected by the delay. So I decided to quickly source a new supplier and write off the profits for those sales. Now in this situation I felt the potential negative impact on our business far outweigh the profit we would have made from those 48 sales. So that shows that you're not afraid to make a decision that's in the best interests of the organization. And because there's so many orders you believe it's the best course of action to take to protect your customers and don't forget Amazon is very customer focused. Here is the next example. Amazon behavioral interview question that I recommend you prepare for. Tell me about a time when you had to say no to a customer or client. Now saying no to a customer or client is a really difficult thing to do especially if you're like Amazon and you always focusing tentally on the customers. But it must be done with professionalism and attack now although customer services crucial to the success of Amazon. It also has a responsibility to be frugal and to ensure it maintains profitability. So here's my example answer to help you. Tell me about a time when you had to say no to a customer or client. In my previous role I was working as part of a project team that was responsible for creating and building a team. And building a time sensitive website for an important client. Now the client was difficult to deal with and very demanding. But I enjoyed working with him because he tested my skills, my knowledge, my project management capabilities. Now the client started to ask for additions to the website specification early on that were outside of the initial agreed scope. I assessed his requests and I wasn't comfortable agreeing to them because they were too expensive. And I felt this would set a precedent for further additions to be requested. I called him on the telephone and I was totally honest and transparent when refusing his requests. Now although he was disappointed because of the amount of money he was spending with us, he respected my decision. Now whenever I work on projects I have a responsibility to balance going above and beyond for a customer or client with the profitability of the business I'm working for. So that shows that you are not afraid to say no, you are totally transparent with the customer or the client when speaking to them and you are professional in doing so. Don't forget customer service is very, very important but you also have that responsibility to make sure that the business is successful and profitable. Here is the next Amazon Behavioral Interview question. Tell me about a time when you were able to influence change in an organisation by only asking questions. Wow, this is a tough question to answer correctly. In your response, demonstrate you always put the company you are working for first and you ask questions in the right way to achieve the desired outcome. Here's my example answer to help you. What I'm talking about a time when you were able to influence change in an organisation by only asking questions. Here we go. I was attending a meeting with other team members and we were discussing the action plan for the creation of a new company product that was going to be built. Now part way through the meeting, one of the team members suggested that we could save considerable sums of money if we used a cheaper product part. Now most people in the meeting felt this was a good idea but I wasn't comfortable. So I asked him three questions. The first question was, could we be sure that by using the cheaper part the product would be entirely safe? The second question was, how would product reviews and customer trust be impacted if someone found out the part we had used was cheap, especially when we were planning on charging a premium for that product? Finally the third question I asked was, were we satisfied that by using a cheaper product part, this was in line with the company's customer service charter and values. Now just by asking those three simple questions, I managed to convince everyone that using a cheaper product part was not a good idea. That's a clever answer to that very difficult Amazon interview question. Here is the next Amazon behavioral interview question I want you to prepare for. Tell me about a time when you had to work with incomplete data or missing information. Now this is a common Amazon behavioral interview question. The question is clearly assessing your ability to find a way around a problem when you have incomplete or missing information. So here's my example answer to help you. Tell me about a time when you had to work with incomplete data or missing information. I'd been given a task by my manager that required me to create a risk assessment for a new piece of machinery we were going to be using at work. Now the machinery was used to help men's of staff get boxes down from height in the warehouse and I was required to ensure a full risk assessment was completed and disseminated amongst the staff. Now whilst checking over the machinery, I noticed the manufacturers operating instructions were not complete, regarding the level of personal protective equipment that must be worn while operating the machinery. So I tried to contact the manufacturer but they were not available. Now because the risk assessment needed to be completed that same day, I went ahead with the task anyway, but I put in additional precautions in respect of the PPE that must be worn during the machinery's operation. Now this included the wearing of a hard hat, safety goggles, a high visibility jacket and steel tow cap to shoes. Now despite having missing information, I was still able to carry out a suitable assessment to complete that task. I determined the risk from injury to be high after carrying out a careful analysis of the use of the machinery. Here is the next question to help you prepare for your Amazon interview. Tell me about a time when you had no choice but to work with limited resources. Now most people will not work with limited resources. They will wait until they have the right level of resources and support available. However, someone who works at Amazon will find a solution to this issue and they will still get the task or project completed on time. And this again is one of the reasons why Amazon has been so successful in what it does. Here's my example answer to help you. Tell me about a time when you had no choice but to work with limited resources here we go. I was working as part of a team developing a new software tool for one of the company's clients. It was a big client and one that was extremely valuable to the business. Now halfway through the project two members of Starfell ill and they were going to be off work for a couple of weeks. Now this situation put the project in danger of not being completed on time. So I assessed our options. Now no other members of Starfell were available to help from other departments and there was no way I was going to extend the deadline. We simply had to get the project finished. So I decided to assess which tasks could be outsourced. I then hired a freelancer from the website freelancer.com after getting approval from my manager. And this proved to be a great decision. The freelancer worked in a different time zone towards. So as soon as we came into work each morning he had finished the task we had set him the day before. Now by being creative and by exploring our options I was able to get the project finished and delivered to the client on time. So that's a really good example answer where you have no choice but to work with limited resources. But you find a way around the problem. You come up with a really good innovative solution to the issue. Now the next thing to do is please make sure you click that link right now in the top right hand corner of the video. Head over to my website, passmaintoview.com and you can take a look at my full set of 21 Amazon behavioral interview questions and you also have the opportunity to download all of the answers. Including the ones I have covered today during this presentation. You can literally have them all in a handy PDF guide within your inbox within two minutes from now. So make sure you check that out. That resource will make a big difference to your preparation during your Amazon interview. Finally, don't forget to subscribe to the channel. As I said at the start lots of you are passing your interviews. We have about 700,000 people now within the career of its community. I love helping you guys but I can only do that if you are subscribed. Don't forget to connect with me on LinkedIn. I've put my LinkedIn link in the description below the video. It's always good to connect with like minded professionals such as yourself and just give the video a quick thumbs up to say that you find this content useful because that always motivates me to create more for you. Thank you so much for watching and I wish you all the best for passing your Amazon interview. Have a brilliant day.",
  "segments": [
    {
      "id": 0,
      "text": "Hello there my name is Richard McMunn from the interview training website, pass my interview.com"
    },
    {
      "id": 1,
      "text": "and in this presentation I will teach you how to pass an Amazon interview and in particular"
    },
    {
      "id": 2,
      "text": "I am going to give you a number of Amazon behavioral interview questions to prepare for"
    },
    {
      "id": 3,
      "text": "now if you have a job interview coming up with Amazon make sure you stay tuned because I will help you to succeed"
    },
    {
      "id": 4,
      "text": "and to achieve that goal this is what I will cover."
    },
    {
      "id": 5,
      "text": "So I will give you a list of Amazon behavioral interview questions that I strongly recommend you prepare for."
    },
    {
      "id": 6,
      "text": "I will then give you unique example answers to common Amazon behavioral interview questions."
    },
    {
      "id": 7,
      "text": "I will also give you some really important tips on how you can stand out during your Amazon job interview."
    },
    {
      "id": 8,
      "text": "And finally I will tell you how you can access further resources including these slides and the answers to help you succeed."
    },
    {
      "id": 9,
      "text": "And please don't forget to connect with me on LinkedIn."
    },
    {
      "id": 10,
      "text": "I have put my LinkedIn link in the description below the video and it's always great to connect with like my new professionals such as yourself."
    },
    {
      "id": 11,
      "text": "Don't forget to subscribe to the channel lots of you are passing your interviews as a result of the content I don't want you to miss out."
    },
    {
      "id": 12,
      "text": "And please just give the video a like because that tells me you find the content useful."
    },
    {
      "id": 13,
      "text": "And to make your life easier I have also placed the timestamps to each question in the description below the video."
    },
    {
      "id": 14,
      "text": "So if you want to jump to a particular question you can do that with ease by checking out the links in the description below the video."
    },
    {
      "id": 15,
      "text": "Let's get started."
    },
    {
      "id": 16,
      "text": "So the first Amazon behavioral interview question I recommend you prepare for is tell me about a time when you asked a customer for feedback."
    },
    {
      "id": 17,
      "text": "Now Amazon has been successful over the years because it fully understands the importance of the customer."
    },
    {
      "id": 18,
      "text": "It's what sets them apart from other online organizations."
    },
    {
      "id": 19,
      "text": "Now in your answer to this first behavioral interview question give a specific example of a situation when you sort feedback from a customer and then use it to the company's advantage."
    },
    {
      "id": 20,
      "text": "So here's my example answer to help you."
    },
    {
      "id": 21,
      "text": "Tell me about a time when you asked a customer for feedback here we go."
    },
    {
      "id": 22,
      "text": "I was dealing with a customer in a previous role on the telephone and they didn't sound particularly happy with our service."
    },
    {
      "id": 23,
      "text": "Now although they weren't making a direct complaint I could detect in their voice that they weren't entirely satisfied."
    },
    {
      "id": 24,
      "text": "I asked them how their experience had been whilst ordering from us and I found their response in lightning."
    },
    {
      "id": 25,
      "text": "They said our website was not easy to navigate and they were disappointed there was no option for a faster delivery time other than the standard postal service."
    },
    {
      "id": 26,
      "text": "I asked them a few questions about the issues they were experiencing online and I took notes as they spoke."
    },
    {
      "id": 27,
      "text": "Now after they had finished placing their order over the telephone I thanked them for their feedback."
    },
    {
      "id": 28,
      "text": "I then spoke to my manager to explain what the customer had said and I gave my opinion about how offering a faster delivery service."
    },
    {
      "id": 29,
      "text": "Could increase revenue and customer satisfaction levels to which he agreed."
    },
    {
      "id": 30,
      "text": "Now two weeks later the navigation issues had been resolved and we had added a new next day service to the website which helped to increase sales and customer satisfaction levels moving forward."
    },
    {
      "id": 31,
      "text": "So that's a brilliant example of how you have detected that a customer is not happy."
    },
    {
      "id": 32,
      "text": "You have asked for feedback and you have then implemented their recommendations to the advantage of the company so it's a really good response."
    },
    {
      "id": 33,
      "text": "Here is the next Amazon behavioral interview question that I recommend you prepare for."
    },
    {
      "id": 34,
      "text": "Tell me about a time when you found a simple solution to a challenging problem."
    },
    {
      "id": 35,
      "text": "Now your ability to use your initiative in difficult situations will help you to stand out from the other candidates during your Amazon interview."
    },
    {
      "id": 36,
      "text": "My advice is to give an example when you considered your options carefully and then took decisive action to solve a problem at work."
    },
    {
      "id": 37,
      "text": "So here's my example answer to help you."
    },
    {
      "id": 38,
      "text": "Tell me about a time when you found a simple solution to a challenging problem."
    },
    {
      "id": 39,
      "text": "I was working on a technical project and it was late on a Friday afternoon."
    },
    {
      "id": 40,
      "text": "To finish my element of the project before the end of the working day I needed advice from another team member who was off on annual leave."
    },
    {
      "id": 41,
      "text": "Now this was really frustrating because he wasn't back at work until Monday but I needed to get my part of the project finished by the end of the day to ensure we stayed on track."
    },
    {
      "id": 42,
      "text": "Now I considered my options and I came up with a simple solution."
    },
    {
      "id": 43,
      "text": "I went on to the website StackOverflow.com to ask the question I needed the answer to and within a few minutes I had a response but I needed to double check the answer to make sure it was accurate."
    },
    {
      "id": 44,
      "text": "Now we always worked to very high standards in the team so it was vital I sought a second opinion."
    },
    {
      "id": 45,
      "text": "I then went on to the website Upwork.com and posted a job for a developer."
    },
    {
      "id": 46,
      "text": "I paid a developer for one hour of work to answer the same question."
    },
    {
      "id": 47,
      "text": "Now he confirmed the initial answer I'd received was correct and then went on and finished my element of the project by the clothes of office that day."
    },
    {
      "id": 48,
      "text": "That's a really good answer you have found a simple solution to a problem that could hinder the progress of your project."
    },
    {
      "id": 49,
      "text": "So you have found a way forward and that is what somebody would do who works for Amazon."
    },
    {
      "id": 50,
      "text": "They would find a way forward to solve their problem."
    },
    {
      "id": 51,
      "text": "Now don't go anywhere because I still have many more questions and answers to give you."
    },
    {
      "id": 52,
      "text": "But when you're ready click that link in the top right and corner of the video."
    },
    {
      "id": 53,
      "text": "It will take you through to my website PassMainTV.com and you can download my full set of 21 Amazon Behavioral Interview Questions and Top Scoring Answer including the ones we are working through together today."
    },
    {
      "id": 54,
      "text": "But here's the next question to help you prepare."
    },
    {
      "id": 55,
      "text": "Tell me about a time when you had to make a quick decision that was going to have a significant impact on the business."
    },
    {
      "id": 56,
      "text": "Now this is a very difficult interview question to answer correctly."
    },
    {
      "id": 57,
      "text": "My advice is to demonstrate to the Amazon hiring manager that you are not afraid to make quick decisions and you always weigh up the options before deciding on the best course of action to take."
    },
    {
      "id": 58,
      "text": "Here's my example answer to help you."
    },
    {
      "id": 59,
      "text": "Tell me about a time when you had to make a quick decision that was going to have a significant impact on the business."
    },
    {
      "id": 60,
      "text": "Here we go."
    },
    {
      "id": 61,
      "text": "I was working in a previous role deputizing for my manager who was away on annual leave."
    },
    {
      "id": 62,
      "text": "Now a problem occurred with one of our suppliers who informed us that they were not able to deliver the products we had ordered for another 14 days."
    },
    {
      "id": 63,
      "text": "Now this delay would impact negatively on our customers."
    },
    {
      "id": 64,
      "text": "So I needed to make a quick decision."
    },
    {
      "id": 65,
      "text": "I had the option of either contacting all customers to apologize for the delay which was out of our control or I could quickly source an alternative supplier which would then eat into the company's profits."
    },
    {
      "id": 66,
      "text": "But the customers would still receive their orders on time."
    },
    {
      "id": 67,
      "text": "Now in total 48 customers will be affected by the delay."
    },
    {
      "id": 68,
      "text": "So I decided to quickly source a new supplier and write off the profits for those sales."
    },
    {
      "id": 69,
      "text": "Now in this situation I felt the potential negative impact on our business far outweigh the profit we would have made from those 48 sales."
    },
    {
      "id": 70,
      "text": "So that shows that you're not afraid to make a decision that's in the best interests of the organization."
    },
    {
      "id": 71,
      "text": "And because there's so many orders you believe it's the best course of action to take to protect your customers and don't forget Amazon is very customer focused."
    },
    {
      "id": 72,
      "text": "Here is the next example."
    },
    {
      "id": 73,
      "text": "Amazon behavioral interview question that I recommend you prepare for."
    },
    {
      "id": 74,
      "text": "Tell me about a time when you had to say no to a customer or client."
    },
    {
      "id": 75,
      "text": "Now saying no to a customer or client is a really difficult thing to do especially if you're like Amazon and you always focusing tentally on the customers."
    },
    {
      "id": 76,
      "text": "But it must be done with professionalism and attack now although customer services crucial to the success of Amazon."
    },
    {
      "id": 77,
      "text": "It also has a responsibility to be frugal and to ensure it maintains profitability."
    },
    {
      "id": 78,
      "text": "So here's my example answer to help you."
    },
    {
      "id": 79,
      "text": "Tell me about a time when you had to say no to a customer or client."
    },
    {
      "id": 80,
      "text": "In my previous role I was working as part of a project team that was responsible for creating and building a team."
    },
    {
      "id": 81,
      "text": "And building a time sensitive website for an important client."
    },
    {
      "id": 82,
      "text": "Now the client was difficult to deal with and very demanding."
    },
    {
      "id": 83,
      "text": "But I enjoyed working with him because he tested my skills, my knowledge, my project management capabilities."
    },
    {
      "id": 84,
      "text": "Now the client started to ask for additions to the website specification early on that were outside of the initial agreed scope."
    },
    {
      "id": 85,
      "text": "I assessed his requests and I wasn't comfortable agreeing to them because they were too expensive."
    },
    {
      "id": 86,
      "text": "And I felt this would set a precedent for further additions to be requested."
    },
    {
      "id": 87,
      "text": "I called him on the telephone and I was totally honest and transparent when refusing his requests."
    },
    {
      "id": 88,
      "text": "Now although he was disappointed because of the amount of money he was spending with us, he respected my decision."
    },
    {
      "id": 89,
      "text": "Now whenever I work on projects I have a responsibility to balance going above and beyond for a customer or client with the profitability of the business I'm working for."
    },
    {
      "id": 90,
      "text": "So that shows that you are not afraid to say no, you are totally transparent with the customer or the client when speaking to them and you are professional in doing so."
    },
    {
      "id": 91,
      "text": "Don't forget customer service is very, very important but you also have that responsibility to make sure that the business is successful and profitable."
    },
    {
      "id": 92,
      "text": "Here is the next Amazon Behavioral Interview question."
    },
    {
      "id": 93,
      "text": "Tell me about a time when you were able to influence change in an organisation by only asking questions."
    },
    {
      "id": 94,
      "text": "Wow, this is a tough question to answer correctly."
    },
    {
      "id": 95,
      "text": "In your response, demonstrate you always put the company you are working for first and you ask questions in the right way to achieve the desired outcome."
    },
    {
      "id": 96,
      "text": "Here's my example answer to help you."
    },
    {
      "id": 97,
      "text": "What I'm talking about a time when you were able to influence change in an organisation by only asking questions."
    },
    {
      "id": 98,
      "text": "Here we go."
    },
    {
      "id": 99,
      "text": "I was attending a meeting with other team members and we were discussing the action plan for the creation of a new company product that was going to be built."
    },
    {
      "id": 100,
      "text": "Now part way through the meeting, one of the team members suggested that we could save considerable sums of money if we used a cheaper product part."
    },
    {
      "id": 101,
      "text": "Now most people in the meeting felt this was a good idea but I wasn't comfortable."
    },
    {
      "id": 102,
      "text": "So I asked him three questions. The first question was, could we be sure that by using the cheaper part the product would be entirely safe?"
    },
    {
      "id": 103,
      "text": "The second question was, how would product reviews and customer trust be impacted if someone found out the part we had used was cheap,"
    },
    {
      "id": 104,
      "text": "especially when we were planning on charging a premium for that product?"
    },
    {
      "id": 105,
      "text": "Finally the third question I asked was, were we satisfied that by using a cheaper product part, this was in line with the company's customer service charter and values."
    },
    {
      "id": 106,
      "text": "Now just by asking those three simple questions, I managed to convince everyone that using a cheaper product part was not a good idea."
    },
    {
      "id": 107,
      "text": "That's a clever answer to that very difficult Amazon interview question."
    },
    {
      "id": 108,
      "text": "Here is the next Amazon behavioral interview question I want you to prepare for."
    },
    {
      "id": 109,
      "text": "Tell me about a time when you had to work with incomplete data or missing information."
    },
    {
      "id": 110,
      "text": "Now this is a common Amazon behavioral interview question. The question is clearly assessing your ability to find a way around a problem when you have incomplete or missing information."
    },
    {
      "id": 111,
      "text": "So here's my example answer to help you."
    },
    {
      "id": 112,
      "text": "Tell me about a time when you had to work with incomplete data or missing information."
    },
    {
      "id": 113,
      "text": "I'd been given a task by my manager that required me to create a risk assessment for a new piece of machinery we were going to be using at work."
    },
    {
      "id": 114,
      "text": "Now the machinery was used to help men's of staff get boxes down from height in the warehouse and I was required to ensure a full risk assessment was completed and disseminated amongst the staff."
    },
    {
      "id": 115,
      "text": "Now whilst checking over the machinery, I noticed the manufacturers operating instructions were not complete,"
    },
    {
      "id": 116,
      "text": "regarding the level of personal protective equipment that must be worn while operating the machinery."
    },
    {
      "id": 117,
      "text": "So I tried to contact the manufacturer but they were not available."
    },
    {
      "id": 118,
      "text": "Now because the risk assessment needed to be completed that same day, I went ahead with the task anyway,"
    },
    {
      "id": 119,
      "text": "but I put in additional precautions in respect of the PPE that must be worn during the machinery's operation."
    },
    {
      "id": 120,
      "text": "Now this included the wearing of a hard hat, safety goggles, a high visibility jacket and steel tow cap to shoes."
    },
    {
      "id": 121,
      "text": "Now despite having missing information, I was still able to carry out a suitable assessment to complete that task."
    },
    {
      "id": 122,
      "text": "I determined the risk from injury to be high after carrying out a careful analysis of the use of the machinery."
    },
    {
      "id": 123,
      "text": "Here is the next question to help you prepare for your Amazon interview."
    },
    {
      "id": 124,
      "text": "Tell me about a time when you had no choice but to work with limited resources."
    },
    {
      "id": 125,
      "text": "Now most people will not work with limited resources."
    },
    {
      "id": 126,
      "text": "They will wait until they have the right level of resources and support available."
    },
    {
      "id": 127,
      "text": "However, someone who works at Amazon will find a solution to this issue and they will still get the task or project completed on time."
    },
    {
      "id": 128,
      "text": "And this again is one of the reasons why Amazon has been so successful in what it does."
    },
    {
      "id": 129,
      "text": "Here's my example answer to help you."
    },
    {
      "id": 130,
      "text": "Tell me about a time when you had no choice but to work with limited resources here we go."
    },
    {
      "id": 131,
      "text": "I was working as part of a team developing a new software tool for one of the company's clients."
    },
    {
      "id": 132,
      "text": "It was a big client and one that was extremely valuable to the business."
    },
    {
      "id": 133,
      "text": "Now halfway through the project two members of Starfell ill and they were going to be off work for a couple of weeks."
    },
    {
      "id": 134,
      "text": "Now this situation put the project in danger of not being completed on time."
    },
    {
      "id": 135,
      "text": "So I assessed our options."
    },
    {
      "id": 136,
      "text": "Now no other members of Starfell were available to help from other departments and there was no way I was going to extend the deadline."
    },
    {
      "id": 137,
      "text": "We simply had to get the project finished."
    },
    {
      "id": 138,
      "text": "So I decided to assess which tasks could be outsourced."
    },
    {
      "id": 139,
      "text": "I then hired a freelancer from the website freelancer.com after getting approval from my manager."
    },
    {
      "id": 140,
      "text": "And this proved to be a great decision."
    },
    {
      "id": 141,
      "text": "The freelancer worked in a different time zone towards."
    },
    {
      "id": 142,
      "text": "So as soon as we came into work each morning he had finished the task we had set him the day before."
    },
    {
      "id": 143,
      "text": "Now by being creative and by exploring our options I was able to get the project finished and delivered to the client on time."
    },
    {
      "id": 144,
      "text": "So that's a really good example answer where you have no choice but to work with limited resources."
    },
    {
      "id": 145,
      "text": "But you find a way around the problem."
    },
    {
      "id": 146,
      "text": "You come up with a really good innovative solution to the issue."
    },
    {
      "id": 147,
      "text": "Now the next thing to do is please make sure you click that link right now in the top right hand corner of the video."
    },
    {
      "id": 148,
      "text": "Head over to my website, passmaintoview.com and you can take a look at my full set of 21 Amazon behavioral interview questions and you also have the opportunity to download all of the answers."
    },
    {
      "id": 149,
      "text": "Including the ones I have covered today during this presentation."
    },
    {
      "id": 150,
      "text": "You can literally have them all in a handy PDF guide within your inbox within two minutes from now."
    },
    {
      "id": 151,
      "text": "So make sure you check that out."
    },
    {
      "id": 152,
      "text": "That resource will make a big difference to your preparation during your Amazon interview."
    },
    {
      "id": 153,
      "text": "Finally, don't forget to subscribe to the channel."
    },
    {
      "id": 154,
      "text": "As I said at the start lots of you are passing your interviews."
    },
    {
      "id": 155,
      "text": "We have about 700,000 people now within the career of its community."
    },
    {
      "id": 156,
      "text": "I love helping you guys but I can only do that if you are subscribed."
    },
    {
      "id": 157,
      "text": "Don't forget to connect with me on LinkedIn."
    },
    {
      "id": 158,
      "text": "I've put my LinkedIn link in the description below the video."
    },
    {
      "id": 159,
      "text": "It's always good to connect with like minded professionals such as yourself and just give the video a quick thumbs up to say that you find this content useful because that always motivates me to create more for you."
    },
    {
      "id": 160,
      "text": "Thank you so much for watching and I wish you all the best for passing your Amazon interview."
    },
    {
      "id": 161,
      "text": "Have a brilliant day."
    }
  ]
}