{
  "file": "iGR7wMqOu2Y.wav",
  "text": " Hello there, my name is Richard McMunn from the Interview Training website, passmyinterview.com and in this tutorial I will teach you how to answer behavioral interview questions. In fact, I am going to give you a mini training course of free training course on how to answer these interview questions to get the highest scores possible. So if you have an interview coming up soon for any role or company, make sure you stay tuned because I promise to help you be the standout candidate. And to achieve that goal, this is what I will cover during this training course. Number one, I will explain what behavioral interview questions are and why they are used during interviews. If you understand what they are and why the hiring manager is asking you them, then it makes it easier for you to give top scoring answers. Number two, I will teach you the number one best structure to use when answering difficult behavioral interview questions. This structure is recognized by all employers and hiring managers. You need to know what the structure is to get the highest scores. Number three, I will then give you lots of example questions and top scoring answers to difficult behavioral interview questions before number four, telling you where you can instantly download these training course slides plus my 100 brilliant answers to difficult interview questions in a PDF guide. And just very quickly, if you are new to my channel, please make sure you hit that subscribe button. Literally thousands of you are passing your interviews. I can only help you if you are subscribed and please give the video a like because that tells me you find these training courses useful and it motivates me to create more content for you. Thank you very much indeed. So to help you pass your interview, I am going to cover five essential mini training modules for answering behavioral interview questions with top scoring answers. So please make sure you take notes during this training course. Module number one, what are behavioral interview questions? Don't forget, you need to know what they are and why they are being asked to give the perfect answer. Well, behavioral interview questions are designed to assess your ability to perform specific tasks and respond to situations in the workplace. Now the idea being that if you have previous experience of workplace situations and more importantly you handled them correctly, you will be a great fit for their team. But what if this is your first job and you don't have any previous experience, you're then sat in the interview and they said you, tell me about the time when you worked in a team and you would respond by saying, but I've never had to work in a team yet. If you say that in response to a behavioral interview question, you will fail, but please don't worry. Because if this is your first interview and you have no previous experience of the situations being asked, I will tell you what to say in module five of this training course. So behavioral interview questions start in any of the following three ways. So look out for these during your interview. The first way that the questions are asked is by the interviewer saying, tell me about a time when you and they would give the situation. They might also say, describe a situation when you had to and again give you the situation or they might say, give us an example of when you. So as soon as you hear the interviewer starts and interview question in any of those three ways, you can say to yourself, I am being asked a behavioral interview question and I need to answer it using the structure Richard is about to give me. So a quick recap on module number one of this training course. Behavioral interview questions assess how you have performed or acted in previous workplace situations. Now to partial interview, you have to give an answer that demonstrates competence in the area being assessed and behavioral interview questions start by describing a situation, tell me about a time or give us an example. So that is module number one complete. What are behavioral interview questions? Let's now move on to module number two. Now during this module, we are going to cover the top 10 most common behavioral interview questions. The idea being that if you understand what the top 10 most common behavioral interview questions are, you can prepare top scoring answers for them. So behavioral interview question number one the most common one is tell me about a time when you had to work in a team. The second question is tell me about a time when you had to solve a challenging problem. Behavioral interview question number three is give us an example of when you delivered excellent customer service. Question four, describe a situation when you had a conflict with a coworker. Now that is one of the behavioral interview questions where the majority of candidates fail to let interviews on because they say, well, if I did have conflict with a coworker, I will tell my manager about it. That is not the way to answer that difficult behavioral interview question. I will give you an example answer very soon. Behavioral interview question five, tell me about a time when you had to work under pressure. Number six is describe a situation when you disagreed with your boss. That is another behavioral question where people fail their interviews on. They say, I've never disagreed with my boss and I never would do either. That is not the way to answer it again. I will give you a top scoring answer very soon. Behavioral interview question seven is give us an example of a mistake you made. That is another tricky one. Number eight, explain a time when you took the initiative on a project. Number nine, describe a time when you went above and beyond what was required at work. Number ten is describe a time when you had to work with a difficult coworker. So you can see all of these questions are really difficult to answer. Those are the top ten most common asked behavioral interview questions during all types of job interviews. So that is module number two now complete. You are now aware of the top ten most common behavioral interview questions. Let's now move on to the all important module number three. And I will teach you how to answer behavioral interview questions using what is called the star technique. Now the star technique is recognized by all hiring managers and employers as the correct way to answer behavioral interview questions. You have to learn the star technique and use it during your answers. If you are going to pass your interview with the highest scores achievable. So what is the star technique? Well let's assume you are sat down in the interview chair and the interview says to you, tell me about a time when you worked in a team. As soon as you hear them say, tell me about a time or describe a situation or explain to me a previous scenario where you were. And then they give you the situation you should automatically think to yourself, start technique. I need to now use the star technique to answer this difficult behavioral interview question. But what does the star technique mean? Well it means situation, task, action and result. And I recommend you learn those four words before you attend your interview. That's the star technique situation, task, action and result. So when you answer the interview questions, the behavioral interview questions you would. Start your answer and outline the situation you were faced with. You then move on and briefly explain the task that needed doing. This is a task that needs your attention. You then give in-depth details about the action you took. And I would suggest that the action part of your answer is the most detailed and in-depth. And then finally you finish off and talk about the results of your action. So that's the star technique situation, task, action and result. Let me now give you an example of the star technique in action when answering one of the most common behavioral interview questions. Tell me about the time when you worked in a team here we go. In a previous job, my manager asked the team I was in to find ways to help the company save money. It was our task to brainstorm ideas and then present them to our manager. So we arranged a team meeting and agreed the structure. Everyone would have the opportunity to put forward their ideas. We would all listen and then shortlist the best ones. I suggested we should seek a new supplier for our office resources because they were too expensive. I also suggested we should turn off the heating system in the afternoon because people often complained. It was too hot. Other people in the team suggested we could use free software instead of the expensive ones. We were currently using. Now at the end of the meeting we had seven great ideas for saving money. I presented these to our manager and she implemented them all which resulted in significant savings for the business. That's a brilliant answer that uses a star technique. It's a great answer when you're working in a team because you're also coming up with ideas. You're saying, I implemented I put forward an idea which was to seek a new supply for our office resources. I also suggested we should turn off the heating system so you are contributing to the team. Other people are putting ideas forward and then more importantly, there is a positive outcome. At the end of the meeting we had seven great ideas. So make sure the result when you give your answers to all of the behavioral interview questions is a positive one. Make sure the result is positive following your actions. Okay, so that's module three of our training course now complete. You know how to answer behavioral interview questions using that all important star technique. Let's move on to module four. But before we do that, so I've still got two more modules to give you. But when you're ready if you want to download these slides plus my 100 brilliant answers to difficult interview questions, you can click that link in the top right-hand corner of the video at any point. Let's move on to module four. Now during module four, I'm going to give you some more sample answers to difficult behavioral interview questions. Let's have a look at those difficult ones. The first one is describe a situation when you disagreed with your boss. Do not say in response to this. I've never disagreed with my boss and I never would do either. Don't forget, in module five, I'm going to tell you how to answer these questions if you have no previous experience of them. Here we go. describe a situation when you disagreed with your boss. A customer had made a complaint about how difficult it was to order from our company website. When I dealt with the complaint, they made several suggestions as to how we could improve. I presented these suggestions to my manager, but it wasn't interested in taking them forward. I felt this was a missed opportunity for us to increase sales, so it's my task to change his mind. I explained that I had noticed a drop in our online sales, despite there being record numbers of website visitors. I suggested we could potentially increase sales easily if we under-toker review of our website shopping cart. I asked for permission to hire a freelancer to look at this for us to which he agreed. After hiring a suitably qualified freelancer from the website upwork.com, they suggested four areas of improvement. After these were implemented, our website sales increased significantly. That's a great answer you are disagreeing with your boss. There's a benefit to the company involved in the answer too, which I really like because you're increasing sales because of your actions and there's a positive outcome at the end. You can see how these answers are going to be brilliant to help you pass your interview is the next one. Describe a time when you had a conflict with a coworker. Wow, don't forget, do not answer this question by saying, if I did have conflict with a coworker, I would tell my boss about it for them to deal with. That is not the way to answer it. Here is, when I started working my previous job, I was attending a team meeting. Whenever I put forward ideas, another member of the team kept dismissing them. It was my task to calmly and professionally challenge my new coworker in private to express my concerns about his actions during the meeting. My goal was to build good working relationships with everyone in my team. I considered carefully what I wanted to say. I then spoke to my coworker in private and expressed my concerns before giving examples of when he had repeatedly dismissed my ideas. He immediately apologized and stated it was not his intention to be dismissive. From that moment on, we became friends and great co-workers. Now, by challenging him confidently, professionally and calmly, I was able to stop the conflict before it progressed and damaged the output of the team. That's another really good answer to a difficult, behavioral interview question and more importantly, there is a positive outcome. Don't forget, make sure there is a positive outcome. Okay, that's module 4 now complete. We've had a look at some sample answers to behavioral interview questions. Let me now move on to module 5, which is, how to answer behavioral interview questions when you have no previous experience. Now you remember, previously I said, you might be in your interview. You've not been in these situations before they say to you, tell me about the time when you worked in a team. You say, I've never had to work in a team. You will fail your interview, but how should you answer it? Here's an example of what to do. Tell me about a time when you worked in a team. Here we go. Although I haven't yet worked in a team, I do know what I would do in that situation. I would listen to the team brief and write down any instructions. I would then discuss the team's goal with my co-workers and generate a plan of action for us all to work towards. Next, I would suggest we allocate tasks to team members, based on each other's strengths, get to work and support each other throughout the process. Communication, motivation and a clear focus on the end goal are vital in any team situation. So the trick is, if you have no previous work experience of the behavioral situation being assessed, tell them what you would do in that type of situation and you'll be far more likely to partial interview. Okay, so that's module 5. Now complete. You know how to answer behavioral interview questions we've no experience. What should you do next? Well, if you want to download a copy of these exact slides that contains the answers I've given you plus another 100 brilliant responses to difficult interview questions, click that link right now in the top right hand corner of the video. Head straight through to my website, passmaintevue.com and you can download these slides and 100 brilliant answers to difficult interview questions in a PDF guide so you can have it in your inbox literally within two minutes from now. In that guide, I have given you answers to many other behavioral interview questions including all of the top 10 that I mentioned earlier on during this training course. Also, please make sure you hit the subscribe button as you can imagine, literally 1000 of you and I mean 1000 of you are passing your interviews as a result of the training videos I'm providing you with if you are subscribed, I can help you not just pass every job interview, I can also help you negotiate to salary and progress throughout your career. Please make sure you subscribe, give the video like, it's a small ask, it motivates me to create more content for you. Thank you very much and don't forget to connect with me on LinkedIn. I have put my LinkedIn link in the description below this video. It's always a pleasure to connect with like-minded professionals such as yourself. Thank you for watching and wish you all the best. For passing your job interview, have a great day.",
  "segments": [
    {
      "id": 0,
      "text": "Hello there, my name is Richard McMunn from the Interview Training website,"
    },
    {
      "id": 1,
      "text": "passmyinterview.com and in this tutorial I will teach you how to answer behavioral interview"
    },
    {
      "id": 2,
      "text": "questions."
    },
    {
      "id": 3,
      "text": "In fact, I am going to give you a mini training course of free training course on how to answer"
    },
    {
      "id": 4,
      "text": "these interview questions to get the highest scores possible."
    },
    {
      "id": 5,
      "text": "So if you have an interview coming up soon for any role or company, make sure you stay"
    },
    {
      "id": 6,
      "text": "tuned because I promise to help you be the standout candidate."
    },
    {
      "id": 7,
      "text": "And to achieve that goal, this is what I will cover during this training course."
    },
    {
      "id": 8,
      "text": "Number one, I will explain what behavioral interview questions are and why they are"
    },
    {
      "id": 9,
      "text": "used during interviews."
    },
    {
      "id": 10,
      "text": "If you understand what they are and why the hiring manager is asking you them, then it"
    },
    {
      "id": 11,
      "text": "makes it easier for you to give top scoring answers."
    },
    {
      "id": 12,
      "text": "Number two, I will teach you the number one best structure to use when answering difficult"
    },
    {
      "id": 13,
      "text": "behavioral interview questions."
    },
    {
      "id": 14,
      "text": "This structure is recognized by all employers and hiring managers."
    },
    {
      "id": 15,
      "text": "You need to know what the structure is to get the highest scores."
    },
    {
      "id": 16,
      "text": "Number three, I will then give you lots of example questions and top scoring"
    },
    {
      "id": 17,
      "text": "answers to difficult behavioral interview questions before number four, telling you where"
    },
    {
      "id": 18,
      "text": "you can instantly download these training course slides plus my 100 brilliant answers to"
    },
    {
      "id": 19,
      "text": "difficult interview questions in a PDF guide."
    },
    {
      "id": 20,
      "text": "And just very quickly, if you are new to my channel, please make sure you hit that subscribe"
    },
    {
      "id": 21,
      "text": "button."
    },
    {
      "id": 22,
      "text": "Literally thousands of you are passing your interviews."
    },
    {
      "id": 23,
      "text": "I can only help you if you are subscribed and please give the video a like because that"
    },
    {
      "id": 24,
      "text": "tells me you find these training courses useful and it motivates me to create more content"
    },
    {
      "id": 25,
      "text": "for you."
    },
    {
      "id": 26,
      "text": "Thank you very much indeed."
    },
    {
      "id": 27,
      "text": "So to help you pass your interview, I am going to cover five essential mini training"
    },
    {
      "id": 28,
      "text": "modules for answering behavioral interview questions with top scoring answers."
    },
    {
      "id": 29,
      "text": "So please make sure you take notes during this training course."
    },
    {
      "id": 30,
      "text": "Module number one, what are behavioral interview questions?"
    },
    {
      "id": 31,
      "text": "Don't forget, you need to know what they are and why they are being asked to give the"
    },
    {
      "id": 32,
      "text": "perfect answer."
    },
    {
      "id": 33,
      "text": "Well, behavioral interview questions are designed to assess your ability to perform specific"
    },
    {
      "id": 34,
      "text": "tasks and respond to situations in the workplace."
    },
    {
      "id": 35,
      "text": "Now the idea being that if you have previous experience of workplace situations and more"
    },
    {
      "id": 36,
      "text": "importantly you handled them correctly, you will be a great fit for their team."
    },
    {
      "id": 37,
      "text": "But what if this is your first job and you don't have any previous experience, you're"
    },
    {
      "id": 38,
      "text": "then sat in the interview and they said you, tell me about the time when you worked in"
    },
    {
      "id": 39,
      "text": "a team and you would respond by saying, but I've never had to work in a team yet."
    },
    {
      "id": 40,
      "text": "If you say that in response to a behavioral interview question, you will fail, but please"
    },
    {
      "id": 41,
      "text": "don't worry."
    },
    {
      "id": 42,
      "text": "Because if this is your first interview and you have no previous experience of the situations"
    },
    {
      "id": 43,
      "text": "being asked, I will tell you what to say in module five of this training course."
    },
    {
      "id": 44,
      "text": "So behavioral interview questions start in any of the following three ways."
    },
    {
      "id": 45,
      "text": "So look out for these during your interview."
    },
    {
      "id": 46,
      "text": "The first way that the questions are asked is by the interviewer saying, tell me about"
    },
    {
      "id": 47,
      "text": "a time when you and they would give the situation."
    },
    {
      "id": 48,
      "text": "They might also say, describe a situation when you had to and again give you the situation"
    },
    {
      "id": 49,
      "text": "or they might say, give us an example of when you."
    },
    {
      "id": 50,
      "text": "So as soon as you hear the interviewer starts and interview question in any of those three"
    },
    {
      "id": 51,
      "text": "ways, you can say to yourself, I am being asked a behavioral interview question and I"
    },
    {
      "id": 52,
      "text": "need to answer it using the structure Richard is about to give me."
    },
    {
      "id": 53,
      "text": "So a quick recap on module number one of this training course."
    },
    {
      "id": 54,
      "text": "Behavioral interview questions assess how you have performed or acted in previous workplace"
    },
    {
      "id": 55,
      "text": "situations."
    },
    {
      "id": 56,
      "text": "Now to partial interview, you have to give an answer that demonstrates competence in the area"
    },
    {
      "id": 57,
      "text": "being assessed and behavioral interview questions start by describing a situation, tell me"
    },
    {
      "id": 58,
      "text": "about a time or give us an example."
    },
    {
      "id": 59,
      "text": "So that is module number one complete."
    },
    {
      "id": 60,
      "text": "What are behavioral interview questions?"
    },
    {
      "id": 61,
      "text": "Let's now move on to module number two."
    },
    {
      "id": 62,
      "text": "Now during this module, we are going to cover the top 10 most common behavioral interview"
    },
    {
      "id": 63,
      "text": "questions."
    },
    {
      "id": 64,
      "text": "The idea being that if you understand what the top 10 most common behavioral interview questions"
    },
    {
      "id": 65,
      "text": "are, you can prepare top scoring answers for them."
    },
    {
      "id": 66,
      "text": "So behavioral interview question number one the most common one is tell me about a time"
    },
    {
      "id": 67,
      "text": "when you had to work in a team."
    },
    {
      "id": 68,
      "text": "The second question is tell me about a time when you had to solve a challenging problem."
    },
    {
      "id": 69,
      "text": "Behavioral interview question number three is give us an example of when you delivered"
    },
    {
      "id": 70,
      "text": "excellent customer service."
    },
    {
      "id": 71,
      "text": "Question four, describe a situation when you had a conflict with a coworker."
    },
    {
      "id": 72,
      "text": "Now that is one of the behavioral interview questions where the majority of candidates fail"
    },
    {
      "id": 73,
      "text": "to let interviews on because they say, well, if I did have conflict with a coworker,"
    },
    {
      "id": 74,
      "text": "I will tell my manager about it."
    },
    {
      "id": 75,
      "text": "That is not the way to answer that difficult behavioral interview question."
    },
    {
      "id": 76,
      "text": "I will give you an example answer very soon."
    },
    {
      "id": 77,
      "text": "Behavioral interview question five, tell me about a time when you had to work under pressure."
    },
    {
      "id": 78,
      "text": "Number six is describe a situation when you disagreed with your boss."
    },
    {
      "id": 79,
      "text": "That is another behavioral question where people fail their interviews on."
    },
    {
      "id": 80,
      "text": "They say, I've never disagreed with my boss and I never would do either."
    },
    {
      "id": 81,
      "text": "That is not the way to answer it again."
    },
    {
      "id": 82,
      "text": "I will give you a top scoring answer very soon."
    },
    {
      "id": 83,
      "text": "Behavioral interview question seven is give us an example of a mistake you made."
    },
    {
      "id": 84,
      "text": "That is another tricky one."
    },
    {
      "id": 85,
      "text": "Number eight, explain a time when you took the initiative on a project."
    },
    {
      "id": 86,
      "text": "Number nine, describe a time when you went above and beyond what was required at work."
    },
    {
      "id": 87,
      "text": "Number ten is describe a time when you had to work with a difficult coworker."
    },
    {
      "id": 88,
      "text": "So you can see all of these questions are really difficult to answer."
    },
    {
      "id": 89,
      "text": "Those are the top ten most common asked behavioral interview questions during all types of job interviews."
    },
    {
      "id": 90,
      "text": "So that is module number two now complete."
    },
    {
      "id": 91,
      "text": "You are now aware of the top ten most common behavioral interview questions."
    },
    {
      "id": 92,
      "text": "Let's now move on to the all important module number three."
    },
    {
      "id": 93,
      "text": "And I will teach you how to answer behavioral interview questions using what is called the star technique."
    },
    {
      "id": 94,
      "text": "Now the star technique is recognized by all hiring managers and employers as the correct way to answer behavioral interview questions."
    },
    {
      "id": 95,
      "text": "You have to learn the star technique and use it during your answers."
    },
    {
      "id": 96,
      "text": "If you are going to pass your interview with the highest scores achievable."
    },
    {
      "id": 97,
      "text": "So what is the star technique?"
    },
    {
      "id": 98,
      "text": "Well let's assume you are sat down in the interview chair and the interview says to you,"
    },
    {
      "id": 99,
      "text": "tell me about a time when you worked in a team."
    },
    {
      "id": 100,
      "text": "As soon as you hear them say, tell me about a time or describe a situation or explain to me a previous scenario where you were."
    },
    {
      "id": 101,
      "text": "And then they give you the situation you should automatically think to yourself, start technique."
    },
    {
      "id": 102,
      "text": "I need to now use the star technique to answer this difficult behavioral interview question."
    },
    {
      "id": 103,
      "text": "But what does the star technique mean?"
    },
    {
      "id": 104,
      "text": "Well it means situation, task, action and result."
    },
    {
      "id": 105,
      "text": "And I recommend you learn those four words before you attend your interview."
    },
    {
      "id": 106,
      "text": "That's the star technique situation, task, action and result."
    },
    {
      "id": 107,
      "text": "So when you answer the interview questions, the behavioral interview questions you would."
    },
    {
      "id": 108,
      "text": "Start your answer and outline the situation you were faced with."
    },
    {
      "id": 109,
      "text": "You then move on and briefly explain the task that needed doing."
    },
    {
      "id": 110,
      "text": "This is a task that needs your attention."
    },
    {
      "id": 111,
      "text": "You then give in-depth details about the action you took."
    },
    {
      "id": 112,
      "text": "And I would suggest that the action part of your answer is the most detailed and in-depth."
    },
    {
      "id": 113,
      "text": "And then finally you finish off and talk about the results of your action."
    },
    {
      "id": 114,
      "text": "So that's the star technique situation, task, action and result."
    },
    {
      "id": 115,
      "text": "Let me now give you an example of the star technique in action when answering one of the most common behavioral interview questions."
    },
    {
      "id": 116,
      "text": "Tell me about the time when you worked in a team here we go."
    },
    {
      "id": 117,
      "text": "In a previous job, my manager asked the team I was in to find ways to help the company save money."
    },
    {
      "id": 118,
      "text": "It was our task to brainstorm ideas and then present them to our manager."
    },
    {
      "id": 119,
      "text": "So we arranged a team meeting and agreed the structure."
    },
    {
      "id": 120,
      "text": "Everyone would have the opportunity to put forward their ideas."
    },
    {
      "id": 121,
      "text": "We would all listen and then shortlist the best ones."
    },
    {
      "id": 122,
      "text": "I suggested we should seek a new supplier for our office resources because they were too expensive."
    },
    {
      "id": 123,
      "text": "I also suggested we should turn off the heating system in the afternoon because people often complained."
    },
    {
      "id": 124,
      "text": "It was too hot."
    },
    {
      "id": 125,
      "text": "Other people in the team suggested we could use free software instead of the expensive ones."
    },
    {
      "id": 126,
      "text": "We were currently using."
    },
    {
      "id": 127,
      "text": "Now at the end of the meeting we had seven great ideas for saving money."
    },
    {
      "id": 128,
      "text": "I presented these to our manager and she implemented them all which resulted in significant savings for the business."
    },
    {
      "id": 129,
      "text": "That's a brilliant answer that uses a star technique."
    },
    {
      "id": 130,
      "text": "It's a great answer when you're working in a team because you're also coming up with ideas."
    },
    {
      "id": 131,
      "text": "You're saying, I implemented I put forward an idea which was to seek a new supply for our office resources."
    },
    {
      "id": 132,
      "text": "I also suggested we should turn off the heating system so you are contributing to the team."
    },
    {
      "id": 133,
      "text": "Other people are putting ideas forward and then more importantly,"
    },
    {
      "id": 134,
      "text": "there is a positive outcome. At the end of the meeting we had seven great ideas."
    },
    {
      "id": 135,
      "text": "So make sure the result when you give your answers to all of the behavioral interview questions is a positive one."
    },
    {
      "id": 136,
      "text": "Make sure the result is positive following your actions."
    },
    {
      "id": 137,
      "text": "Okay, so that's module three of our training course now complete."
    },
    {
      "id": 138,
      "text": "You know how to answer behavioral interview questions using that all important star technique."
    },
    {
      "id": 139,
      "text": "Let's move on to module four. But before we do that, so I've still got two more modules to give you."
    },
    {
      "id": 140,
      "text": "But when you're ready if you want to download these slides plus my 100 brilliant answers to"
    },
    {
      "id": 141,
      "text": "difficult interview questions, you can click that link in the top right-hand corner of the video"
    },
    {
      "id": 142,
      "text": "at any point. Let's move on to module four. Now during module four, I'm going to give you some more sample answers"
    },
    {
      "id": 143,
      "text": "to difficult behavioral interview questions. Let's have a look at those difficult ones. The first one is"
    },
    {
      "id": 144,
      "text": "describe a situation when you disagreed with your boss. Do not say in response to this. I've never"
    },
    {
      "id": 145,
      "text": "disagreed with my boss and I never would do either. Don't forget, in module five, I'm going to tell"
    },
    {
      "id": 146,
      "text": "you how to answer these questions if you have no previous experience of them. Here we go."
    },
    {
      "id": 147,
      "text": "describe a situation when you disagreed with your boss. A customer had made a complaint about how"
    },
    {
      "id": 148,
      "text": "difficult it was to order from our company website. When I dealt with the complaint, they made"
    },
    {
      "id": 149,
      "text": "several suggestions as to how we could improve. I presented these suggestions to my manager,"
    },
    {
      "id": 150,
      "text": "but it wasn't interested in taking them forward. I felt this was a missed opportunity for us to"
    },
    {
      "id": 151,
      "text": "increase sales, so it's my task to change his mind. I explained that I had noticed a drop in our"
    },
    {
      "id": 152,
      "text": "online sales, despite there being record numbers of website visitors. I suggested we could potentially"
    },
    {
      "id": 153,
      "text": "increase sales easily if we under-toker review of our website shopping cart. I asked for permission"
    },
    {
      "id": 154,
      "text": "to hire a freelancer to look at this for us to which he agreed. After hiring a suitably qualified"
    },
    {
      "id": 155,
      "text": "freelancer from the website upwork.com, they suggested four areas of improvement. After these were"
    },
    {
      "id": 156,
      "text": "implemented, our website sales increased significantly. That's a great answer you are disagreeing"
    },
    {
      "id": 157,
      "text": "with your boss. There's a benefit to the company involved in the answer too, which I really like"
    },
    {
      "id": 158,
      "text": "because you're increasing sales because of your actions and there's a positive outcome at the end."
    },
    {
      "id": 159,
      "text": "You can see how these answers are going to be brilliant to help you pass your interview is the next one."
    },
    {
      "id": 160,
      "text": "Describe a time when you had a conflict with a coworker. Wow, don't forget, do not answer"
    },
    {
      "id": 161,
      "text": "this question by saying, if I did have conflict with a coworker, I would tell my boss about it"
    },
    {
      "id": 162,
      "text": "for them to deal with. That is not the way to answer it. Here is, when I started working my previous"
    },
    {
      "id": 163,
      "text": "job, I was attending a team meeting. Whenever I put forward ideas, another member of the team"
    },
    {
      "id": 164,
      "text": "kept dismissing them. It was my task to calmly and professionally challenge my new coworker"
    },
    {
      "id": 165,
      "text": "in private to express my concerns about his actions during the meeting. My goal was to build"
    },
    {
      "id": 166,
      "text": "good working relationships with everyone in my team. I considered carefully what I wanted to say."
    },
    {
      "id": 167,
      "text": "I then spoke to my coworker in private and expressed my concerns before giving examples of when"
    },
    {
      "id": 168,
      "text": "he had repeatedly dismissed my ideas. He immediately apologized and stated it was not his intention"
    },
    {
      "id": 169,
      "text": "to be dismissive. From that moment on, we became friends and great co-workers. Now, by challenging"
    },
    {
      "id": 170,
      "text": "him confidently, professionally and calmly, I was able to stop the conflict before it progressed"
    },
    {
      "id": 171,
      "text": "and damaged the output of the team. That's another really good answer to a difficult,"
    },
    {
      "id": 172,
      "text": "behavioral interview question and more importantly, there is a positive outcome. Don't forget,"
    },
    {
      "id": 173,
      "text": "make sure there is a positive outcome. Okay, that's module 4 now complete. We've had a look at"
    },
    {
      "id": 174,
      "text": "some sample answers to behavioral interview questions. Let me now move on to module 5, which is,"
    },
    {
      "id": 175,
      "text": "how to answer behavioral interview questions when you have no previous experience. Now you remember,"
    },
    {
      "id": 176,
      "text": "previously I said, you might be in your interview. You've not been in these situations before"
    },
    {
      "id": 177,
      "text": "they say to you, tell me about the time when you worked in a team. You say, I've never had to work in a"
    },
    {
      "id": 178,
      "text": "team. You will fail your interview, but how should you answer it? Here's an example of what to do."
    },
    {
      "id": 179,
      "text": "Tell me about a time when you worked in a team. Here we go. Although I haven't yet worked in a"
    },
    {
      "id": 180,
      "text": "team, I do know what I would do in that situation. I would listen to the team brief and write"
    },
    {
      "id": 181,
      "text": "down any instructions. I would then discuss the team's goal with my co-workers and generate a"
    },
    {
      "id": 182,
      "text": "plan of action for us all to work towards. Next, I would suggest we allocate tasks to team members,"
    },
    {
      "id": 183,
      "text": "based on each other's strengths, get to work and support each other throughout the process."
    },
    {
      "id": 184,
      "text": "Communication, motivation and a clear focus on the end goal are vital in any team situation."
    },
    {
      "id": 185,
      "text": "So the trick is, if you have no previous work experience of the behavioral situation being assessed,"
    },
    {
      "id": 186,
      "text": "tell them what you would do in that type of situation and you'll be far more likely to partial"
    },
    {
      "id": 187,
      "text": "interview. Okay, so that's module 5. Now complete. You know how to answer behavioral interview"
    },
    {
      "id": 188,
      "text": "questions we've no experience. What should you do next? Well, if you want to download a copy of"
    },
    {
      "id": 189,
      "text": "these exact slides that contains the answers I've given you plus another 100 brilliant responses"
    },
    {
      "id": 190,
      "text": "to difficult interview questions, click that link right now in the top right hand corner of"
    },
    {
      "id": 191,
      "text": "the video. Head straight through to my website, passmaintevue.com and you can download these slides"
    },
    {
      "id": 192,
      "text": "and 100 brilliant answers to difficult interview questions in a PDF guide so you can have it"
    },
    {
      "id": 193,
      "text": "in your inbox literally within two minutes from now. In that guide, I have given you answers to many"
    },
    {
      "id": 194,
      "text": "other behavioral interview questions including all of the top 10 that I mentioned earlier on during"
    },
    {
      "id": 195,
      "text": "this training course. Also, please make sure you hit the subscribe button as you can imagine,"
    },
    {
      "id": 196,
      "text": "literally 1000 of you and I mean 1000 of you are passing your interviews as a result of the"
    },
    {
      "id": 197,
      "text": "training videos I'm providing you with if you are subscribed, I can help you not just pass every"
    },
    {
      "id": 198,
      "text": "job interview, I can also help you negotiate to salary and progress throughout your career."
    },
    {
      "id": 199,
      "text": "Please make sure you subscribe, give the video like, it's a small ask, it motivates me to create"
    },
    {
      "id": 200,
      "text": "more content for you. Thank you very much and don't forget to connect with me on LinkedIn. I have"
    },
    {
      "id": 201,
      "text": "put my LinkedIn link in the description below this video. It's always a pleasure to connect with"
    },
    {
      "id": 202,
      "text": "like-minded professionals such as yourself. Thank you for watching and wish you all the best."
    },
    {
      "id": 203,
      "text": "For passing your job interview, have a great day."
    }
  ]
}