{
  "file": "IV30jAw7dxA.wav",
  "text": " Hey everyone, this is self-made millennial. I'm Madeline Man. Want to know the step-by-step process on how to rock behavioral interview questions? Well, fantastic. Because that's what this whole video is about. To keep getting interview and career tips from the person who has seen it all from the recruiting side, subscribe to this channel and hit the bell to get a new video every Thursday. I'll be teaching you my story toolbox strategy that gets exceptional results. I get the most testimonials of fabulous results from this tip, including this fellow who got the job from this advice and being a loyal watcher of my videos. Heck yes, thank you so much. So I'll give you the steps. You'll need to answer behavioral interview questions and I'll give you an example of this in action and stay to the end because I will tell you my trick for remembering all of this information. A behavioral interview is a question that starts with something like, tell me about a time when. They are asking for examples of things you have done in your past. And at the core, they are asking you to tell them a story. Stories aren't just for bedtime folks. You need to tell stories to be memorable and help them to see themselves working with you. This is my favorite type of question to ask when I'm the interviewer because I can better understand the way you think in a probe situation. When I ask something like, how do you handle stress? I get a very generic answer. But if I ask, tell me about a time you had to complete several projects within a tight deadline. I can hear a story and better understand the way that you respond to the world. What you need to do first is get notable career moments all written down, which is what I call a story toolbox. This will be the basis of all of your answers to behavioral interview questions. And when they ask you a question, that's behavioral. It will keep you from doing the all. Um. Um. Um. What was the question? So take the time to write this all down in a document, such as a time you save the day or solve a big problem, a time when you worked with a difficult person and how you handled it, a time you messed up or failed. Put this all down in your story toolbox. Now, I have a lot more prompts for you and it's kind of boring for me to list them all out verbally here. So I will put a link in the description with a full document of prompts. But by the end of this worksheet, you'll have about 10 or even more stories locked and loaded. So you need to get that story toolbox filled out before moving onto the next steps. And I want to emphasize, you're creating that story toolbox just 10x. Your potential to rock the interview. I'll link a video that walks through how to use this story toolbox for essentially every interview question. Yeah, it's super impactful. So you can get that full edgimication on this. I will link in the description. Okay, now we need to answer the question. They may ask something like, tell me about a time you had to deliver a piece of tough feedback. If we were to look in the toolbox, I provided you. You might start sweating and say, oh god, Madeline, you didn't tell me to write a story about giving feedback. What a curve ball. Nope, thank for a minute. Feedback absolutely played a role in one of your stories. Think for a minute and pick one. For example, I said that you should have a story or two about a time when you worked with a difficult person and how you handled it. I bet there's a great chance you had to deliver some sort of feedback in that story. So tell it. You will be so pleasantly surprised at how many behavioral questions your preconceived stories will fit. Then you answer this in the par method, which is also similar to the star method, but I'd prefer par because it's three steps instead of four concise it's key in the interview. So, P stands for problem. What is the problem or challenge that was put before you? A is for action. What action did you take to attempt to resolve it? And R is the result. What were the outcomes of those actions? Let's say we wrote down a story about how we worked with a coworker who was flaky and didn't do things when they said they were going to. Here's an example problem. I had a coworker who I was depending on for reports, but he would constantly tell me that he wouldn't be able to get it to me in time right when the deadline was about to hit, which impacted my ability to do my job in time. Action. I respected him, so I took the concern straight to him to talk it through. I first showed empathy and said, I can imagine you have so much that you're working on right now and I can tell that you're working hard. Then I was direct about how he was affecting me. So I said, and I wanted to discuss the past three deadlines that we said that you weren't able to meet. When you don't get me the reports on time, it delays the entire production process and leads the rest of us to take several hours to readjust the schedule. How can we ensure this doesn't happen in the future? And then finally, you explain the result. I was nervous about the conversation, but he opened up to me about how he has always trying to chase down the information for the report. And so we came up with a streamlined solution where we now submit a form with every report request and he now he stopped putting off the task. And from then on, we have been getting the report on time. And that's it. The same exact story works for those two prompts, but it could also fit a lot of different other questions. Like tell me about a time that you had an interpersonal conflict you had to deal with, or tell me about a time when there was a communication breakdown. Tell me about a time you took charge when your boss was unavailable. Once you have your story toolbox, you can fit these answers every which way. And what I do before every interview is if it's a phone or video interview, I have the title of every story to trickle my memory on the computer screen or paper on the table. If it's an in person interview, I always read all the stories right before I go into the interview to stay fresh. And I bring a notebook in and I bring notes that I sit in front of me. Now I'm just moving about it. I'm not like sitting there reading the answers while talking. But no one does this. And I have notes out and I'm taking notes while I'm in the interview and actually comes off as me being prepared and just giving way more of a hoot than everyone else. If you want every single job search email template, you'll need in your job search. I've got it for you. I have an ebook called Fill in the blank job hunt essential email templates for the job search and it tells you what to say to recruit or hiring manager right after you submit an application online. How to follow up with a company. How to negotiate your salary over email. It has everything. So I will link that book in the description for you to check out. Make sure you like this video and subscribe to this channel. Thanks so much everyone. Why? Why? High five.",
  "segments": [
    {
      "id": 0,
      "text": "Hey everyone, this is self-made millennial."
    },
    {
      "id": 1,
      "text": "I'm Madeline Man."
    },
    {
      "id": 2,
      "text": "Want to know the step-by-step process on how to rock behavioral interview questions?"
    },
    {
      "id": 3,
      "text": "Well, fantastic."
    },
    {
      "id": 4,
      "text": "Because that's what this whole video is about."
    },
    {
      "id": 5,
      "text": "To keep getting interview and career tips from the person who has seen it all from the recruiting"
    },
    {
      "id": 6,
      "text": "side, subscribe to this channel and hit the bell to get a new video every Thursday."
    },
    {
      "id": 7,
      "text": "I'll be teaching you my story toolbox strategy that gets exceptional results."
    },
    {
      "id": 8,
      "text": "I get the most testimonials of fabulous results from this tip, including this fellow who"
    },
    {
      "id": 9,
      "text": "got the job from this advice and being a loyal watcher of my videos."
    },
    {
      "id": 10,
      "text": "Heck yes, thank you so much."
    },
    {
      "id": 11,
      "text": "So I'll give you the steps."
    },
    {
      "id": 12,
      "text": "You'll need to answer behavioral interview questions and I'll give you an example of this"
    },
    {
      "id": 13,
      "text": "in action and stay to the end because I will tell you my trick for remembering all of this"
    },
    {
      "id": 14,
      "text": "information."
    },
    {
      "id": 15,
      "text": "A behavioral interview is a question that starts with something like,"
    },
    {
      "id": 16,
      "text": "tell me about a time when."
    },
    {
      "id": 17,
      "text": "They are asking for examples of things you have done in your past."
    },
    {
      "id": 18,
      "text": "And at the core, they are asking you to tell them a story."
    },
    {
      "id": 19,
      "text": "Stories aren't just for bedtime folks."
    },
    {
      "id": 20,
      "text": "You need to tell stories to be memorable and help them to see themselves working with you."
    },
    {
      "id": 21,
      "text": "This is my favorite type of question to ask when I'm the interviewer because I can better"
    },
    {
      "id": 22,
      "text": "understand the way you think in a probe situation."
    },
    {
      "id": 23,
      "text": "When I ask something like, how do you handle stress?"
    },
    {
      "id": 24,
      "text": "I get a very generic answer."
    },
    {
      "id": 25,
      "text": "But if I ask, tell me about a time you had to complete several projects within a tight deadline."
    },
    {
      "id": 26,
      "text": "I can hear a story and better understand the way that you respond to the world."
    },
    {
      "id": 27,
      "text": "What you need to do first is get notable career moments all written down, which is what I call"
    },
    {
      "id": 28,
      "text": "a story toolbox."
    },
    {
      "id": 29,
      "text": "This will be the basis of all of your answers to behavioral interview questions."
    },
    {
      "id": 30,
      "text": "And when they ask you a question, that's behavioral."
    },
    {
      "id": 31,
      "text": "It will keep you from doing the all."
    },
    {
      "id": 32,
      "text": "Um."
    },
    {
      "id": 33,
      "text": "Um."
    },
    {
      "id": 34,
      "text": "Um."
    },
    {
      "id": 35,
      "text": "What was the question?"
    },
    {
      "id": 36,
      "text": "So take the time to write this all down in a document, such as a time you save the day or solve"
    },
    {
      "id": 37,
      "text": "a big problem, a time when you worked with a difficult person and how you handled it,"
    },
    {
      "id": 38,
      "text": "a time you messed up or failed."
    },
    {
      "id": 39,
      "text": "Put this all down in your story toolbox."
    },
    {
      "id": 40,
      "text": "Now, I have a lot more prompts for you and it's kind of boring for me to list them all out verbally"
    },
    {
      "id": 41,
      "text": "here."
    },
    {
      "id": 42,
      "text": "So I will put a link in the description with a full document of prompts."
    },
    {
      "id": 43,
      "text": "But by the end of this worksheet, you'll have about 10 or even more stories locked and loaded."
    },
    {
      "id": 44,
      "text": "So you need to get that story toolbox filled out before moving onto the next steps."
    },
    {
      "id": 45,
      "text": "And I want to emphasize, you're creating that story toolbox just 10x."
    },
    {
      "id": 46,
      "text": "Your potential to rock the interview."
    },
    {
      "id": 47,
      "text": "I'll link a video that walks through how to use this story toolbox for essentially every interview"
    },
    {
      "id": 48,
      "text": "question."
    },
    {
      "id": 49,
      "text": "Yeah, it's super impactful."
    },
    {
      "id": 50,
      "text": "So you can get that full edgimication on this."
    },
    {
      "id": 51,
      "text": "I will link in the description."
    },
    {
      "id": 52,
      "text": "Okay, now we need to answer the question."
    },
    {
      "id": 53,
      "text": "They may ask something like, tell me about a time you had to deliver a piece of tough"
    },
    {
      "id": 54,
      "text": "feedback."
    },
    {
      "id": 55,
      "text": "If we were to look in the toolbox, I provided you."
    },
    {
      "id": 56,
      "text": "You might start sweating and say, oh god, Madeline, you didn't tell me to write a story about"
    },
    {
      "id": 57,
      "text": "giving feedback."
    },
    {
      "id": 58,
      "text": "What a curve ball."
    },
    {
      "id": 59,
      "text": "Nope, thank for a minute."
    },
    {
      "id": 60,
      "text": "Feedback absolutely played a role in one of your stories."
    },
    {
      "id": 61,
      "text": "Think for a minute and pick one."
    },
    {
      "id": 62,
      "text": "For example, I said that you should have a story or two about a time when you worked with"
    },
    {
      "id": 63,
      "text": "a difficult person and how you handled it."
    },
    {
      "id": 64,
      "text": "I bet there's a great chance you had to deliver some sort of feedback in that story."
    },
    {
      "id": 65,
      "text": "So tell it."
    },
    {
      "id": 66,
      "text": "You will be so pleasantly surprised at how many behavioral questions your preconceived"
    },
    {
      "id": 67,
      "text": "stories will fit."
    },
    {
      "id": 68,
      "text": "Then you answer this in the par method, which is also similar to the star method, but I'd"
    },
    {
      "id": 69,
      "text": "prefer par because it's three steps instead of four concise it's key in the interview."
    },
    {
      "id": 70,
      "text": "So, P stands for problem."
    },
    {
      "id": 71,
      "text": "What is the problem or challenge that was put before you?"
    },
    {
      "id": 72,
      "text": "A is for action."
    },
    {
      "id": 73,
      "text": "What action did you take to attempt to resolve it?"
    },
    {
      "id": 74,
      "text": "And R is the result."
    },
    {
      "id": 75,
      "text": "What were the outcomes of those actions?"
    },
    {
      "id": 76,
      "text": "Let's say we wrote down a story about how we worked with a coworker who was flaky and"
    },
    {
      "id": 77,
      "text": "didn't do things when they said they were going to."
    },
    {
      "id": 78,
      "text": "Here's an example problem."
    },
    {
      "id": 79,
      "text": "I had a coworker who I was depending on for reports, but he would constantly tell me that"
    },
    {
      "id": 80,
      "text": "he wouldn't be able to get it to me in time right when the deadline was about to hit,"
    },
    {
      "id": 81,
      "text": "which impacted my ability to do my job in time."
    },
    {
      "id": 82,
      "text": "Action."
    },
    {
      "id": 83,
      "text": "I respected him, so I took the concern straight to him to talk it through."
    },
    {
      "id": 84,
      "text": "I first showed empathy and said, I can imagine you have so much that you're working"
    },
    {
      "id": 85,
      "text": "on right now and I can tell that you're working hard."
    },
    {
      "id": 86,
      "text": "Then I was direct about how he was affecting me."
    },
    {
      "id": 87,
      "text": "So I said, and I wanted to discuss the past three deadlines that we said that you weren't"
    },
    {
      "id": 88,
      "text": "able to meet."
    },
    {
      "id": 89,
      "text": "When you don't get me the reports on time, it delays the entire production process and"
    },
    {
      "id": 90,
      "text": "leads the rest of us to take several hours to readjust the schedule."
    },
    {
      "id": 91,
      "text": "How can we ensure this doesn't happen in the future?"
    },
    {
      "id": 92,
      "text": "And then finally, you explain the result."
    },
    {
      "id": 93,
      "text": "I was nervous about the conversation, but he opened up to me about how he has always"
    },
    {
      "id": 94,
      "text": "trying to chase down the information for the report."
    },
    {
      "id": 95,
      "text": "And so we came up with a streamlined solution where we now submit a form with every report"
    },
    {
      "id": 96,
      "text": "request and he now he stopped putting off the task."
    },
    {
      "id": 97,
      "text": "And from then on, we have been getting the report on time."
    },
    {
      "id": 98,
      "text": "And that's it."
    },
    {
      "id": 99,
      "text": "The same exact story works for those two prompts, but it could also fit a lot of different"
    },
    {
      "id": 100,
      "text": "other questions."
    },
    {
      "id": 101,
      "text": "Like tell me about a time that you had an interpersonal conflict you had to deal with,"
    },
    {
      "id": 102,
      "text": "or tell me about a time when there was a communication breakdown."
    },
    {
      "id": 103,
      "text": "Tell me about a time you took charge when your boss was unavailable."
    },
    {
      "id": 104,
      "text": "Once you have your story toolbox, you can fit these answers every which way."
    },
    {
      "id": 105,
      "text": "And what I do before every interview is if it's a phone or video interview, I have the title"
    },
    {
      "id": 106,
      "text": "of every story to trickle my memory on the computer screen or paper on the table."
    },
    {
      "id": 107,
      "text": "If it's an in person interview, I always read all the stories right before I go into"
    },
    {
      "id": 108,
      "text": "the interview to stay fresh."
    },
    {
      "id": 109,
      "text": "And I bring a notebook in and I bring notes that I sit in front of me."
    },
    {
      "id": 110,
      "text": "Now I'm just moving about it."
    },
    {
      "id": 111,
      "text": "I'm not like sitting there reading the answers while talking."
    },
    {
      "id": 112,
      "text": "But no one does this."
    },
    {
      "id": 113,
      "text": "And I have notes out and I'm taking notes while I'm in the interview and actually comes"
    },
    {
      "id": 114,
      "text": "off as me being prepared and just giving way more of a hoot than everyone else."
    },
    {
      "id": 115,
      "text": "If you want every single job search email template, you'll need in your job search."
    },
    {
      "id": 116,
      "text": "I've got it for you."
    },
    {
      "id": 117,
      "text": "I have an ebook called Fill in the blank job hunt essential email templates for the"
    },
    {
      "id": 118,
      "text": "job search and it tells you what to say to recruit or hiring manager right after you submit"
    },
    {
      "id": 119,
      "text": "an application online."
    },
    {
      "id": 120,
      "text": "How to follow up with a company."
    },
    {
      "id": 121,
      "text": "How to negotiate your salary over email."
    },
    {
      "id": 122,
      "text": "It has everything."
    },
    {
      "id": 123,
      "text": "So I will link that book in the description for you to check out."
    },
    {
      "id": 124,
      "text": "Make sure you like this video and subscribe to this channel."
    },
    {
      "id": 125,
      "text": "Thanks so much everyone."
    },
    {
      "id": 126,
      "text": "Why?"
    },
    {
      "id": 127,
      "text": "Why?"
    },
    {
      "id": 128,
      "text": "High five."
    }
  ]
}