{
  "file": "J_G1u00nct0.wav",
  "text": " Hello there, my name is Richard McMunn from the Interview Training website, pass my interview.com. And in this tutorial, I will teach you how to write an engineering CV or resume. So if you are applying for any job role with any company or organization in an engineering position, make sure you stay tuned because I promise to help you get hired at the first attempt. And to achieve that goal, this is what I will cover in this training tutorial number one. So I will tell you the six sections to include in your engineering CV or resume. Number two, I will then give you 13 brilliant words to use on your engineering CV or resume or grab the attention of the hiring manager. Number three, I will then give you a brilliant personal statement to use in your engineering CV or resume. The personal statement is one of the most powerful things on your CV or resume. It needs to be impactful, this one is. And then finally, number four, I will tell you where you can instantly download these slides, plus my full set of seven, ready made CV and resume templates for engineers. And just very quickly, if you are new to this channel, please make sure you hit that subscribe button. Literally thousands of you are getting hired and passing your job interviews at the first attempt. I can only help you if you are subscribed and please give the video a thumbs up. Give it a like because that motivates me to create more content for you. Thank you very much indeed. Okay, let's get straight into the tutorial. Let me start by telling you the six sections to include on your engineering CV or resume. Please take notes. You should also make sure your CV or resume is kept to a maximum of three to four pages. You don't need to go any more than that. Okay, so let's have a look at the first page page one of your engineering CV and resume. So right at the very top, you should include your name and contact details. So at the top of your CV or resume include your full name, direct contact number and email address. And here's a really important tip, make sure your answer phone message on your cell phone is professional sounding. Let's assume the hiring manager calls you to invite you along to an interview after they've read your engineering CV or resume. You are not available, it goes through to your answer phone message and it is unprofessional sounding. They might hang up. So make sure your answer phone message is professional sounding. So the name and the contact details at the top of the CV or resume makes it really easy for them to get in touch with you. Then we move on to section one, which is called the personal statement. This is right at the very start of your CV or resume on page one. This is the first thing the hiring manager is going to read about you. Now this should be between 150 to 200 words and it's a brief introduction that summarizes your skills, experience and suitability for the engineering position you have applied for. Don't forget very soon, I'm going to give you a brilliant example personal statement for engineers. It's a brilliant one. I can't wait to give it to you. So your name and contact details at the top of page one and then your personal statement. And then we move on to the second page of your engineering CV or resume. Section two is your education history and qualifications. Here you will detail the schools, colleges or universities you attended, the subjects you studied and the qualifications and grades you attained. So just list them in chronological order and put them in list, strong bullet point format because it's then easy for them to read. And then section three is your relevant experience and work history. So this is details of the places you have worked as an engineer or otherwise. The main duties you had at each company and the key achievements at each place. So we put down the key achievements because we want to demonstrate to the hiring manager that we have a track record of success. So that's the second page of our engineering CV or resume. Then we move on to page three. This is section four which is training courses you have completed and then he continuous professional development activities you have undertaken. So in section four, list of training courses you have completed accreditation achieved as an engineer and also details of any CPD activities. CPD is continuous professional development and then section five is hobbies and interests. So just give a brief outline of your interest and activities outside of work. If you can give anything that shows that you focus on self development, that's a good thing. Playing team sports, keeping yourself fit and active, those are good things to include also. So be very careful with the hobbies and the interest you include on your engineering CV and resume and then finally page three. And finally page four, we're going to put down two references. Now references are the names and contact details of two people who will vouch for your competence as an engineer and your suitability for the position. Some people on their CV or resume put down references available upon request. That's weak. It's lazy. Get two people ask them for permission to put them down as references and then include their names and contact details. Because the hiring manager might ring them up and say, what do you think of this person as an engineer for my company? And if the references say, yep, they're really good. They're efficient, they're competent and they are effective as an engineer. Then they're more likely to invite you along to and interview. And then finally, again, include your contact details. We include them on the first page of the CV or resume and then we include them at the bottom again. So we're making it super easy for the hiring manager to contact you. So at the bottom again, include your direct contact number and your email address. Okay, so that's how to structure your engineering CV and resume. Very soon, I'm going to actually show you. I'm going to walk through a template with you. An engineering CV and resume template. I will then tell you where you can download it. But first of all, let me give you those 13 powerful words you can use on your engineering CV or resume. Now, these are also great words to use at your interview. So once you get invited along to your engineering interview, you can use these 13 words during the interview too. So take note of them. Now, I have left the 13th word until last, the best one. That's the one in the middle. It's the most important. But these are all fantastic ones too. Here we go. You can say that you're commercially driven. This means that you understand how your work as an engineer impacts the organisation. You can say I am a commercially driven engineer. I understand how my work has to positively impact the organisation's mission and vision. The second word is innovation. You can say that you are an innovative engineer. So this means as an engineer, you have the ability to make things easier, more efficient or faster. You can use the word critical thinking. This means you analyze data and information to make the right engineering decisions. You can also use the word decisive. This means that you make effective decisions as an engineer that are in the best interests of safety and the organisation as a whole. You can say that you have the right technical knowledge. You possess the knowledge needed to be effective as an engineer. And you take control of your ongoing professional development so that your qualifications, your knowledge and your expertise are at the cutting edge of the industry. You can also use the word communicator. Now engineers need to be good communicators. You can say you are able to communicate your engineering ideas and concepts in easy to understand language. The other word you can use is cost conscious. This is a really good one. When creating an engineering CV or resume, you can say your engineering work is focused on delivering value for money. Industrialists are great word for engineering CVs and resumes. This means you work hard or diligent and focused. You can say your results driven. This means your work as an engineer is focused on achieving results for the company team or department. Attention to detail is another really important word to use on an engineering CV or resume. So you can say your work as an engineer is accurate, concise and error free. Resilient is another really strong word to use on your engineering CV or resume. This means that you are able to overcome challenges on a daily basis to achieve your engineering goals. Or 12 word is interpersonal skills. Interpersonal skills are needed as engineers. This means that you can collaborate with anyone and easily fit into an engineering team. And the top word that you should always use both on your engineering CV and resume and also at your interview is safety focused. So everything you do as an engineer has safety as the primary focus. Okay, so there's 13 words you can use on your engineering CV or resume and also at your forthcoming interview. So let me now give you a 200 word engineering CV and resume personal statement. Don't forget the personal statement goes on section one right at the very start of your CV or resume. The first thing that the hiring manager is going to read. And approximately 200 word brief introduction summarizes your skills. Experience and suitability for the engineering position you have applied for. Here it is. I am a knowledgeable, competent, decisive and innovative engineer who understands the importance of safety, leadership and collaborative working in this position. I possess the relevant skills, knowledge, qualifications and experience to help drive the company forward and achieve its engineering goals. In recent years, I developed a diverse set of skills and qualities that will enable me to have an immediate and positive impact in this engineering position. And assist the management team in achieving their commercial and operational objectives. In addition to being a higher cheever and strong collaborator who can fit seamlessly into any team, I am renowned for my analytical, critical and problem solving capabilities. Notable achievements in my engineering career to date include, successfully completing time-sensitive engineering projects with strict budgetary requirements, assisting organizations in the development of engineering operational procedures and safety protocols, collaborating with internal departments to assess company engineering needs and improving efficiency and effectiveness of engineering related machinery and resources. Further details of my engineering experience, work history, education, qualifications and references are provided within this CV stroke resume for your kind consideration. That is a powerful impactful personal statement for engineers to go right at the very start of your CV and resume. Don't forget, soon I will tell you where you can download this and my seven ready-made templates. But first of all, let me teach you how to structure your engineering CV or resume in a word document. Here we go. Okay, so let's now work through my ready-made engineering CV and resume template in a word document. So right at the very top of your CV or resume include your name, your contact number and your email address. And to make it really easy for the hiring manager to contact us. And then sexual one is the personal statement. You can see that I have put the personal statement right across the first page is the first thing they are going to read. And it is impactful. It uses lots of those 13 powerful words. I just gave you in the tutorial and I've also put it in a box to make it easier for them to read. Let me quickly read that personal statement again for you. I am a knowledgeable, competent, decisive and innovative engineer who understands the importance of safety, leadership and collaborative working in this position. I possess the relevant skills, knowledge, qualifications and experience to help drive the company forward and achieve its engineering goals. For recent years, I have developed a diverse set of skills and qualities that will enable me to have an immediate and positive impact in this engineering position. And assist the management team and achieving their commercial and operational objectives. In addition to being a higher cheever and strong collaborator who can fit seamlessly into any team, I am renowned for my analytical, critical and problem solving capabilities. I have a great experience in my engineering career to date include successfully completing time, sensitive engineering projects with strict budgetary requirements, assisting organisations in the development of engineering operational procedures and safety protocols, collaborating with internal departments to assess company engineering needs and improving efficiency and effectiveness of engineering related machinery and resources. For the details of my engineering experience, work history, education, qualifications and references are provided within this CV, stroke, resume for your kind consideration. So you can see there that I again in the box I have put the notable achievements you can put these in bullet point format because they can scan through them read them to see how you are going to add value to their organisation as an engineer. Now, we come on to the second page and here you will put your education history, name of the school, college or university you attended under dates, the subjects that you studied under qualifications and grades attained. Work experience, name of the company that you worked at, the date to and from put them in chronological order with the most recent first, a brief outline of your main responsibilities and duties as an engineer in each position and the key achievements you have gained are you gained while working for the company. And another box, the training courses completed and CPD activities continuous professional development this tells the hiring manager that you are passionate about your continuous development and your skills and knowledge, your kept up to date. Then your hobbies and interests, good ones to include on studying self development courses, reading self development books, physical fitness activities, charity work or volunteering and then again the references, the name, the position and contact details of two people and finally your own contact details at the end. Now, this is two pages, this engineering CV and resume template in a word document is two pages but as you include your details in the education, work experience and the other sections it will expand to three maybe four pages. Don't forget, don't go any more than four pages. Let me now tell you where you can download everything. So the next thing to do is click that link right now in the top right hand corner of the video head straight through to my website, passmaintevue.com and you can download these slides plus my seven resume and CV ready made templates in word documents that you can use for your engineering job application. Make sure you check out that link. It's a fantastic resource. You can have it in your inbox literally within two minutes from now. Also, don't forget to hit that subscribe button. Please give the video a like. I really do appreciate your support and you can also connect with me on LinkedIn. I have put my LinkedIn link in the description below the video. It's always a pleasure and on a to connect with like minded professional such as yourself. Thank you for watching and wish you all the very best in your pursuit to getting hired as an engineer. Have a great day.",
  "segments": [
    {
      "id": 0,
      "text": "Hello there, my name is Richard McMunn from the Interview Training website, pass my interview.com."
    },
    {
      "id": 1,
      "text": "And in this tutorial, I will teach you how to write an engineering CV or resume."
    },
    {
      "id": 2,
      "text": "So if you are applying for any job role with any company or organization in an engineering position,"
    },
    {
      "id": 3,
      "text": "make sure you stay tuned because I promise to help you get hired at the first attempt."
    },
    {
      "id": 4,
      "text": "And to achieve that goal, this is what I will cover in this training tutorial number one."
    },
    {
      "id": 5,
      "text": "So I will tell you the six sections to include in your engineering CV or resume."
    },
    {
      "id": 6,
      "text": "Number two, I will then give you 13 brilliant words to use on your engineering CV or resume"
    },
    {
      "id": 7,
      "text": "or grab the attention of the hiring manager."
    },
    {
      "id": 8,
      "text": "Number three, I will then give you a brilliant personal statement to use in your engineering CV or resume."
    },
    {
      "id": 9,
      "text": "The personal statement is one of the most powerful things on your CV or resume."
    },
    {
      "id": 10,
      "text": "It needs to be impactful, this one is."
    },
    {
      "id": 11,
      "text": "And then finally, number four, I will tell you where you can instantly download these slides,"
    },
    {
      "id": 12,
      "text": "plus my full set of seven, ready made CV and resume templates for engineers."
    },
    {
      "id": 13,
      "text": "And just very quickly, if you are new to this channel, please make sure you hit that subscribe button."
    },
    {
      "id": 14,
      "text": "Literally thousands of you are getting hired and passing your job interviews at the first attempt."
    },
    {
      "id": 15,
      "text": "I can only help you if you are subscribed and please give the video a thumbs up."
    },
    {
      "id": 16,
      "text": "Give it a like because that motivates me to create more content for you."
    },
    {
      "id": 17,
      "text": "Thank you very much indeed."
    },
    {
      "id": 18,
      "text": "Okay, let's get straight into the tutorial."
    },
    {
      "id": 19,
      "text": "Let me start by telling you the six sections to include on your engineering CV or resume."
    },
    {
      "id": 20,
      "text": "Please take notes."
    },
    {
      "id": 21,
      "text": "You should also make sure your CV or resume is kept to a maximum of three to four pages."
    },
    {
      "id": 22,
      "text": "You don't need to go any more than that."
    },
    {
      "id": 23,
      "text": "Okay, so let's have a look at the first page page one of your engineering CV and resume."
    },
    {
      "id": 24,
      "text": "So right at the very top, you should include your name and contact details."
    },
    {
      "id": 25,
      "text": "So at the top of your CV or resume include your full name, direct contact number and email address."
    },
    {
      "id": 26,
      "text": "And here's a really important tip, make sure your answer phone message on your cell phone is professional sounding."
    },
    {
      "id": 27,
      "text": "Let's assume the hiring manager calls you to invite you along to an interview after they've read your engineering CV or resume."
    },
    {
      "id": 28,
      "text": "You are not available, it goes through to your answer phone message and it is unprofessional sounding."
    },
    {
      "id": 29,
      "text": "They might hang up."
    },
    {
      "id": 30,
      "text": "So make sure your answer phone message is professional sounding."
    },
    {
      "id": 31,
      "text": "So the name and the contact details at the top of the CV or resume makes it really easy for them to get in touch with you."
    },
    {
      "id": 32,
      "text": "Then we move on to section one, which is called the personal statement."
    },
    {
      "id": 33,
      "text": "This is right at the very start of your CV or resume on page one."
    },
    {
      "id": 34,
      "text": "This is the first thing the hiring manager is going to read about you."
    },
    {
      "id": 35,
      "text": "Now this should be between 150 to 200 words and it's a brief introduction that summarizes your skills, experience and suitability for the engineering position you have applied for."
    },
    {
      "id": 36,
      "text": "Don't forget very soon, I'm going to give you a brilliant example personal statement for engineers."
    },
    {
      "id": 37,
      "text": "It's a brilliant one. I can't wait to give it to you."
    },
    {
      "id": 38,
      "text": "So your name and contact details at the top of page one and then your personal statement."
    },
    {
      "id": 39,
      "text": "And then we move on to the second page of your engineering CV or resume."
    },
    {
      "id": 40,
      "text": "Section two is your education history and qualifications."
    },
    {
      "id": 41,
      "text": "Here you will detail the schools, colleges or universities you attended, the subjects you studied and the qualifications and grades you attained."
    },
    {
      "id": 42,
      "text": "So just list them in chronological order and put them in list, strong bullet point format because it's then easy for them to read."
    },
    {
      "id": 43,
      "text": "And then section three is your relevant experience and work history."
    },
    {
      "id": 44,
      "text": "So this is details of the places you have worked as an engineer or otherwise."
    },
    {
      "id": 45,
      "text": "The main duties you had at each company and the key achievements at each place."
    },
    {
      "id": 46,
      "text": "So we put down the key achievements because we want to demonstrate to the hiring manager that we have a track record of success."
    },
    {
      "id": 47,
      "text": "So that's the second page of our engineering CV or resume. Then we move on to page three."
    },
    {
      "id": 48,
      "text": "This is section four which is training courses you have completed and then he continuous professional development activities you have undertaken."
    },
    {
      "id": 49,
      "text": "So in section four, list of training courses you have completed accreditation achieved as an engineer and also details of any CPD activities."
    },
    {
      "id": 50,
      "text": "CPD is continuous professional development and then section five is hobbies and interests."
    },
    {
      "id": 51,
      "text": "So just give a brief outline of your interest and activities outside of work."
    },
    {
      "id": 52,
      "text": "If you can give anything that shows that you focus on self development, that's a good thing."
    },
    {
      "id": 53,
      "text": "Playing team sports, keeping yourself fit and active, those are good things to include also."
    },
    {
      "id": 54,
      "text": "So be very careful with the hobbies and the interest you include on your engineering CV and resume and then finally page three."
    },
    {
      "id": 55,
      "text": "And finally page four, we're going to put down two references."
    },
    {
      "id": 56,
      "text": "Now references are the names and contact details of two people who will vouch for your competence as an engineer and your suitability for the position."
    },
    {
      "id": 57,
      "text": "Some people on their CV or resume put down references available upon request."
    },
    {
      "id": 58,
      "text": "That's weak. It's lazy."
    },
    {
      "id": 59,
      "text": "Get two people ask them for permission to put them down as references and then include their names and contact details."
    },
    {
      "id": 60,
      "text": "Because the hiring manager might ring them up and say, what do you think of this person as an engineer for my company?"
    },
    {
      "id": 61,
      "text": "And if the references say, yep, they're really good. They're efficient, they're competent and they are effective as an engineer."
    },
    {
      "id": 62,
      "text": "Then they're more likely to invite you along to and interview."
    },
    {
      "id": 63,
      "text": "And then finally, again, include your contact details."
    },
    {
      "id": 64,
      "text": "We include them on the first page of the CV or resume and then we include them at the bottom again."
    },
    {
      "id": 65,
      "text": "So we're making it super easy for the hiring manager to contact you."
    },
    {
      "id": 66,
      "text": "So at the bottom again, include your direct contact number and your email address."
    },
    {
      "id": 67,
      "text": "Okay, so that's how to structure your engineering CV and resume."
    },
    {
      "id": 68,
      "text": "Very soon, I'm going to actually show you. I'm going to walk through a template with you."
    },
    {
      "id": 69,
      "text": "An engineering CV and resume template. I will then tell you where you can download it."
    },
    {
      "id": 70,
      "text": "But first of all, let me give you those 13 powerful words you can use on your engineering CV or resume."
    },
    {
      "id": 71,
      "text": "Now, these are also great words to use at your interview."
    },
    {
      "id": 72,
      "text": "So once you get invited along to your engineering interview, you can use these 13 words during the interview too."
    },
    {
      "id": 73,
      "text": "So take note of them. Now, I have left the 13th word until last, the best one."
    },
    {
      "id": 74,
      "text": "That's the one in the middle. It's the most important. But these are all fantastic ones too. Here we go."
    },
    {
      "id": 75,
      "text": "You can say that you're commercially driven. This means that you understand how your work as an engineer impacts the organisation."
    },
    {
      "id": 76,
      "text": "You can say I am a commercially driven engineer. I understand how my work has to positively impact the organisation's mission and vision."
    },
    {
      "id": 77,
      "text": "The second word is innovation. You can say that you are an innovative engineer."
    },
    {
      "id": 78,
      "text": "So this means as an engineer, you have the ability to make things easier, more efficient or faster."
    },
    {
      "id": 79,
      "text": "You can use the word critical thinking. This means you analyze data and information to make the right engineering decisions."
    },
    {
      "id": 80,
      "text": "You can also use the word decisive. This means that you make effective decisions as an engineer that are in the best interests of safety and the organisation as a whole."
    },
    {
      "id": 81,
      "text": "You can say that you have the right technical knowledge. You possess the knowledge needed to be effective as an engineer."
    },
    {
      "id": 82,
      "text": "And you take control of your ongoing professional development so that your qualifications, your knowledge and your expertise are at the cutting edge of the industry."
    },
    {
      "id": 83,
      "text": "You can also use the word communicator. Now engineers need to be good communicators."
    },
    {
      "id": 84,
      "text": "You can say you are able to communicate your engineering ideas and concepts in easy to understand language."
    },
    {
      "id": 85,
      "text": "The other word you can use is cost conscious. This is a really good one."
    },
    {
      "id": 86,
      "text": "When creating an engineering CV or resume, you can say your engineering work is focused on delivering value for money."
    },
    {
      "id": 87,
      "text": "Industrialists are great word for engineering CVs and resumes. This means you work hard or diligent and focused. You can say your results driven."
    },
    {
      "id": 88,
      "text": "This means your work as an engineer is focused on achieving results for the company team or department."
    },
    {
      "id": 89,
      "text": "Attention to detail is another really important word to use on an engineering CV or resume."
    },
    {
      "id": 90,
      "text": "So you can say your work as an engineer is accurate, concise and error free."
    },
    {
      "id": 91,
      "text": "Resilient is another really strong word to use on your engineering CV or resume. This means that you are able to overcome challenges on a daily basis to achieve your engineering goals."
    },
    {
      "id": 92,
      "text": "Or 12 word is interpersonal skills. Interpersonal skills are needed as engineers. This means that you can collaborate with anyone and easily fit into an engineering team."
    },
    {
      "id": 93,
      "text": "And the top word that you should always use both on your engineering CV and resume and also at your interview is safety focused."
    },
    {
      "id": 94,
      "text": "So everything you do as an engineer has safety as the primary focus."
    },
    {
      "id": 95,
      "text": "Okay, so there's 13 words you can use on your engineering CV or resume and also at your forthcoming interview."
    },
    {
      "id": 96,
      "text": "So let me now give you a 200 word engineering CV and resume personal statement. Don't forget the personal statement goes on section one right at the very start of your CV or resume. The first thing that the hiring manager is going to read."
    },
    {
      "id": 97,
      "text": "And approximately 200 word brief introduction summarizes your skills. Experience and suitability for the engineering position you have applied for. Here it is."
    },
    {
      "id": 98,
      "text": "I am a knowledgeable, competent, decisive and innovative engineer who understands the importance of safety, leadership and collaborative working in this position."
    },
    {
      "id": 99,
      "text": "I possess the relevant skills, knowledge, qualifications and experience to help drive the company forward and achieve its engineering goals."
    },
    {
      "id": 100,
      "text": "In recent years, I developed a diverse set of skills and qualities that will enable me to have an immediate and positive impact in this engineering position."
    },
    {
      "id": 101,
      "text": "And assist the management team in achieving their commercial and operational objectives."
    },
    {
      "id": 102,
      "text": "In addition to being a higher cheever and strong collaborator who can fit seamlessly into any team, I am renowned for my analytical, critical and problem solving capabilities."
    },
    {
      "id": 103,
      "text": "Notable achievements in my engineering career to date include, successfully completing time-sensitive engineering projects with strict budgetary requirements, assisting organizations in the development of engineering operational procedures and safety protocols, collaborating with internal departments to assess company engineering needs and improving efficiency and effectiveness of engineering related machinery and resources."
    },
    {
      "id": 104,
      "text": "Further details of my engineering experience, work history, education, qualifications and references are provided within this CV stroke resume for your kind consideration."
    },
    {
      "id": 105,
      "text": "That is a powerful impactful personal statement for engineers to go right at the very start of your CV and resume. Don't forget, soon I will tell you where you can download this and my seven ready-made templates."
    },
    {
      "id": 106,
      "text": "But first of all, let me teach you how to structure your engineering CV or resume in a word document. Here we go."
    },
    {
      "id": 107,
      "text": "Okay, so let's now work through my ready-made engineering CV and resume template in a word document. So right at the very top of your CV or resume include your name, your contact number and your email address."
    },
    {
      "id": 108,
      "text": "And to make it really easy for the hiring manager to contact us. And then sexual one is the personal statement. You can see that I have put the personal statement right across the first page is the first thing they are going to read."
    },
    {
      "id": 109,
      "text": "And it is impactful. It uses lots of those 13 powerful words. I just gave you in the tutorial and I've also put it in a box to make it easier for them to read. Let me quickly read that personal statement again for you."
    },
    {
      "id": 110,
      "text": "I am a knowledgeable, competent, decisive and innovative engineer who understands the importance of safety, leadership and collaborative working in this position."
    },
    {
      "id": 111,
      "text": "I possess the relevant skills, knowledge, qualifications and experience to help drive the company forward and achieve its engineering goals."
    },
    {
      "id": 112,
      "text": "For recent years, I have developed a diverse set of skills and qualities that will enable me to have an immediate and positive impact in this engineering position."
    },
    {
      "id": 113,
      "text": "And assist the management team and achieving their commercial and operational objectives."
    },
    {
      "id": 114,
      "text": "In addition to being a higher cheever and strong collaborator who can fit seamlessly into any team, I am renowned for my analytical, critical and problem solving capabilities."
    },
    {
      "id": 115,
      "text": "I have a great experience in my engineering career to date include successfully completing time, sensitive engineering projects with strict budgetary requirements, assisting organisations in the development of engineering operational procedures and safety protocols,"
    },
    {
      "id": 116,
      "text": "collaborating with internal departments to assess company engineering needs and improving efficiency and effectiveness of engineering related machinery and resources."
    },
    {
      "id": 117,
      "text": "For the details of my engineering experience, work history, education, qualifications and references are provided within this CV, stroke, resume for your kind consideration."
    },
    {
      "id": 118,
      "text": "So you can see there that I again in the box I have put the notable achievements you can put these in bullet point format because they can scan through them read them to see how you are going to add value to their organisation as an engineer."
    },
    {
      "id": 119,
      "text": "Now, we come on to the second page and here you will put your education history, name of the school, college or university you attended under dates, the subjects that you studied under qualifications and grades attained."
    },
    {
      "id": 120,
      "text": "Work experience, name of the company that you worked at, the date to and from put them in chronological order with the most recent first, a brief outline of your main responsibilities and duties as an engineer in each position and the key achievements you have gained are you gained while working for the company."
    },
    {
      "id": 121,
      "text": "And another box, the training courses completed and CPD activities continuous professional development this tells the hiring manager that you are passionate about your continuous development and your skills and knowledge, your kept up to date."
    },
    {
      "id": 122,
      "text": "Then your hobbies and interests, good ones to include on studying self development courses, reading self development books, physical fitness activities, charity work or volunteering and then again the references, the name, the position and contact details of two people and finally your own contact details at the end."
    },
    {
      "id": 123,
      "text": "Now, this is two pages, this engineering CV and resume template in a word document is two pages but as you include your details in the education, work experience and the other sections it will expand to three maybe four pages."
    },
    {
      "id": 124,
      "text": "Don't forget, don't go any more than four pages. Let me now tell you where you can download everything."
    },
    {
      "id": 125,
      "text": "So the next thing to do is click that link right now in the top right hand corner of the video head straight through to my website, passmaintevue.com and you can download these slides plus my seven resume and CV ready made templates in word documents that you can use for your engineering job application."
    },
    {
      "id": 126,
      "text": "Make sure you check out that link. It's a fantastic resource. You can have it in your inbox literally within two minutes from now. Also, don't forget to hit that subscribe button. Please give the video a like. I really do appreciate your support and you can also connect with me on LinkedIn. I have put my LinkedIn link in the description below the video. It's always a pleasure and on a to connect with like minded professional such as yourself. Thank you for watching and wish you all the very best in your pursuit to getting hired as an engineer. Have a great day."
    }
  ]
}