{
  "file": "jhH2whyQr3Q.wav",
  "text": " In this next very important job interview training tutorial, I will teach you how to answer behavioral interview questions. Now behavioral interview questions are being used more often in job interviews because they give the hiring manager the chance to really get to understand a candidate's approach to work and how they have dealt with previous situations. Your answers to behavioral interview questions will be vital to your success at the job interview. Therefore, if you have an interview coming up soon for any role or company, make sure you stay tuned because I will help you pass at the very first attempt. And just very quickly, if you are new to my channel, please make sure you hit that subscribe button. Literally thousands of you are passing your job interviews at the very first attempt. I can only help you if you are subscribed. Please give the video a like because that really does motivate me to create more content for you. Thank you very much indeed. Okay, let's jump straight into the tutorial. So to help you pass your interview at the very first attempt, I will cover the following three things during this tutorial. Number one, I will give you a brilliant, tried and tested structure to use when answering behavioral interview questions that is recognized by all hiring managers. Now this structure will ensure you get the highest scores possible. Number two, I will then give you six behavioral interview questions to prepare for. Now these six questions come up all the time during job interviews and you must prepare great answers to pass. And then finally, number three, I will give you an example answer to each of those six behavioral interview questions before telling you where you can download the answers. So to begin with, let me tell you that best tried and tested structure to use when answering behavioral interview questions. Now my advice is to use a star technique, STAR to structure your answers to difficult behavioral interview questions. Now start techniques stands for situation, task, action and result. So you begin your answer and outline the situation you were faced with. You then give brief details about the task that needed doing. You then give in depth details about the action you took before finishing off your answer with the result following your actions. Okay, let me now give you six common behavioral interview questions and top scoring examples answer that you to use a star technique and I will then tell you where you can download all the answers here we go. Behavioral interview question number one, tell me about your time you had to overcome a difficult problem. Here's my example answer that you use is a star technique. I was at work one day when a client called to complain about a project a coworker had delivered for them. Unfortunately my coworker was on leave so I was unable to pass on the complaint to them. It was my task to listen to the client, get an understanding of the problem and decide what to do at moving forward. The client explained that the standard of work was not what they expected and even though the project had been delivered on time they were dissatisfied. After careful consideration I decided to take on the project myself and redo the work to the client's expected standard. I took this decision because the company's reputation was at risk and I did not want the client to be unhappy. After two days working on the project I redelivert the project and the client was more than satisfied. I then spoke to my coworker about the complaint when they returned to work and they thanked me for resolving the problem on their behalf. Behavioral interview question number two, describe a time when you disagreed with a team member, how did you resolve the situation? Here's my example answer. A coworker and I were tasked with updating the company's website. We both disagreed on the best way to update it. I suggested we keep the website professional looking simple and easy to navigate, whereas my coworker wanted to make it more colorful with lots of pages and blog focused. My task was to find an amicable way forward that was in the company's best interest on one that enabled us to collaborate on the project without conflict. After listening to my coworker's ideas and putting forward my own, I suggested we create two versions of the website and run a test to see which one had the most visitors, engagement and sales conversions. By using this approach, we could test both ideas and the company would get the best results possible. My coworker agreed this was a great idea. After creating two versions of the website and running comprehensive testing, my idea yielded the most substantial returns for the company. Behavioral interview question number three, describe a situation when you delivered excellent customer service. Here's my example answer that uses a start technique. A customer came into the store one morning to pay for a product they had seen listed on our website. When I went to retrieve the product from our store, it had sold out. Understandably, the customer was Irate. It was my responsibility to resolve the situation and put things right for the customer. I immediately apologized. I would feel the same if the situation had happened to me and then investigated or online inventory system to see what had gone wrong. The system had incorrectly allocated the product to our shop. In fact, it was located at our main distribution center. I contacted the distribution manager and requested he dispatch the product immediately to the customer's home address on a 24-hour urgent delivery notice. I then asked my store manager for permission to give the customer a 50% refund due to the inconvenience caused to which he agreed. After apologizing to the customer again and informing her of my actions, she thanked me for my prompt action and excellent customer service skills. Finally, I contacted our IT department and asked them to ensure the same system error never happened again. Behavioral interview question number four. Tell me about the time when you worked under pressure. Here's my example answer. In my last role, my manager asked me to take up the duties of a coworker who had to take a leave of absence due to personal reasons. I was already working on a time-sensitive task of my own, but I agreed to do the additional work requested. It was my task to reprioritize my workload to include the additional tasks and get everything finished on time. I created a new list of all my responsibilities and used a colour coded system to determine which tasks should be completed first. Hip-tasked were urgent and the tasks came second and green tasks last. I then blocked out my diary, rescheduled several appointments and set to work. By being highly organised, methodical when prioritizing tasks and utilizing my time carefully, I was able to get all my duties completed to an exceptional standard. Behavioral interview question number five. Tell me about a time when you disagreed with a supervisor. This is a really difficult question to answer correctly. Here's my example response that uses a start technique. My supervisor wanted to launch a new company product by advertising in local stores and supermarkets. I didn't feel this was the best way to get the greatest return from the launch. I felt it was important to disagree with my supervisor and explain in a professional manner the reasons why. I spoke to my supervisor in private and said that my research showed we could potentially get a greater return from our product launch by allocating all of the budget to online adverts including Facebook and Instagram. By using this method we could target a specific audience based on age, gender and interests. I supervise it was intrigued by my suggestion and she agreed to trial 50% of the budget to online advertising for one week. Now after the one week trial was over, the online advertising had yielded a far greater return and my supervisor decided to allocate 100% of the budget to this new method. Behavioral interview question number six. Tell me about a time when you made a mistake. Here's my example answer. When I started working my first job, my supervisor asked for a volunteer to go and work the following week in a different department because one of their key workers was off sick. I volunteered. I saw this as an opportunity for me to learn more about the company and diversify my skills. Unfortunately, I failed to write down the change of department in my diary and when the following week arrived, the head of department complained to my manager that I had not turned up. I felt awful and embarrassed because I had let my manager and the other department down. I immediately apologized and rushed over to the new department to commence my work. I learned a lot from that mistake. I now make sure I place all appointments and responsibilities in my paper diary, are my smart phone too, so they are never missed. Now the next thing to do is you want to accelerate your learning even further. Please click that link right now in the top right hand corner of the video, head straight through to my website, passmaintoview.com and you can instantly download those six answers I just gave you. Plus, an additional 27 tell me about a time, behavioral interview questions and top scoring example answers. This guide will help you be the competition at your forthcoming interview. Make sure you check it out. Also, please make sure you hit that subscribe button. Literally thousands of you are passing your interviews at the very first attempt. I can only help you if you are subscribed please give the video a like because that really does motivate me to create more content for you and don't forget to connect with me on LinkedIn. I have put my LinkedIn link in the description below the video. It's always a pleasure to connect with like-minded professionals such as yourself. Thank you so much for watching and I wish you all the best for passing your job interview have a great day.",
  "segments": [
    {
      "id": 0,
      "text": "In this next very important job interview training tutorial, I will teach you how to answer"
    },
    {
      "id": 1,
      "text": "behavioral interview questions."
    },
    {
      "id": 2,
      "text": "Now behavioral interview questions are being used more often in job interviews because"
    },
    {
      "id": 3,
      "text": "they give the hiring manager the chance to really get to understand a candidate's approach"
    },
    {
      "id": 4,
      "text": "to work and how they have dealt with previous situations."
    },
    {
      "id": 5,
      "text": "Your answers to behavioral interview questions will be vital to your success at the job"
    },
    {
      "id": 6,
      "text": "interview."
    },
    {
      "id": 7,
      "text": "Therefore, if you have an interview coming up soon for any role or company, make sure you stay tuned"
    },
    {
      "id": 8,
      "text": "because I will help you pass at the very first attempt."
    },
    {
      "id": 9,
      "text": "And just very quickly, if you are new to my channel, please make sure you hit that subscribe"
    },
    {
      "id": 10,
      "text": "button."
    },
    {
      "id": 11,
      "text": "Literally thousands of you are passing your job interviews at the very first attempt."
    },
    {
      "id": 12,
      "text": "I can only help you if you are subscribed."
    },
    {
      "id": 13,
      "text": "Please give the video a like because that really does motivate me to create more content"
    },
    {
      "id": 14,
      "text": "for you."
    },
    {
      "id": 15,
      "text": "Thank you very much indeed."
    },
    {
      "id": 16,
      "text": "Okay, let's jump straight into the tutorial."
    },
    {
      "id": 17,
      "text": "So to help you pass your interview at the very first attempt, I will cover the following"
    },
    {
      "id": 18,
      "text": "three things during this tutorial."
    },
    {
      "id": 19,
      "text": "Number one, I will give you a brilliant, tried and tested structure to use when answering"
    },
    {
      "id": 20,
      "text": "behavioral interview questions that is recognized by all hiring managers."
    },
    {
      "id": 21,
      "text": "Now this structure will ensure you get the highest scores possible."
    },
    {
      "id": 22,
      "text": "Number two, I will then give you six behavioral interview questions to prepare for."
    },
    {
      "id": 23,
      "text": "Now these six questions come up all the time during job interviews and you must prepare"
    },
    {
      "id": 24,
      "text": "great answers to pass."
    },
    {
      "id": 25,
      "text": "And then finally, number three, I will give you an example answer to each of those six"
    },
    {
      "id": 26,
      "text": "behavioral interview questions before telling you where you can download the answers."
    },
    {
      "id": 27,
      "text": "So to begin with, let me tell you that best tried and tested structure to use when answering"
    },
    {
      "id": 28,
      "text": "behavioral interview questions."
    },
    {
      "id": 29,
      "text": "Now my advice is to use a star technique, STAR to structure your answers to difficult"
    },
    {
      "id": 30,
      "text": "behavioral interview questions."
    },
    {
      "id": 31,
      "text": "Now start techniques stands for situation, task, action and result."
    },
    {
      "id": 32,
      "text": "So you begin your answer and outline the situation you were faced with."
    },
    {
      "id": 33,
      "text": "You then give brief details about the task that needed doing."
    },
    {
      "id": 34,
      "text": "You then give in depth details about the action you took before finishing off your answer"
    },
    {
      "id": 35,
      "text": "with the result following your actions."
    },
    {
      "id": 36,
      "text": "Okay, let me now give you six common behavioral interview questions and top scoring"
    },
    {
      "id": 37,
      "text": "examples answer that you to use a star technique and I will then tell you where you can"
    },
    {
      "id": 38,
      "text": "download all the answers here we go."
    },
    {
      "id": 39,
      "text": "Behavioral interview question number one, tell me about your time you had to overcome"
    },
    {
      "id": 40,
      "text": "a difficult problem."
    },
    {
      "id": 41,
      "text": "Here's my example answer that you use is a star technique."
    },
    {
      "id": 42,
      "text": "I was at work one day when a client called to complain about a project a coworker had delivered"
    },
    {
      "id": 43,
      "text": "for them."
    },
    {
      "id": 44,
      "text": "Unfortunately my coworker was on leave so I was unable to pass on the complaint to them."
    },
    {
      "id": 45,
      "text": "It was my task to listen to the client, get an understanding of the problem and decide"
    },
    {
      "id": 46,
      "text": "what to do at moving forward."
    },
    {
      "id": 47,
      "text": "The client explained that the standard of work was not what they expected and even though"
    },
    {
      "id": 48,
      "text": "the project had been delivered on time they were dissatisfied."
    },
    {
      "id": 49,
      "text": "After careful consideration I decided to take on the project myself and redo the work"
    },
    {
      "id": 50,
      "text": "to the client's expected standard."
    },
    {
      "id": 51,
      "text": "I took this decision because the company's reputation was at risk and I did not want"
    },
    {
      "id": 52,
      "text": "the client to be unhappy."
    },
    {
      "id": 53,
      "text": "After two days working on the project I redelivert the project and the client was more"
    },
    {
      "id": 54,
      "text": "than satisfied."
    },
    {
      "id": 55,
      "text": "I then spoke to my coworker about the complaint when they returned to work and they"
    },
    {
      "id": 56,
      "text": "thanked me for resolving the problem on their behalf."
    },
    {
      "id": 57,
      "text": "Behavioral interview question number two, describe a time when you"
    },
    {
      "id": 58,
      "text": "disagreed with a team member, how did you resolve the situation?"
    },
    {
      "id": 59,
      "text": "Here's my example answer."
    },
    {
      "id": 60,
      "text": "A coworker and I were tasked with updating the company's website."
    },
    {
      "id": 61,
      "text": "We both disagreed on the best way to update it."
    },
    {
      "id": 62,
      "text": "I suggested we keep the website professional looking simple and easy to navigate, whereas"
    },
    {
      "id": 63,
      "text": "my coworker wanted to make it more colorful with lots of pages and blog focused."
    },
    {
      "id": 64,
      "text": "My task was to find an amicable way forward that was in the company's best interest"
    },
    {
      "id": 65,
      "text": "on one that enabled us to collaborate on the project without conflict."
    },
    {
      "id": 66,
      "text": "After listening to my coworker's ideas and putting forward my own, I suggested we"
    },
    {
      "id": 67,
      "text": "create two versions of the website and run a test to see which one had the most visitors,"
    },
    {
      "id": 68,
      "text": "engagement and sales conversions."
    },
    {
      "id": 69,
      "text": "By using this approach, we could test both ideas and the company would get the best results"
    },
    {
      "id": 70,
      "text": "possible."
    },
    {
      "id": 71,
      "text": "My coworker agreed this was a great idea."
    },
    {
      "id": 72,
      "text": "After creating two versions of the website and running comprehensive testing, my idea yielded"
    },
    {
      "id": 73,
      "text": "the most substantial returns for the company."
    },
    {
      "id": 74,
      "text": "Behavioral interview question number three, describe a situation when you delivered excellent"
    },
    {
      "id": 75,
      "text": "customer service."
    },
    {
      "id": 76,
      "text": "Here's my example answer that uses a start technique."
    },
    {
      "id": 77,
      "text": "A customer came into the store one morning to pay for a product they had seen listed on"
    },
    {
      "id": 78,
      "text": "our website."
    },
    {
      "id": 79,
      "text": "When I went to retrieve the product from our store, it had sold out."
    },
    {
      "id": 80,
      "text": "Understandably, the customer was Irate."
    },
    {
      "id": 81,
      "text": "It was my responsibility to resolve the situation and put things right for the customer."
    },
    {
      "id": 82,
      "text": "I immediately apologized."
    },
    {
      "id": 83,
      "text": "I would feel the same if the situation had happened to me and then investigated or online"
    },
    {
      "id": 84,
      "text": "inventory system to see what had gone wrong."
    },
    {
      "id": 85,
      "text": "The system had incorrectly allocated the product to our shop."
    },
    {
      "id": 86,
      "text": "In fact, it was located at our main distribution center."
    },
    {
      "id": 87,
      "text": "I contacted the distribution manager and requested he dispatch the product immediately"
    },
    {
      "id": 88,
      "text": "to the customer's home address on a 24-hour urgent delivery notice."
    },
    {
      "id": 89,
      "text": "I then asked my store manager for permission to give the customer a 50% refund due to the"
    },
    {
      "id": 90,
      "text": "inconvenience caused to which he agreed."
    },
    {
      "id": 91,
      "text": "After apologizing to the customer again and informing her of my actions, she thanked"
    },
    {
      "id": 92,
      "text": "me for my prompt action and excellent customer service skills."
    },
    {
      "id": 93,
      "text": "Finally, I contacted our IT department and asked them to ensure the same system error"
    },
    {
      "id": 94,
      "text": "never happened again."
    },
    {
      "id": 95,
      "text": "Behavioral interview question number four."
    },
    {
      "id": 96,
      "text": "Tell me about the time when you worked under pressure."
    },
    {
      "id": 97,
      "text": "Here's my example answer."
    },
    {
      "id": 98,
      "text": "In my last role, my manager asked me to take up the duties of a coworker who had to take"
    },
    {
      "id": 99,
      "text": "a leave of absence due to personal reasons."
    },
    {
      "id": 100,
      "text": "I was already working on a time-sensitive task of my own, but I agreed to do the additional"
    },
    {
      "id": 101,
      "text": "work requested."
    },
    {
      "id": 102,
      "text": "It was my task to reprioritize my workload to include the additional tasks and get everything"
    },
    {
      "id": 103,
      "text": "finished on time."
    },
    {
      "id": 104,
      "text": "I created a new list of all my responsibilities and used a colour coded system to determine"
    },
    {
      "id": 105,
      "text": "which tasks should be completed first."
    },
    {
      "id": 106,
      "text": "Hip-tasked were urgent and the tasks came second and green tasks last."
    },
    {
      "id": 107,
      "text": "I then blocked out my diary, rescheduled several appointments and set to work."
    },
    {
      "id": 108,
      "text": "By being highly organised, methodical when prioritizing tasks and utilizing my time carefully,"
    },
    {
      "id": 109,
      "text": "I was able to get all my duties completed to an exceptional standard."
    },
    {
      "id": 110,
      "text": "Behavioral interview question number five."
    },
    {
      "id": 111,
      "text": "Tell me about a time when you disagreed with a supervisor."
    },
    {
      "id": 112,
      "text": "This is a really difficult question to answer correctly."
    },
    {
      "id": 113,
      "text": "Here's my example response that uses a start technique."
    },
    {
      "id": 114,
      "text": "My supervisor wanted to launch a new company product by advertising in local stores and"
    },
    {
      "id": 115,
      "text": "supermarkets."
    },
    {
      "id": 116,
      "text": "I didn't feel this was the best way to get the greatest return from the launch."
    },
    {
      "id": 117,
      "text": "I felt it was important to disagree with my supervisor and explain in a professional manner"
    },
    {
      "id": 118,
      "text": "the reasons why."
    },
    {
      "id": 119,
      "text": "I spoke to my supervisor in private and said that my research showed we could potentially"
    },
    {
      "id": 120,
      "text": "get a greater return from our product launch by allocating all of the budget to online"
    },
    {
      "id": 121,
      "text": "adverts including Facebook and Instagram."
    },
    {
      "id": 122,
      "text": "By using this method we could target a specific audience based on age, gender and interests."
    },
    {
      "id": 123,
      "text": "I supervise it was intrigued by my suggestion and she agreed to trial 50% of the budget"
    },
    {
      "id": 124,
      "text": "to online advertising for one week."
    },
    {
      "id": 125,
      "text": "Now after the one week trial was over, the online advertising had yielded a far greater"
    },
    {
      "id": 126,
      "text": "return and my supervisor decided to allocate 100% of the budget to this new method."
    },
    {
      "id": 127,
      "text": "Behavioral interview question number six."
    },
    {
      "id": 128,
      "text": "Tell me about a time when you made a mistake."
    },
    {
      "id": 129,
      "text": "Here's my example answer."
    },
    {
      "id": 130,
      "text": "When I started working my first job, my supervisor asked for a volunteer to go and work"
    },
    {
      "id": 131,
      "text": "the following week in a different department because one of their key workers was off"
    },
    {
      "id": 132,
      "text": "sick."
    },
    {
      "id": 133,
      "text": "I volunteered."
    },
    {
      "id": 134,
      "text": "I saw this as an opportunity for me to learn more about the company and diversify my skills."
    },
    {
      "id": 135,
      "text": "Unfortunately, I failed to write down the change of department in my diary and when"
    },
    {
      "id": 136,
      "text": "the following week arrived, the head of department complained to my manager that I had"
    },
    {
      "id": 137,
      "text": "not turned up."
    },
    {
      "id": 138,
      "text": "I felt awful and embarrassed because I had let my manager and the other department down."
    },
    {
      "id": 139,
      "text": "I immediately apologized and rushed over to the new department to commence my work."
    },
    {
      "id": 140,
      "text": "I learned a lot from that mistake."
    },
    {
      "id": 141,
      "text": "I now make sure I place all appointments and responsibilities in my paper diary, are my"
    },
    {
      "id": 142,
      "text": "smart phone too, so they are never missed."
    },
    {
      "id": 143,
      "text": "Now the next thing to do is you want to accelerate your learning even further."
    },
    {
      "id": 144,
      "text": "Please click that link right now in the top right hand corner of the video, head straight"
    },
    {
      "id": 145,
      "text": "through to my website, passmaintoview.com and you can instantly download those six answers"
    },
    {
      "id": 146,
      "text": "I just gave you."
    },
    {
      "id": 147,
      "text": "Plus, an additional 27 tell me about a time, behavioral interview questions and top scoring"
    },
    {
      "id": 148,
      "text": "example answers."
    },
    {
      "id": 149,
      "text": "This guide will help you be the competition at your forthcoming interview."
    },
    {
      "id": 150,
      "text": "Make sure you check it out."
    },
    {
      "id": 151,
      "text": "Also, please make sure you hit that subscribe button."
    },
    {
      "id": 152,
      "text": "Literally thousands of you are passing your interviews at the very first attempt."
    },
    {
      "id": 153,
      "text": "I can only help you if you are subscribed please give the video a like because that really"
    },
    {
      "id": 154,
      "text": "does motivate me to create more content for you and don't forget to connect with me on"
    },
    {
      "id": 155,
      "text": "LinkedIn."
    },
    {
      "id": 156,
      "text": "I have put my LinkedIn link in the description below the video."
    },
    {
      "id": 157,
      "text": "It's always a pleasure to connect with like-minded professionals such as yourself."
    },
    {
      "id": 158,
      "text": "Thank you so much for watching and I wish you all the best for passing your job interview"
    },
    {
      "id": 159,
      "text": "have a great day."
    }
  ]
}