{
  "file": "kTUe116UfYc.wav",
  "text": " Hello there, my name is Richard McMunn from the Interview Training website, passmaintoview.com, and in this training video I will teach you how to pass and Amazon interview. And in particular we are going to focus on the 16 Amazon leadership principles. If you have a job interview coming up soon for any role at Amazon you will have to answer a series of leadership principles into view questions. So to help you pass your interview at the first attempt I will cover the following four things in this training video. Number one, I will give you a list of Amazon leadership principles into view questions you should prepare for. These questions come up all the time during all Amazon job interviews. Number two, I will teach you. A simple but brilliant structure to use when answering the Amazon leadership principles into view questions. Number three, I will then give you a brilliant example answer to each interview question to help you pass your Amazon interview at the first attempt. And then finally number four, I will tell you where you can instantly download my 16 brilliant answers to difficult, Amazon leadership principles into view questions. And just very quickly, if you are new to my YouTube channel, please make sure you hit that subscribe button right now. Thousands of you are passing your job interviews at the first attempt. I can only help you if you are subscribed and please give the video I like because that really does energize and motivate me to create more great content for you. Thank you very much indeed. Okay, let's get started with the training video and I will explain what the Amazon leadership principles are. Please make sure you take notes. Now Amazon is one of the greatest employers in the world and they are so successful because of the 16 leadership principles. Now Amazon takes responsibility both individually and collectively for living out these leadership principles in its daily actions. So you need to know what they are and also demonstrate that you are capable of implementing them in your daily work. Now these 16 leadership principles define how Amazon operates, how its leaders guide, and how the customer remains at the heart of all decisions. Now the distinct Amazon culture which is shaped by these 16 leadership principles drives an unwavering commitment to becoming the world's most customer-focused company, the best employer and the safest place to work. So let me now teach you how to answer the Amazon leadership principles into view questions to get the highest scores possible. Please take notes this is very important. So I strongly recommend you use the star method when answering the Amazon leadership principles into view questions. Now star stands for situation, task, action and result. So whenever you are required to answer a leadership principles into view question at your Amazon interview, I recommend you start your answer and briefly outline the situation you were in. You will then explain the task that needed your attention. You will then give in depth details of the action you took and then finally you will finish your answer with the results following your action. So please write that down. You can pause the video if you want to. It's called the star method. And it is a recognized structure for answering the Amazon leadership principles into view questions. So let's now start working through these common leadership principles into view questions. So the first leadership principle I want you to prepare for is customer obsession. What does this mean? Well people who work for Amazon start with the customer and they work backward. They always prioritize customer satisfaction over competitors and they focus on earning and keeping their trust. Because that then means the customer will return to Amazon time and time again in the future. So what is an example question that comes up all the time during Amazon interviews that assesses the leadership principle of customer obsession. Here it is right this down. When we about a time when you went above and beyond to meet the needs of a customer. So let me now give you a brilliant example answer to this question that uses that star method situation, task action and result. Here it is. In my previous job, a customer call to discuss a product they needed. They initially showed interest in one of our high ticket price products which presented a significant sales opportunity. However, I was more concerned with ensuring the product was suitable for their needs than making a quick sale. My task was to ask the customer relevant questions to establish their requirements. I asked the customer what they needed the product for and what was important to them regarding price and quality. If they are listening to the customer's answers, I determined that a cheaper product would be more suitable. I explained how the alternative product worked and why I felt it would be better for their needs. After explaining everything to the customer and answering their questions, they agreed to buy the alternative product. They thanked me for helping them save money and left a positive online review following their experience. For days later, I called the customer to follow up and to ensure the product still met their needs. So you can see how effective the star method is for answering the Amazon leadership principles interview questions. Let's move on to Amazon Leadership Principle number two. And that is, ownership. What does this mean? What this means that people who work at Amazon act on behalf of the company and they take responsibility and always think long term. They will never say that's not my job or that's not my responsibility. They always take ownership of situations. So here is a common example ownership interview question that comes up all the time at Amazon interviews. And that question is, describe a time when you took ownership of a project or task and saw it through to completion despite challenges. So here is another brilliant example answer again that uses a star method. In my last job, I collaborated on a time sensitive project. Unfortunately, with just ten days to go before the project deadline, two team members fell sick with COVID and they could not work. This situation presented a significant challenge because the absent team members had specialized technical skills. Some people on the team suggested we try to extend the project deadline but I was not prepared to do this. My task was to take control of the project and ensure it was completed on time and to the required standard. To address the situation, I convened a team meeting to reassess the project. I compiled a list of pending tasks and requested the remaining team members to take on additional responsibilities based on their skills and expertise. I also reached out to another department in the company to request the temporary transfer of a team member with the required specialized skills. Now for the remaining technical tasks, I hired a suitably qualified freelance contractor from upwork.com whose contribution was instrumental in overcoming this challenge. Through our collective commitment and innovative thinking, we were able to meet the project deadline which was of significant importance to the company. The successful completion was a testament to my determination and our team's resilient and adaptability in the face of adversity. So that is another brilliant example answer that will help you pass your Amazon interview. Now don't go anywhere because I still have many more tips, questions and sample answers to give you but when you are ready, click the link in the top right hand corner of the video and you can instantly download my brilliant example answers to 16 Amazon leadership principles into view questions. But here is the next question I strongly recommend you prepare for. This question is based on the leadership principle of invent and simplify. What does this leadership principle mean? It means that people who work for Amazon seek innovation and simplicity, they think creatively while finding ways to streamline processes and make things more efficient. So the example answer, sorry the example question I recommend you prepare for is, can you give an example of a time when you invented something or found a simpler way to do something? So here is another great example answer to this Amazon leadership principles interview question that uses a star method. Can you give an example of a time when you invented something or found a simpler way to do something? Here we go. In my last job I was frustrated with the team's culture of waste. People in our office often ordered large quantities of supplies and resources which were not always needed. My task was to create an inventory tracking and ordering system and to also educate team members on how to reduce waste. I searched on YouTube for the best tutorial on creating an inventory tracking and ordering system using Microsoft Excel. Once I had created the Excel spreadsheet which included strict reorder limits, I created a PowerPoint presentation. The presentation would be used to teach the team the importance of a cost-conscious culture and how to use the Excel spreadsheet to manage and order office supplies. Once the presentation was ready I showed everything to my manager and asked his permission to deliver my presentation to the team to which he agreed. My actions combined with the team's dedication led to a 50% saving for the company in office supplies and resources. The Excel spreadsheet also fostered a new cost-conscious work approach in the team demonstrating their commitment to the initiative. That's another really strong example answer that will help you pass your Amazon leadership principles interview. Here is the next leadership principle I recommend you prepare for and that is, are right a lot. What does this leadership principle mean? Well it means that people who work for Amazon make sound decisions based on judgment and strong instincts. They are right often and seek diverse perspectives to challenge their thinking. So the type of question that comes up all the time at Amazon interviews that assesses this leadership principle is, tell me about a time when you had to make a decision with incomplete information. How did you make the right decision? Here is my example answer to help you. My manager asked me to launch a new company product in my last job. A lot of time and effort had gone into creating the product and I wanted the launch to succeed. My task was to launch the product to ensure strong sales. Now after quickly analyzing the market, I determined the product needed to be launched immediately to capitalize on seasonal demand. Now unfortunately I did not have sufficient data or information to identify the best social media platforms to promote the product. I would normally conduct thorough market research and obtain customer feedback before commencing the launch but there was insufficient time. I used a combination of my instincts and readily available tools to create the best launch campaign in the time I had available. I used the Google Keyword Planar tool to identify the most searched for terms online and I also asked chat GPT to analyze our competitors use of online platforms. I then launched the product using Google Targeted Adverts based on relevant search terms. I also used Facebook Adverts to target potential customers based on age, gender and demographics I felt would yield the greatest return. The product launch was not just a success, it was a triumph. Our results surpassed all previous product launches by 17%. Now this achievement borne from a combination of my initiative and the resources available to me serves as a testament to what can be achieved even when time and information are not on our side. Now that is another great answer and you can see how these in-depth responses will help you pass your Amazon leadership principles into view. Here is the next leadership principle I strongly recommend you prepare for and that is higher and develop the best. What does this leadership principle mean at Amazon? Well it means that people who work for Amazon always higher and mentor exceptional talent continually raising the performance bar and developing future leaders. So here is my example question that I strongly recommend you prepare for. How have you contributed to the growth and development of others in your previous roles? Here is my example answer that uses a star method. In my previous job I volunteered to help train new team members when they join the organisation. I wanted to develop my coaching and mentoring skills and quickly learn my new co-workers strengths because that would empower me to ensure the team met its objectives. My task was to devise a standardized training program that could be utilized by all incoming team members enabling them to swiftly attain competence. While training the first person, I wrote down a list of competencies they needed to learn and devised a series of step-by-step instructions to teach them how to use company systems and processes correctly. The documents I produced could then be used to train all future new employees to save time. The system I created was so successful that the company owner distributed it to all departments as the best practice model for new staff training. So that is another great answer pause the video and write it down if you want to. Let's move on to Amazon Leadership Principle number 6 which is Learn and Be curious. What does this mean? Well this means that all people who work for Amazon are constantly looking to improve and expand their knowledge which helps drive personal and professional growth. And the question that comes up all the time is give me an example of a time when you taught yourself and you skill to improve your work performance. This is a great answer again that uses that star method. Give me an example of a time when you taught yourself and you skill to improve your work performance. Here we go. My last job I noticed that the company spent $1,000 a month with a local marketing agency to increase engagement on social media. After analyzing the work the marketing agency was producing I wasn't convinced this was a good use of company's finances. Recognizing the potential for cost savings I took the initiative to learn how to create engaging social media posts aiming to contribute to the company's financial efficiency. I watched an online marketing tutorial before teaching myself how to use Canva to create social media images. I also learned how to use chatGPT to create engaging social media posts based on our industry that we could upload to the company's social media channels with a scheduled post date. I then showed my manager the skills I had learned and persuaded him to stop using the marketing agency and permit me to handle the company's social media accounts. After my manager agreed I started periodically posting content online which resulted in a $1,000 monthly savings for the company. So that's another great answer. Let's move on to Amazon Leadership Principle number 7 which is insist on the highest standards. Now as you and I already know, Amazon has really high standards. That is why people use them all the time. I think in the last year I have ordered more than 360 products from Amazon and I use them because they have outstanding customer service and their standards are really high. Now what does this Leadership Principle mean? Well, it means that people who work for Amazon hold high standards, they constantly push to deliver top quality results even if others view it as unrealistic. An question that comes up all the time based on this Leadership Principle is, tell me about the time when you refuse to compromise on standards even though it was easier to do so. Let me give you my brilliant example answer that uses the star method here we go. I was attending a team meeting to discuss a client project we were required to collaborate on. During the meeting, two senior team members suggested we cut corners to save time and money. They argued that the client would never find out and we could reduce our project costs significantly. I strongly disagreed with their suggestion. My task was to speak out, disagree with their suggestions and explain the reasons why. I immediately argued that their suggestion was morally and contractually wrong. The client had paid good money for the project to be delivered in a specific way. Deviating from the agreed project specifications could damage the reputation of our employer and make the project unsafe. After listening to my arguments against their proposal, they agreed it was not a good idea. My actions demonstrate my understanding of how important customer obsession is to the success of a business and my ability to challenge decisions to achieve better outcomes. The brilliant answer that will help you demonstrate that leadership principle of insist on the highest standards. Let's move on to the next Amazon leadership principle and that is, think big. What does this mean? Well it means that people who work for Amazon create and communicate bold ideas that inspire and challenge, they always take calculated risks to achieve long-term impact. The question that comes up all the time is, describe a time when you took a big risk in pursuit of a large goal. This is a really difficult question to answer, but here is my excellent top scoring answer that uses a star method. The first thing to do is to describe a situation when you took a big risk in pursuit of a large goal. Here we go. In my previous role, we faced delays and errors from a long-term supplier causing customer complaints and affecting service reliability. However, switching suppliers carried risks, including potential disruptions and uncertainty, and finding a reliable replacement. My goal was to improve service reliability, customer retention and sales while minimizing risks associated with changing suppliers. After assessing options, I chose to cancel a supplier's contract. I negotiated a short-term agreement with a new supplier with performance metrics and penalties for non-compliance. I also implemented contingency plans monitored their performance closely and communicated with our team to prepare for potential transition issues. The transition went smoothly, improving delivery times by 20% and reducing errors by 30%. Customer satisfaction increased, leading to a 15% boost in retention and higher sales due to positive reviews and word of mouth. So that is a really good answer. I like how at the end you are giving percentages that help demonstrate how your actions help the company to improve. So there are eight remaining leadership principles you need to prepare for. We've already covered the first date. The next eight are bias for action, frugality, earn trust, dive deep, have backbone, disagree and commit deliver results, strive to be earth's best employer and success and scale bring broad responsibility. Now if you want my example answers that use the star method to all 16 leadership principles so that includes the eight that we've just covered plus an additional eight, go through to my website and click the link right now in the top right-end corner of the video. So go through to my website, passmainterview.com and you can instantly download these slides with all the exam palancers plus an additional eight Amazon leadership principles, interview answers that cover those final eight leadership principles. Go through to my website and you can literally have this guide in your inbox within two minutes from now. Also please make sure you hit that subscribe button thousands of you and I mean thousands of you are passing your job interviews at the first attempt. I can only help you if you are subscribed please hit the like button because that really does motivate me to create more great content for you and don't forget to connect with me on LinkedIn. I have put my LinkedIn link in the description below the video. It is always an honor and a pleasure to connect with like-minded professionals such as yourself. Thank you for watching and I wish you all the very best for passing your Amazon interview have a wonderful day.",
  "segments": [
    {
      "id": 0,
      "text": "Hello there, my name is Richard McMunn from the Interview Training website, passmaintoview.com,"
    },
    {
      "id": 1,
      "text": "and in this training video I will teach you how to pass and Amazon interview."
    },
    {
      "id": 2,
      "text": "And in particular we are going to focus on the 16 Amazon leadership principles."
    },
    {
      "id": 3,
      "text": "If you have a job interview coming up soon for any role at Amazon you will have to answer"
    },
    {
      "id": 4,
      "text": "a series of leadership principles into view questions."
    },
    {
      "id": 5,
      "text": "So to help you pass your interview at the first attempt I will cover the following"
    },
    {
      "id": 6,
      "text": "four things in this training video."
    },
    {
      "id": 7,
      "text": "Number one, I will give you a list of Amazon leadership principles into view questions you"
    },
    {
      "id": 8,
      "text": "should prepare for."
    },
    {
      "id": 9,
      "text": "These questions come up all the time during all Amazon job interviews."
    },
    {
      "id": 10,
      "text": "Number two, I will teach you."
    },
    {
      "id": 11,
      "text": "A simple but brilliant structure to use when answering the Amazon leadership principles"
    },
    {
      "id": 12,
      "text": "into view questions."
    },
    {
      "id": 13,
      "text": "Number three, I will then give you a brilliant example answer to each interview question"
    },
    {
      "id": 14,
      "text": "to help you pass your Amazon interview at the first attempt."
    },
    {
      "id": 15,
      "text": "And then finally number four, I will tell you where you can instantly download my 16"
    },
    {
      "id": 16,
      "text": "brilliant answers to difficult, Amazon leadership principles into view questions."
    },
    {
      "id": 17,
      "text": "And just very quickly, if you are new to my YouTube channel, please make sure you hit"
    },
    {
      "id": 18,
      "text": "that subscribe button right now."
    },
    {
      "id": 19,
      "text": "Thousands of you are passing your job interviews at the first attempt."
    },
    {
      "id": 20,
      "text": "I can only help you if you are subscribed and please give the video I like because that"
    },
    {
      "id": 21,
      "text": "really does energize and motivate me to create more great content for you."
    },
    {
      "id": 22,
      "text": "Thank you very much indeed."
    },
    {
      "id": 23,
      "text": "Okay, let's get started with the training video and I will explain what the Amazon leadership"
    },
    {
      "id": 24,
      "text": "principles are."
    },
    {
      "id": 25,
      "text": "Please make sure you take notes."
    },
    {
      "id": 26,
      "text": "Now Amazon is one of the greatest employers in the world and they are so successful"
    },
    {
      "id": 27,
      "text": "because of the 16 leadership principles."
    },
    {
      "id": 28,
      "text": "Now Amazon takes responsibility both individually and collectively for living out these"
    },
    {
      "id": 29,
      "text": "leadership principles in its daily actions."
    },
    {
      "id": 30,
      "text": "So you need to know what they are and also demonstrate that you are capable of implementing"
    },
    {
      "id": 31,
      "text": "them in your daily work."
    },
    {
      "id": 32,
      "text": "Now these 16 leadership principles define how Amazon operates, how its leaders guide, and"
    },
    {
      "id": 33,
      "text": "how the customer remains at the heart of all decisions."
    },
    {
      "id": 34,
      "text": "Now the distinct Amazon culture which is shaped by these 16 leadership principles drives"
    },
    {
      "id": 35,
      "text": "an unwavering commitment to becoming the world's most customer-focused company, the best"
    },
    {
      "id": 36,
      "text": "employer and the safest place to work."
    },
    {
      "id": 37,
      "text": "So let me now teach you how to answer the Amazon leadership principles into view questions"
    },
    {
      "id": 38,
      "text": "to get the highest scores possible."
    },
    {
      "id": 39,
      "text": "Please take notes this is very important."
    },
    {
      "id": 40,
      "text": "So I strongly recommend you use the star method when answering the Amazon leadership"
    },
    {
      "id": 41,
      "text": "principles into view questions."
    },
    {
      "id": 42,
      "text": "Now star stands for situation, task, action and result."
    },
    {
      "id": 43,
      "text": "So whenever you are required to answer a leadership principles into view question at your"
    },
    {
      "id": 44,
      "text": "Amazon interview, I recommend you start your answer and briefly outline the situation"
    },
    {
      "id": 45,
      "text": "you were in."
    },
    {
      "id": 46,
      "text": "You will then explain the task that needed your attention."
    },
    {
      "id": 47,
      "text": "You will then give in depth details of the action you took and then finally you will finish"
    },
    {
      "id": 48,
      "text": "your answer with the results following your action."
    },
    {
      "id": 49,
      "text": "So please write that down."
    },
    {
      "id": 50,
      "text": "You can pause the video if you want to."
    },
    {
      "id": 51,
      "text": "It's called the star method."
    },
    {
      "id": 52,
      "text": "And it is a recognized structure for answering the Amazon leadership principles into"
    },
    {
      "id": 53,
      "text": "view questions."
    },
    {
      "id": 54,
      "text": "So let's now start working through these common leadership principles into view questions."
    },
    {
      "id": 55,
      "text": "So the first leadership principle I want you to prepare for is customer obsession."
    },
    {
      "id": 56,
      "text": "What does this mean?"
    },
    {
      "id": 57,
      "text": "Well people who work for Amazon start with the customer and they work backward."
    },
    {
      "id": 58,
      "text": "They always prioritize customer satisfaction over competitors and they focus on earning"
    },
    {
      "id": 59,
      "text": "and keeping their trust."
    },
    {
      "id": 60,
      "text": "Because that then means the customer will return to Amazon time and time again in the future."
    },
    {
      "id": 61,
      "text": "So what is an example question that comes up all the time during Amazon interviews that"
    },
    {
      "id": 62,
      "text": "assesses the leadership principle of customer obsession."
    },
    {
      "id": 63,
      "text": "Here it is right this down."
    },
    {
      "id": 64,
      "text": "When we about a time when you went above and beyond to meet the needs of a customer."
    },
    {
      "id": 65,
      "text": "So let me now give you a brilliant example answer to this question that uses that star method"
    },
    {
      "id": 66,
      "text": "situation, task action and result."
    },
    {
      "id": 67,
      "text": "Here it is."
    },
    {
      "id": 68,
      "text": "In my previous job, a customer call to discuss a product they needed."
    },
    {
      "id": 69,
      "text": "They initially showed interest in one of our high ticket price products which presented"
    },
    {
      "id": 70,
      "text": "a significant sales opportunity."
    },
    {
      "id": 71,
      "text": "However, I was more concerned with ensuring the product was suitable for their needs"
    },
    {
      "id": 72,
      "text": "than making a quick sale."
    },
    {
      "id": 73,
      "text": "My task was to ask the customer relevant questions to establish their requirements."
    },
    {
      "id": 74,
      "text": "I asked the customer what they needed the product for and what was important to them regarding"
    },
    {
      "id": 75,
      "text": "price and quality."
    },
    {
      "id": 76,
      "text": "If they are listening to the customer's answers, I determined that a cheaper product"
    },
    {
      "id": 77,
      "text": "would be more suitable."
    },
    {
      "id": 78,
      "text": "I explained how the alternative product worked and why I felt it would be better for their"
    },
    {
      "id": 79,
      "text": "needs."
    },
    {
      "id": 80,
      "text": "After explaining everything to the customer and answering their questions, they agreed to"
    },
    {
      "id": 81,
      "text": "buy the alternative product."
    },
    {
      "id": 82,
      "text": "They thanked me for helping them save money and left a positive online review following"
    },
    {
      "id": 83,
      "text": "their experience."
    },
    {
      "id": 84,
      "text": "For days later, I called the customer to follow up and to ensure the product still"
    },
    {
      "id": 85,
      "text": "met their needs."
    },
    {
      "id": 86,
      "text": "So you can see how effective the star method is for answering the Amazon leadership principles"
    },
    {
      "id": 87,
      "text": "interview questions."
    },
    {
      "id": 88,
      "text": "Let's move on to Amazon Leadership Principle number two."
    },
    {
      "id": 89,
      "text": "And that is, ownership."
    },
    {
      "id": 90,
      "text": "What does this mean?"
    },
    {
      "id": 91,
      "text": "What this means that people who work at Amazon act on behalf of the company and they take"
    },
    {
      "id": 92,
      "text": "responsibility and always think long term."
    },
    {
      "id": 93,
      "text": "They will never say that's not my job or that's not my responsibility."
    },
    {
      "id": 94,
      "text": "They always take ownership of situations."
    },
    {
      "id": 95,
      "text": "So here is a common example ownership interview question that comes up all the time"
    },
    {
      "id": 96,
      "text": "at Amazon interviews."
    },
    {
      "id": 97,
      "text": "And that question is, describe a time when you took ownership of a project or task and"
    },
    {
      "id": 98,
      "text": "saw it through to completion despite challenges."
    },
    {
      "id": 99,
      "text": "So here is another brilliant example answer again that uses a star method."
    },
    {
      "id": 100,
      "text": "In my last job, I collaborated on a time sensitive project."
    },
    {
      "id": 101,
      "text": "Unfortunately, with just ten days to go before the project deadline, two team members"
    },
    {
      "id": 102,
      "text": "fell sick with COVID and they could not work."
    },
    {
      "id": 103,
      "text": "This situation presented a significant challenge because the absent team members had"
    },
    {
      "id": 104,
      "text": "specialized technical skills."
    },
    {
      "id": 105,
      "text": "Some people on the team suggested we try to extend the project deadline but I was not prepared"
    },
    {
      "id": 106,
      "text": "to do this."
    },
    {
      "id": 107,
      "text": "My task was to take control of the project and ensure it was completed on time and to"
    },
    {
      "id": 108,
      "text": "the required standard."
    },
    {
      "id": 109,
      "text": "To address the situation, I convened a team meeting to reassess the project."
    },
    {
      "id": 110,
      "text": "I compiled a list of pending tasks and requested the remaining team members to take on additional"
    },
    {
      "id": 111,
      "text": "responsibilities based on their skills and expertise."
    },
    {
      "id": 112,
      "text": "I also reached out to another department in the company to request the temporary transfer"
    },
    {
      "id": 113,
      "text": "of a team member with the required specialized skills."
    },
    {
      "id": 114,
      "text": "Now for the remaining technical tasks, I hired a suitably qualified freelance contractor"
    },
    {
      "id": 115,
      "text": "from upwork.com whose contribution was instrumental in overcoming this challenge."
    },
    {
      "id": 116,
      "text": "Through our collective commitment and innovative thinking, we were able to meet the project"
    },
    {
      "id": 117,
      "text": "deadline which was of significant importance to the company."
    },
    {
      "id": 118,
      "text": "The successful completion was a testament to my determination and our team's resilient"
    },
    {
      "id": 119,
      "text": "and adaptability in the face of adversity."
    },
    {
      "id": 120,
      "text": "So that is another brilliant example answer that will help you pass your Amazon interview."
    },
    {
      "id": 121,
      "text": "Now don't go anywhere because I still have many more tips, questions and sample answers"
    },
    {
      "id": 122,
      "text": "to give you but when you are ready, click the link in the top right hand corner of the"
    },
    {
      "id": 123,
      "text": "video and you can instantly download my brilliant example answers to 16 Amazon leadership"
    },
    {
      "id": 124,
      "text": "principles into view questions."
    },
    {
      "id": 125,
      "text": "But here is the next question I strongly recommend you prepare for."
    },
    {
      "id": 126,
      "text": "This question is based on the leadership principle of invent and simplify."
    },
    {
      "id": 127,
      "text": "What does this leadership principle mean?"
    },
    {
      "id": 128,
      "text": "It means that people who work for Amazon seek innovation and simplicity, they think creatively"
    },
    {
      "id": 129,
      "text": "while finding ways to streamline processes and make things more efficient."
    },
    {
      "id": 130,
      "text": "So the example answer, sorry the example question I recommend you prepare for is, can you"
    },
    {
      "id": 131,
      "text": "give an example of a time when you invented something or found a simpler way to do something?"
    },
    {
      "id": 132,
      "text": "So here is another great example answer to this Amazon leadership principles interview"
    },
    {
      "id": 133,
      "text": "question that uses a star method."
    },
    {
      "id": 134,
      "text": "Can you give an example of a time when you invented something or found a simpler way to do"
    },
    {
      "id": 135,
      "text": "something?"
    },
    {
      "id": 136,
      "text": "Here we go."
    },
    {
      "id": 137,
      "text": "In my last job I was frustrated with the team's culture of waste."
    },
    {
      "id": 138,
      "text": "People in our office often ordered large quantities of supplies and resources which were"
    },
    {
      "id": 139,
      "text": "not always needed."
    },
    {
      "id": 140,
      "text": "My task was to create an inventory tracking and ordering system and to also educate team members"
    },
    {
      "id": 141,
      "text": "on how to reduce waste."
    },
    {
      "id": 142,
      "text": "I searched on YouTube for the best tutorial on creating an inventory tracking and ordering"
    },
    {
      "id": 143,
      "text": "system using Microsoft Excel."
    },
    {
      "id": 144,
      "text": "Once I had created the Excel spreadsheet which included strict reorder limits, I created"
    },
    {
      "id": 145,
      "text": "a PowerPoint presentation."
    },
    {
      "id": 146,
      "text": "The presentation would be used to teach the team the importance of a cost-conscious culture"
    },
    {
      "id": 147,
      "text": "and how to use the Excel spreadsheet to manage and order office supplies."
    },
    {
      "id": 148,
      "text": "Once the presentation was ready I showed everything to my manager and asked his permission"
    },
    {
      "id": 149,
      "text": "to deliver my presentation to the team to which he agreed."
    },
    {
      "id": 150,
      "text": "My actions combined with the team's dedication led to a 50% saving for the company in office"
    },
    {
      "id": 151,
      "text": "supplies and resources."
    },
    {
      "id": 152,
      "text": "The Excel spreadsheet also fostered a new cost-conscious work approach in the team demonstrating"
    },
    {
      "id": 153,
      "text": "their commitment to the initiative."
    },
    {
      "id": 154,
      "text": "That's another really strong example answer that will help you pass your Amazon leadership"
    },
    {
      "id": 155,
      "text": "principles interview."
    },
    {
      "id": 156,
      "text": "Here is the next leadership principle I recommend you prepare for and that is, are"
    },
    {
      "id": 157,
      "text": "right a lot."
    },
    {
      "id": 158,
      "text": "What does this leadership principle mean?"
    },
    {
      "id": 159,
      "text": "Well it means that people who work for Amazon make sound decisions based on judgment"
    },
    {
      "id": 160,
      "text": "and strong instincts."
    },
    {
      "id": 161,
      "text": "They are right often and seek diverse perspectives to challenge their thinking."
    },
    {
      "id": 162,
      "text": "So the type of question that comes up all the time at Amazon interviews that assesses"
    },
    {
      "id": 163,
      "text": "this leadership principle is, tell me about a time when you had to make a decision with"
    },
    {
      "id": 164,
      "text": "incomplete information."
    },
    {
      "id": 165,
      "text": "How did you make the right decision?"
    },
    {
      "id": 166,
      "text": "Here is my example answer to help you."
    },
    {
      "id": 167,
      "text": "My manager asked me to launch a new company product in my last job."
    },
    {
      "id": 168,
      "text": "A lot of time and effort had gone into creating the product and I wanted the launch to"
    },
    {
      "id": 169,
      "text": "succeed."
    },
    {
      "id": 170,
      "text": "My task was to launch the product to ensure strong sales."
    },
    {
      "id": 171,
      "text": "Now after quickly analyzing the market, I determined the product needed to be launched"
    },
    {
      "id": 172,
      "text": "immediately to capitalize on seasonal demand."
    },
    {
      "id": 173,
      "text": "Now unfortunately I did not have sufficient data or information to identify the best social"
    },
    {
      "id": 174,
      "text": "media platforms to promote the product."
    },
    {
      "id": 175,
      "text": "I would normally conduct thorough market research and obtain customer feedback before"
    },
    {
      "id": 176,
      "text": "commencing the launch but there was insufficient time."
    },
    {
      "id": 177,
      "text": "I used a combination of my instincts and readily available tools to create the best launch"
    },
    {
      "id": 178,
      "text": "campaign in the time I had available."
    },
    {
      "id": 179,
      "text": "I used the Google Keyword Planar tool to identify the most searched for terms online and"
    },
    {
      "id": 180,
      "text": "I also asked chat GPT to analyze our competitors use of online platforms."
    },
    {
      "id": 181,
      "text": "I then launched the product using Google Targeted Adverts based on relevant search terms."
    },
    {
      "id": 182,
      "text": "I also used Facebook Adverts to target potential customers based on age, gender and demographics"
    },
    {
      "id": 183,
      "text": "I felt would yield the greatest return."
    },
    {
      "id": 184,
      "text": "The product launch was not just a success, it was a triumph."
    },
    {
      "id": 185,
      "text": "Our results surpassed all previous product launches by 17%."
    },
    {
      "id": 186,
      "text": "Now this achievement borne from a combination of my initiative and the resources available"
    },
    {
      "id": 187,
      "text": "to me serves as a testament to what can be achieved even when time and information are"
    },
    {
      "id": 188,
      "text": "not on our side."
    },
    {
      "id": 189,
      "text": "Now that is another great answer and you can see how these in-depth responses will help"
    },
    {
      "id": 190,
      "text": "you pass your Amazon leadership principles into view."
    },
    {
      "id": 191,
      "text": "Here is the next leadership principle I strongly recommend you prepare for and that"
    },
    {
      "id": 192,
      "text": "is higher and develop the best."
    },
    {
      "id": 193,
      "text": "What does this leadership principle mean at Amazon?"
    },
    {
      "id": 194,
      "text": "Well it means that people who work for Amazon always higher and mentor exceptional talent"
    },
    {
      "id": 195,
      "text": "continually raising the performance bar and developing future leaders."
    },
    {
      "id": 196,
      "text": "So here is my example question that I strongly recommend you prepare for."
    },
    {
      "id": 197,
      "text": "How have you contributed to the growth and development of others in your previous roles?"
    },
    {
      "id": 198,
      "text": "Here is my example answer that uses a star method."
    },
    {
      "id": 199,
      "text": "In my previous job I volunteered to help train new team members when they join the organisation."
    },
    {
      "id": 200,
      "text": "I wanted to develop my coaching and mentoring skills and quickly learn my new co-workers"
    },
    {
      "id": 201,
      "text": "strengths because that would empower me to ensure the team met its objectives."
    },
    {
      "id": 202,
      "text": "My task was to devise a standardized training program that could be utilized by all incoming"
    },
    {
      "id": 203,
      "text": "team members enabling them to swiftly attain competence."
    },
    {
      "id": 204,
      "text": "While training the first person, I wrote down a list of competencies they needed to learn"
    },
    {
      "id": 205,
      "text": "and devised a series of step-by-step instructions to teach them how to use company systems"
    },
    {
      "id": 206,
      "text": "and processes correctly."
    },
    {
      "id": 207,
      "text": "The documents I produced could then be used to train all future new employees to save time."
    },
    {
      "id": 208,
      "text": "The system I created was so successful that the company owner distributed it to all departments"
    },
    {
      "id": 209,
      "text": "as the best practice model for new staff training."
    },
    {
      "id": 210,
      "text": "So that is another great answer pause the video and write it down if you want to."
    },
    {
      "id": 211,
      "text": "Let's move on to Amazon Leadership Principle number 6 which is Learn and Be curious."
    },
    {
      "id": 212,
      "text": "What does this mean?"
    },
    {
      "id": 213,
      "text": "Well this means that all people who work for Amazon are constantly looking to improve"
    },
    {
      "id": 214,
      "text": "and expand their knowledge which helps drive personal and professional growth."
    },
    {
      "id": 215,
      "text": "And the question that comes up all the time is give me an example of a time when you"
    },
    {
      "id": 216,
      "text": "taught yourself and you skill to improve your work performance."
    },
    {
      "id": 217,
      "text": "This is a great answer again that uses that star method."
    },
    {
      "id": 218,
      "text": "Give me an example of a time when you taught yourself and you skill to improve your work"
    },
    {
      "id": 219,
      "text": "performance."
    },
    {
      "id": 220,
      "text": "Here we go."
    },
    {
      "id": 221,
      "text": "My last job I noticed that the company spent $1,000 a month with a local marketing agency"
    },
    {
      "id": 222,
      "text": "to increase engagement on social media."
    },
    {
      "id": 223,
      "text": "After analyzing the work the marketing agency was producing I wasn't convinced this was"
    },
    {
      "id": 224,
      "text": "a good use of company's finances."
    },
    {
      "id": 225,
      "text": "Recognizing the potential for cost savings I took the initiative to learn how to create"
    },
    {
      "id": 226,
      "text": "engaging social media posts aiming to contribute to the company's financial efficiency."
    },
    {
      "id": 227,
      "text": "I watched an online marketing tutorial before teaching myself how to use Canva to create"
    },
    {
      "id": 228,
      "text": "social media images."
    },
    {
      "id": 229,
      "text": "I also learned how to use chatGPT to create engaging social media posts based on our industry"
    },
    {
      "id": 230,
      "text": "that we could upload to the company's social media channels with a scheduled post date."
    },
    {
      "id": 231,
      "text": "I then showed my manager the skills I had learned and persuaded him to stop using the marketing"
    },
    {
      "id": 232,
      "text": "agency and permit me to handle the company's social media accounts."
    },
    {
      "id": 233,
      "text": "After my manager agreed I started periodically posting content online which resulted in a"
    },
    {
      "id": 234,
      "text": "$1,000 monthly savings for the company."
    },
    {
      "id": 235,
      "text": "So that's another great answer."
    },
    {
      "id": 236,
      "text": "Let's move on to Amazon Leadership Principle number 7 which is insist on the highest standards."
    },
    {
      "id": 237,
      "text": "Now as you and I already know, Amazon has really high standards."
    },
    {
      "id": 238,
      "text": "That is why people use them all the time."
    },
    {
      "id": 239,
      "text": "I think in the last year I have ordered more than 360 products from Amazon and I use them"
    },
    {
      "id": 240,
      "text": "because they have outstanding customer service and their standards are really high."
    },
    {
      "id": 241,
      "text": "Now what does this Leadership Principle mean?"
    },
    {
      "id": 242,
      "text": "Well, it means that people who work for Amazon hold high standards, they constantly push"
    },
    {
      "id": 243,
      "text": "to deliver top quality results even if others view it as unrealistic."
    },
    {
      "id": 244,
      "text": "An question that comes up all the time based on this Leadership Principle is, tell me about"
    },
    {
      "id": 245,
      "text": "the time when you refuse to compromise on standards even though it was easier to do so."
    },
    {
      "id": 246,
      "text": "Let me give you my brilliant example answer that uses the star method here we go."
    },
    {
      "id": 247,
      "text": "I was attending a team meeting to discuss a client project we were required to collaborate"
    },
    {
      "id": 248,
      "text": "on."
    },
    {
      "id": 249,
      "text": "During the meeting, two senior team members suggested we cut corners to save time and money."
    },
    {
      "id": 250,
      "text": "They argued that the client would never find out and we could reduce our project costs"
    },
    {
      "id": 251,
      "text": "significantly."
    },
    {
      "id": 252,
      "text": "I strongly disagreed with their suggestion."
    },
    {
      "id": 253,
      "text": "My task was to speak out, disagree with their suggestions and explain the reasons why."
    },
    {
      "id": 254,
      "text": "I immediately argued that their suggestion was morally and contractually wrong."
    },
    {
      "id": 255,
      "text": "The client had paid good money for the project to be delivered in a specific way."
    },
    {
      "id": 256,
      "text": "Deviating from the agreed project specifications could damage the reputation of our employer"
    },
    {
      "id": 257,
      "text": "and make the project unsafe."
    },
    {
      "id": 258,
      "text": "After listening to my arguments against their proposal, they agreed it was not a good idea."
    },
    {
      "id": 259,
      "text": "My actions demonstrate my understanding of how important customer obsession is to the success"
    },
    {
      "id": 260,
      "text": "of a business and my ability to challenge decisions to achieve better outcomes."
    },
    {
      "id": 261,
      "text": "The brilliant answer that will help you demonstrate that leadership principle of insist on"
    },
    {
      "id": 262,
      "text": "the highest standards."
    },
    {
      "id": 263,
      "text": "Let's move on to the next Amazon leadership principle and that is, think big."
    },
    {
      "id": 264,
      "text": "What does this mean?"
    },
    {
      "id": 265,
      "text": "Well it means that people who work for Amazon create and communicate bold ideas that inspire"
    },
    {
      "id": 266,
      "text": "and challenge, they always take calculated risks to achieve long-term impact."
    },
    {
      "id": 267,
      "text": "The question that comes up all the time is, describe a time when you took a big risk"
    },
    {
      "id": 268,
      "text": "in pursuit of a large goal."
    },
    {
      "id": 269,
      "text": "This is a really difficult question to answer, but here is my excellent top scoring answer"
    },
    {
      "id": 270,
      "text": "that uses a star method."
    },
    {
      "id": 271,
      "text": "The first thing to do is to describe a situation when you took a big risk in pursuit of a"
    },
    {
      "id": 272,
      "text": "large goal."
    },
    {
      "id": 273,
      "text": "Here we go."
    },
    {
      "id": 274,
      "text": "In my previous role, we faced delays and errors from a long-term supplier causing customer"
    },
    {
      "id": 275,
      "text": "complaints and affecting service reliability."
    },
    {
      "id": 276,
      "text": "However, switching suppliers carried risks, including potential disruptions and uncertainty,"
    },
    {
      "id": 277,
      "text": "and finding a reliable replacement."
    },
    {
      "id": 278,
      "text": "My goal was to improve service reliability, customer retention and sales while minimizing"
    },
    {
      "id": 279,
      "text": "risks associated with changing suppliers."
    },
    {
      "id": 280,
      "text": "After assessing options, I chose to cancel a supplier's contract."
    },
    {
      "id": 281,
      "text": "I negotiated a short-term agreement with a new supplier with performance metrics and penalties"
    },
    {
      "id": 282,
      "text": "for non-compliance."
    },
    {
      "id": 283,
      "text": "I also implemented contingency plans monitored their performance closely and communicated"
    },
    {
      "id": 284,
      "text": "with our team to prepare for potential transition issues."
    },
    {
      "id": 285,
      "text": "The transition went smoothly, improving delivery times by 20% and reducing errors by 30%."
    },
    {
      "id": 286,
      "text": "Customer satisfaction increased, leading to a 15% boost in retention and higher sales due to positive"
    },
    {
      "id": 287,
      "text": "reviews and word of mouth."
    },
    {
      "id": 288,
      "text": "So that is a really good answer."
    },
    {
      "id": 289,
      "text": "I like how at the end you are giving percentages that help demonstrate how your actions"
    },
    {
      "id": 290,
      "text": "help the company to improve."
    },
    {
      "id": 291,
      "text": "So there are eight remaining leadership principles you need to prepare for."
    },
    {
      "id": 292,
      "text": "We've already covered the first date."
    },
    {
      "id": 293,
      "text": "The next eight are bias for action, frugality, earn trust, dive deep, have backbone, disagree"
    },
    {
      "id": 294,
      "text": "and commit deliver results, strive to be earth's best employer and success and scale"
    },
    {
      "id": 295,
      "text": "bring broad responsibility."
    },
    {
      "id": 296,
      "text": "Now if you want my example answers that use the star method to all 16 leadership principles"
    },
    {
      "id": 297,
      "text": "so that includes the eight that we've just covered plus an additional eight, go through"
    },
    {
      "id": 298,
      "text": "to my website and click the link right now in the top right-end corner of the video."
    },
    {
      "id": 299,
      "text": "So go through to my website, passmainterview.com and you can instantly download these slides"
    },
    {
      "id": 300,
      "text": "with all the exam palancers plus an additional eight Amazon leadership principles, interview"
    },
    {
      "id": 301,
      "text": "answers that cover those final eight leadership principles."
    },
    {
      "id": 302,
      "text": "Go through to my website and you can literally have this guide in your inbox within two"
    },
    {
      "id": 303,
      "text": "minutes from now."
    },
    {
      "id": 304,
      "text": "Also please make sure you hit that subscribe button thousands of you and I mean thousands"
    },
    {
      "id": 305,
      "text": "of you are passing your job interviews at the first attempt."
    },
    {
      "id": 306,
      "text": "I can only help you if you are subscribed please hit the like button because that really"
    },
    {
      "id": 307,
      "text": "does motivate me to create more great content for you and don't forget to connect with"
    },
    {
      "id": 308,
      "text": "me on LinkedIn."
    },
    {
      "id": 309,
      "text": "I have put my LinkedIn link in the description below the video."
    },
    {
      "id": 310,
      "text": "It is always an honor and a pleasure to connect with like-minded professionals such"
    },
    {
      "id": 311,
      "text": "as yourself."
    },
    {
      "id": 312,
      "text": "Thank you for watching and I wish you all the very best for passing your Amazon interview"
    },
    {
      "id": 313,
      "text": "have a wonderful day."
    }
  ]
}