{
  "file": "ktUHzfvCNs8.wav",
  "text": " Hello there, my name is Richard McMunn from CareerVids and in this presentation, I'm going to teach you how to answer behavioral interview questions for software engineers. If you are applying to become a software engineer with any company or organization, make sure you stay tuned, watch this presentation from start to finish because I promise to help you pass your interview at the first attempt. To achieve that goal, this is what I will cover in this presentation. Number one, so I will explain what behavioral interview questions are and why they are used at interviews. Number two, I will teach you the best method to use for answering software engineer, behavioral interview questions. Number three, I'll then give you lots of examples software engineer, behavioral interview questions and top scoring answers. And then finally, number four, I will tell you where you can instantly download these slides plus my full set of 25 great answers to software engineer interview questions in a PDF guide. And just very quickly, if you are new to this channel, please make sure you hit that subscribe button. Literally thousands of you and I mean thousands of you are passing your interviews at the first attempt. I can only help you if you are subscribed and please hit the like button, give this video or like. I really do appreciate your support. That motivates me to create more content for you. Thank you very much indeed. So to begin with, what are behavioral interview questions? Well, behavioral interview questions are says how you have dealt with previous workplace situations as a software engineer. Now behavioral interview questions often start with either tell me about a time, describe a situation or give an example of when you and then they give the scenario. So they could say, tell me about a time when you had to solve a complex code problem or they could say describe a situation when you had to collaborate with a difficult software engineer. So how do you answer these difficult behavioral interview questions? Well, I strongly recommend you use the start technique. So what is the start technique? Well, the start technique is recognized by all hiring managers and employers as the correct way to answer behavioral interview questions. So let's assume you are sat down in the chair or you are undertaking your interview online and the hiring manager says to you, tell me about a time when you had to manage competing deadlines as a software engineer. As soon as you hear the interview question, start in that way you should automatically think to yourself, I need to use a start technique when answering this question. So start stands for situation, task, action and then result. So let me explain what each of those different elements are. So the hiring manager asks you a behavioral interview question. You start off in you outline the situation you were faced with. So you are actually telling them a story about a situation you have previously been in. You then move on and outline the task that needed your attention. You then move on and give in depth details about the action you took and then finally, finish your answer and talk about the results of your actions. And it's really important to make sure the result is a positive outcome for your team or company. So let me now give you some examples of behavioral interview questions and answers for software engineers that use the start technique. I will tell you where you can download all of the answers. You can see in a second how effective this start technique is for answering software engineer behavioral interview questions. So the first question I want to tackle is, tell me about the time when you had to solve a complex code problem. Here's an example answer that uses a start technique. Here we go. In a previous software engineering position, I worked on coding problems for an internal department. And in experience software engineer had created the code, but was on annual leave. So I could not contact him to discuss the issue. Therefore, I had to use a common sense approach to solving the problem. Now the most common errors, junior software engineers unwittingly make, are syntax and logic. Now because the system was generating a wrong solution, I presumed it was a logic error. And after further investigation, I confirmed this was the issue. Now once the problem had been rectified, I emailed the junior software engineer to explain the problem, I had found and advised him on how to prevent it from reoccurring. I recommended that he break down his code into small, manageable chunks and then test it before progressing to the next. So that's a really good example answer you are talking about. A situation you have previously been in where you solved a difficult coding problem. You used a process of elimination. And also I like the fact at the end of your answer. You are contacting the software engineer to help him or her not make the same error in the future. So there's a positive outcome for the team and company. It's a really good answer. Here's the next behavioral interview question and example answer for software engineers. The question is, describe a situation when you had to collaborate with a difficult software engineer. So this question is assessing your team working skills and communication capabilities. Here's my top scoring response that uses that all important. Start technique. Here we go. The first one is, describe a situation when you had to collaborate with a difficult software engineer. I was working on a project for a company client with three other software engineers. We all had varying levels of knowledge and expertise which was a strength. However, one of the engineers continually insisted his approach to solving the project challenges was right despite data and evidence suggesting otherwise. I detected his communication style and arrogance irritated the other engineers. So I decided to speak to him in private. I wanted the project to run smoothly. So decided to stop the conflict before it escalated. I explained to the engineer that his expertise and talent were invaluable to the team, but that we needed to focus on the facts and data to progress the project action plan. After I'd explained that time was of the essence and that we needed to collaborate solely based on the project objectives he agreed to change communication style. So that's a really good answer. It shows that you take positive action to diffuse the conflict and you use really good communication style to get your coworker to change their approach to stop that conflict from escalating. So it's a really good example answer and it shows that you can collaborate with difficult people to achieve your software engineering project objectives. Here's an question. Well, before we move on to the next question, I just want to let you know that if at any time you want to download these slides plus an additional 25 great answers to software engineering to be questioned, you can click that link in the top right hand corner of the video. Let me move on to that next question and that is, tell me about a time when you had to manage competing deadlines as a software engineer. This is a really difficult question, but it is assessing your organization and prioritizing capabilities. Can you be left alone to manage competing deadlines? And if so, how do you achieve that goal? Well, here's a brilliant example answer that uses a start technique. What I'm about to time when you had to manage competing deadlines, here we go. In my last software engineer position, I volunteered to continue the work of a coworker who was on leave for several weeks. We were both working on separate time-sensitive projects, but I saw this as an opportunity to help him and the company during a busy period. It was my task to prioritize the workload for both projects to ensure the competing deadlines were met. I was using a grant chart for my project, so I set up another one for my coworkers to assess priorities and measure progress during the two week period. This proved to be a brilliant idea because I quickly determined that there were identical tasks across both projects that could be completed concurrently. Now for the tasks requiring separate time allocation, I drew up a list of the priorities, mock-tow all distractions and work quickly and efficiently. By being organised and analyzing tasks for both projects and creating a priorities list, I could make excellent progress on both projects while my coworker was on leave. So that again shows that you are willing to go above and beyond for the company, you are helping out your coworker and you don't need to be told what to do. And you are finding a smart solution because by using two grant charts you can see that there are work areas that you can do concurrently, so it's a really good answer. Here's the next behavioral interview question for software engineers. Tell me about the time when you had to persuade someone at work. This is another trick you want. Here's my example answer that uses the start technique to help you pass your interview. Tell me about the time when you had to persuade someone at work. Here we go. In a previous role, there was no uniformity in the software engineering teams project management applications. This meant that one week I could work on a project that used Monday.com. And the next week I'd be on a project that used resource guru. Now this lack of uniformity was not only holding up the progression of software engineering work, but it also meant new team members had to get familiar with various project management tools before they commenced work. So I decided to do something about it. I researched the best project management applications on the market for software engineers. I created a mini presentation highlighting the benefits of using the one I felt most suited the business strategic goals. I then met with my team and manager and presented my findings. At the end of the presentation, my manager thought it was a great idea and she took steps to change company policy so that only one project management tool was used and everyone had the appropriate training in its operation. That's a really good answer. It shows that you can see that there is a problem in the software engineering team. You want to create a solution that speeds up the progression of work and and a lot of the fact that you are creating a presentation, presenting it to your manager and team and then they are taking it forward to improve the business. So it's a really good example that comes out with a positive result. Don't forget, make sure that when you're using the start technique, the result is a positive one for your team or company. Here is the next question. The next behavioral interview question for software engineers and that is. Tell me about the time when you failed at work. Now sometimes people respond by saying, I've never failed. I'm really good at my work. I will not let you down. I don't fail. That is not what this question is assessing. This question is assessing two things. Number one, your honesty and number two, how you respond to failure. Do you learn from it? Do you accept responsibility, take ownership and then move forward? That's what they are looking for. So here's my example answer to help you. Tell me about the time when you failed at work. Here we go. In my previous software engineering position. I was tasked with estimating the time it would take to create a web application for the company. I'd done this type of work many times before, so I was confident it wouldn't take long. It was my task to estimate the time for the project, create a plan of action and put forward a working proposal to my manager before setting to work. I anticipated it would take 10 days to complete the work. Now unfortunately, I made a foolish mistake and failed to consult a colleague of mine who I needed to carry out some development work on the project. After I'd submitted my proposal and it was accepted, I learned that my colleague was on holiday for that period. To ensure the project was still completed, I contacted a colleague from my network of software engineers and he agreed to carry out the development work for me. Now although the project was still completed, I learned a tremendous amount from that experience and now make sure I double check my action plans and work schedules before submitting them. So that's an honest answer, but what I also like about it, you still complete the project on time because you find an alternative solution. So there is a positive outcome you are taking on board the fact that you failed and you are learning from it and that's really important. So the next thing to do, if you want to accelerate your learning even further and make sure you pass your software engineer interview at the first attempt, is click that link right now in the top right hand corner of the video. Head straight through to my website, passmaintivue.com and you can immediately download these slides with those great answers plus an additional 25 brilliant responses to difficult software engineer interview questions. It comes as a PDF guide and that means you can have it in your inbox literally within two minutes from now. Make sure you check out that link also. Please make sure you hit that subscribe button. I genuinely want to help you pass your interview and also progress throughout your career and negotiate to higher salary. I can only do those things if you are subscribed. Please give the video a like because that really does motivate me to create more content for you and don't forget to connect with me on LinkedIn. I have put my LinkedIn link in the description below the video. It is always a pleasure and an honour to connect with like minded professionals such as yourselves. Thank you for watching and I wish you all a very best for passing your software engineer interview. Have a great day.",
  "segments": [
    {
      "id": 0,
      "text": "Hello there, my name is Richard McMunn from CareerVids and in this presentation, I'm"
    },
    {
      "id": 1,
      "text": "going to teach you how to answer behavioral interview questions for software engineers."
    },
    {
      "id": 2,
      "text": "If you are applying to become a software engineer with any company or organization, make"
    },
    {
      "id": 3,
      "text": "sure you stay tuned, watch this presentation from start to finish because I promise to"
    },
    {
      "id": 4,
      "text": "help you pass your interview at the first attempt."
    },
    {
      "id": 5,
      "text": "To achieve that goal, this is what I will cover in this presentation."
    },
    {
      "id": 6,
      "text": "Number one, so I will explain what behavioral interview questions are and why they"
    },
    {
      "id": 7,
      "text": "are used at interviews."
    },
    {
      "id": 8,
      "text": "Number two, I will teach you the best method to use for answering software engineer, behavioral"
    },
    {
      "id": 9,
      "text": "interview questions."
    },
    {
      "id": 10,
      "text": "Number three, I'll then give you lots of examples software engineer, behavioral interview"
    },
    {
      "id": 11,
      "text": "questions and top scoring answers."
    },
    {
      "id": 12,
      "text": "And then finally, number four, I will tell you where you can instantly download these slides"
    },
    {
      "id": 13,
      "text": "plus my full set of 25 great answers to software engineer interview questions in a PDF guide."
    },
    {
      "id": 14,
      "text": "And just very quickly, if you are new to this channel, please make sure you hit that subscribe"
    },
    {
      "id": 15,
      "text": "button."
    },
    {
      "id": 16,
      "text": "Literally thousands of you and I mean thousands of you are passing your interviews at"
    },
    {
      "id": 17,
      "text": "the first attempt."
    },
    {
      "id": 18,
      "text": "I can only help you if you are subscribed and please hit the like button, give this video"
    },
    {
      "id": 19,
      "text": "or like."
    },
    {
      "id": 20,
      "text": "I really do appreciate your support."
    },
    {
      "id": 21,
      "text": "That motivates me to create more content for you."
    },
    {
      "id": 22,
      "text": "Thank you very much indeed."
    },
    {
      "id": 23,
      "text": "So to begin with, what are behavioral interview questions?"
    },
    {
      "id": 24,
      "text": "Well, behavioral interview questions are says how you have dealt with previous workplace"
    },
    {
      "id": 25,
      "text": "situations as a software engineer."
    },
    {
      "id": 26,
      "text": "Now behavioral interview questions often start with either tell me about a time, describe"
    },
    {
      "id": 27,
      "text": "a situation or give an example of when you and then they give the scenario."
    },
    {
      "id": 28,
      "text": "So they could say, tell me about a time when you had to solve a complex code problem or"
    },
    {
      "id": 29,
      "text": "they could say describe a situation when you had to collaborate with a difficult software"
    },
    {
      "id": 30,
      "text": "engineer."
    },
    {
      "id": 31,
      "text": "So how do you answer these difficult behavioral interview questions?"
    },
    {
      "id": 32,
      "text": "Well, I strongly recommend you use the start technique."
    },
    {
      "id": 33,
      "text": "So what is the start technique?"
    },
    {
      "id": 34,
      "text": "Well, the start technique is recognized by all hiring managers and employers as the correct"
    },
    {
      "id": 35,
      "text": "way to answer behavioral interview questions."
    },
    {
      "id": 36,
      "text": "So let's assume you are sat down in the chair or you are undertaking your interview"
    },
    {
      "id": 37,
      "text": "online and the hiring manager says to you, tell me about a time when you had to manage"
    },
    {
      "id": 38,
      "text": "competing deadlines as a software engineer."
    },
    {
      "id": 39,
      "text": "As soon as you hear the interview question, start in that way you should automatically"
    },
    {
      "id": 40,
      "text": "think to yourself, I need to use a start technique when answering this question."
    },
    {
      "id": 41,
      "text": "So start stands for situation, task, action and then result."
    },
    {
      "id": 42,
      "text": "So let me explain what each of those different elements are."
    },
    {
      "id": 43,
      "text": "So the hiring manager asks you a behavioral interview question."
    },
    {
      "id": 44,
      "text": "You start off in you outline the situation you were faced with."
    },
    {
      "id": 45,
      "text": "So you are actually telling them a story about a situation you have previously been in."
    },
    {
      "id": 46,
      "text": "You then move on and outline the task that needed your attention."
    },
    {
      "id": 47,
      "text": "You then move on and give in depth details about the action you took and then finally,"
    },
    {
      "id": 48,
      "text": "finish your answer and talk about the results of your actions."
    },
    {
      "id": 49,
      "text": "And it's really important to make sure the result is a positive outcome for your team"
    },
    {
      "id": 50,
      "text": "or company."
    },
    {
      "id": 51,
      "text": "So let me now give you some examples of behavioral interview questions and answers for"
    },
    {
      "id": 52,
      "text": "software engineers that use the start technique."
    },
    {
      "id": 53,
      "text": "I will tell you where you can download all of the answers."
    },
    {
      "id": 54,
      "text": "You can see in a second how effective this start technique is for answering software"
    },
    {
      "id": 55,
      "text": "engineer behavioral interview questions."
    },
    {
      "id": 56,
      "text": "So the first question I want to tackle is, tell me about the time when you had to solve"
    },
    {
      "id": 57,
      "text": "a complex code problem."
    },
    {
      "id": 58,
      "text": "Here's an example answer that uses a start technique."
    },
    {
      "id": 59,
      "text": "Here we go."
    },
    {
      "id": 60,
      "text": "In a previous software engineering position, I worked on coding problems for an internal"
    },
    {
      "id": 61,
      "text": "department."
    },
    {
      "id": 62,
      "text": "And in experience software engineer had created the code, but was on annual leave."
    },
    {
      "id": 63,
      "text": "So I could not contact him to discuss the issue."
    },
    {
      "id": 64,
      "text": "Therefore, I had to use a common sense approach to solving the problem."
    },
    {
      "id": 65,
      "text": "Now the most common errors, junior software engineers unwittingly make, are syntax and logic."
    },
    {
      "id": 66,
      "text": "Now because the system was generating a wrong solution, I presumed it was a logic error."
    },
    {
      "id": 67,
      "text": "And after further investigation, I confirmed this was the issue."
    },
    {
      "id": 68,
      "text": "Now once the problem had been rectified, I emailed the junior software engineer to explain"
    },
    {
      "id": 69,
      "text": "the problem, I had found and advised him on how to prevent it from reoccurring."
    },
    {
      "id": 70,
      "text": "I recommended that he break down his code into small, manageable chunks and then test"
    },
    {
      "id": 71,
      "text": "it before progressing to the next."
    },
    {
      "id": 72,
      "text": "So that's a really good example answer you are talking about."
    },
    {
      "id": 73,
      "text": "A situation you have previously been in where you solved a difficult coding problem."
    },
    {
      "id": 74,
      "text": "You used a process of elimination."
    },
    {
      "id": 75,
      "text": "And also I like the fact at the end of your answer."
    },
    {
      "id": 76,
      "text": "You are contacting the software engineer to help him or her not make the same error in the"
    },
    {
      "id": 77,
      "text": "future."
    },
    {
      "id": 78,
      "text": "So there's a positive outcome for the team and company."
    },
    {
      "id": 79,
      "text": "It's a really good answer."
    },
    {
      "id": 80,
      "text": "Here's the next behavioral interview question and example answer for software engineers."
    },
    {
      "id": 81,
      "text": "The question is, describe a situation when you had to collaborate with a difficult software"
    },
    {
      "id": 82,
      "text": "engineer."
    },
    {
      "id": 83,
      "text": "So this question is assessing your team working skills and communication capabilities."
    },
    {
      "id": 84,
      "text": "Here's my top scoring response that uses that all important."
    },
    {
      "id": 85,
      "text": "Start technique."
    },
    {
      "id": 86,
      "text": "Here we go."
    },
    {
      "id": 87,
      "text": "The first one is, describe a situation when you had to collaborate with a difficult software"
    },
    {
      "id": 88,
      "text": "engineer."
    },
    {
      "id": 89,
      "text": "I was working on a project for a company client with three other software engineers."
    },
    {
      "id": 90,
      "text": "We all had varying levels of knowledge and expertise which was a strength."
    },
    {
      "id": 91,
      "text": "However, one of the engineers continually insisted his approach to solving the project"
    },
    {
      "id": 92,
      "text": "challenges was right despite data and evidence suggesting otherwise."
    },
    {
      "id": 93,
      "text": "I detected his communication style and arrogance irritated the other engineers."
    },
    {
      "id": 94,
      "text": "So I decided to speak to him in private."
    },
    {
      "id": 95,
      "text": "I wanted the project to run smoothly."
    },
    {
      "id": 96,
      "text": "So decided to stop the conflict before it escalated."
    },
    {
      "id": 97,
      "text": "I explained to the engineer that his expertise and talent were invaluable to the team,"
    },
    {
      "id": 98,
      "text": "but that we needed to focus on the facts and data to progress the project action plan."
    },
    {
      "id": 99,
      "text": "After I'd explained that time was of the essence and that we needed to collaborate solely"
    },
    {
      "id": 100,
      "text": "based on the project objectives he agreed to change communication style."
    },
    {
      "id": 101,
      "text": "So that's a really good answer."
    },
    {
      "id": 102,
      "text": "It shows that you take positive action to diffuse the conflict and you use really good"
    },
    {
      "id": 103,
      "text": "communication style to get your coworker to change their approach to stop that conflict"
    },
    {
      "id": 104,
      "text": "from escalating."
    },
    {
      "id": 105,
      "text": "So it's a really good example answer and it shows that you can collaborate with difficult"
    },
    {
      "id": 106,
      "text": "people to achieve your software engineering project objectives."
    },
    {
      "id": 107,
      "text": "Here's an question."
    },
    {
      "id": 108,
      "text": "Well, before we move on to the next question, I just want to let you know that if at any"
    },
    {
      "id": 109,
      "text": "time you want to download these slides plus an additional 25 great answers to software"
    },
    {
      "id": 110,
      "text": "engineering to be questioned, you can click that link in the top right hand corner of"
    },
    {
      "id": 111,
      "text": "the video."
    },
    {
      "id": 112,
      "text": "Let me move on to that next question and that is, tell me about a time when you had"
    },
    {
      "id": 113,
      "text": "to manage competing deadlines as a software engineer."
    },
    {
      "id": 114,
      "text": "This is a really difficult question, but it is assessing your organization and prioritizing"
    },
    {
      "id": 115,
      "text": "capabilities."
    },
    {
      "id": 116,
      "text": "Can you be left alone to manage competing deadlines?"
    },
    {
      "id": 117,
      "text": "And if so, how do you achieve that goal?"
    },
    {
      "id": 118,
      "text": "Well, here's a brilliant example answer that uses a start technique."
    },
    {
      "id": 119,
      "text": "What I'm about to time when you had to manage competing deadlines, here we go."
    },
    {
      "id": 120,
      "text": "In my last software engineer position, I volunteered to continue the work of a coworker"
    },
    {
      "id": 121,
      "text": "who was on leave for several weeks."
    },
    {
      "id": 122,
      "text": "We were both working on separate time-sensitive projects, but I saw this as an opportunity"
    },
    {
      "id": 123,
      "text": "to help him and the company during a busy period."
    },
    {
      "id": 124,
      "text": "It was my task to prioritize the workload for both projects to ensure the competing"
    },
    {
      "id": 125,
      "text": "deadlines were met."
    },
    {
      "id": 126,
      "text": "I was using a grant chart for my project, so I set up another one for my coworkers to assess"
    },
    {
      "id": 127,
      "text": "priorities and measure progress during the two week period."
    },
    {
      "id": 128,
      "text": "This proved to be a brilliant idea because I quickly determined that there were identical"
    },
    {
      "id": 129,
      "text": "tasks across both projects that could be completed concurrently."
    },
    {
      "id": 130,
      "text": "Now for the tasks requiring separate time allocation, I drew up a list of the priorities,"
    },
    {
      "id": 131,
      "text": "mock-tow all distractions and work quickly and efficiently."
    },
    {
      "id": 132,
      "text": "By being organised and analyzing tasks for both projects and creating a priorities list,"
    },
    {
      "id": 133,
      "text": "I could make excellent progress on both projects while my coworker was on leave."
    },
    {
      "id": 134,
      "text": "So that again shows that you are willing to go above and beyond for the company, you"
    },
    {
      "id": 135,
      "text": "are helping out your coworker and you don't need to be told what to do."
    },
    {
      "id": 136,
      "text": "And you are finding a smart solution because by using two grant charts you can see that"
    },
    {
      "id": 137,
      "text": "there are work areas that you can do concurrently, so it's a really good answer."
    },
    {
      "id": 138,
      "text": "Here's the next behavioral interview question for software engineers."
    },
    {
      "id": 139,
      "text": "Tell me about the time when you had to persuade someone at work."
    },
    {
      "id": 140,
      "text": "This is another trick you want."
    },
    {
      "id": 141,
      "text": "Here's my example answer that uses the start technique to help you pass your interview."
    },
    {
      "id": 142,
      "text": "Tell me about the time when you had to persuade someone at work."
    },
    {
      "id": 143,
      "text": "Here we go."
    },
    {
      "id": 144,
      "text": "In a previous role, there was no uniformity in the software engineering teams project"
    },
    {
      "id": 145,
      "text": "management applications."
    },
    {
      "id": 146,
      "text": "This meant that one week I could work on a project that used Monday.com."
    },
    {
      "id": 147,
      "text": "And the next week I'd be on a project that used resource guru."
    },
    {
      "id": 148,
      "text": "Now this lack of uniformity was not only holding up the progression of software engineering"
    },
    {
      "id": 149,
      "text": "work, but it also meant new team members had to get familiar with various project management"
    },
    {
      "id": 150,
      "text": "tools before they commenced work."
    },
    {
      "id": 151,
      "text": "So I decided to do something about it."
    },
    {
      "id": 152,
      "text": "I researched the best project management applications on the market for software engineers."
    },
    {
      "id": 153,
      "text": "I created a mini presentation highlighting the benefits of using the one I felt most suited"
    },
    {
      "id": 154,
      "text": "the business strategic goals."
    },
    {
      "id": 155,
      "text": "I then met with my team and manager and presented my findings."
    },
    {
      "id": 156,
      "text": "At the end of the presentation, my manager thought it was a great idea and she took"
    },
    {
      "id": 157,
      "text": "steps to change company policy so that only one project management tool was used and"
    },
    {
      "id": 158,
      "text": "everyone had the appropriate training in its operation."
    },
    {
      "id": 159,
      "text": "That's a really good answer."
    },
    {
      "id": 160,
      "text": "It shows that you can see that there is a problem in the software engineering team."
    },
    {
      "id": 161,
      "text": "You want to create a solution that speeds up the progression of work and and a lot of the"
    },
    {
      "id": 162,
      "text": "fact that you are creating a presentation, presenting it to your manager and team and then"
    },
    {
      "id": 163,
      "text": "they are taking it forward to improve the business."
    },
    {
      "id": 164,
      "text": "So it's a really good example that comes out with a positive result."
    },
    {
      "id": 165,
      "text": "Don't forget, make sure that when you're using the start technique, the result is a positive"
    },
    {
      "id": 166,
      "text": "one for your team or company."
    },
    {
      "id": 167,
      "text": "Here is the next question."
    },
    {
      "id": 168,
      "text": "The next behavioral interview question for software engineers and that is."
    },
    {
      "id": 169,
      "text": "Tell me about the time when you failed at work."
    },
    {
      "id": 170,
      "text": "Now sometimes people respond by saying, I've never failed."
    },
    {
      "id": 171,
      "text": "I'm really good at my work."
    },
    {
      "id": 172,
      "text": "I will not let you down."
    },
    {
      "id": 173,
      "text": "I don't fail."
    },
    {
      "id": 174,
      "text": "That is not what this question is assessing."
    },
    {
      "id": 175,
      "text": "This question is assessing two things."
    },
    {
      "id": 176,
      "text": "Number one, your honesty and number two, how you respond to failure."
    },
    {
      "id": 177,
      "text": "Do you learn from it?"
    },
    {
      "id": 178,
      "text": "Do you accept responsibility, take ownership and then move forward?"
    },
    {
      "id": 179,
      "text": "That's what they are looking for."
    },
    {
      "id": 180,
      "text": "So here's my example answer to help you."
    },
    {
      "id": 181,
      "text": "Tell me about the time when you failed at work."
    },
    {
      "id": 182,
      "text": "Here we go."
    },
    {
      "id": 183,
      "text": "In my previous software engineering position."
    },
    {
      "id": 184,
      "text": "I was tasked with estimating the time it would take to create a web application for"
    },
    {
      "id": 185,
      "text": "the company."
    },
    {
      "id": 186,
      "text": "I'd done this type of work many times before, so I was confident it wouldn't take long."
    },
    {
      "id": 187,
      "text": "It was my task to estimate the time for the project, create a plan of action and put"
    },
    {
      "id": 188,
      "text": "forward a working proposal to my manager before setting to work."
    },
    {
      "id": 189,
      "text": "I anticipated it would take 10 days to complete the work."
    },
    {
      "id": 190,
      "text": "Now unfortunately, I made a foolish mistake and failed to consult a colleague of mine who"
    },
    {
      "id": 191,
      "text": "I needed to carry out some development work on the project."
    },
    {
      "id": 192,
      "text": "After I'd submitted my proposal and it was accepted, I learned that my colleague was"
    },
    {
      "id": 193,
      "text": "on holiday for that period."
    },
    {
      "id": 194,
      "text": "To ensure the project was still completed, I contacted a colleague from my network of software"
    },
    {
      "id": 195,
      "text": "engineers and he agreed to carry out the development work for me."
    },
    {
      "id": 196,
      "text": "Now although the project was still completed, I learned a tremendous amount from that"
    },
    {
      "id": 197,
      "text": "experience and now make sure I double check my action plans and work schedules before submitting"
    },
    {
      "id": 198,
      "text": "them."
    },
    {
      "id": 199,
      "text": "So that's an honest answer, but what I also like about it, you still complete the project"
    },
    {
      "id": 200,
      "text": "on time because you find an alternative solution."
    },
    {
      "id": 201,
      "text": "So there is a positive outcome you are taking on board the fact that you failed and you"
    },
    {
      "id": 202,
      "text": "are learning from it and that's really important."
    },
    {
      "id": 203,
      "text": "So the next thing to do, if you want to accelerate your learning even further and make sure"
    },
    {
      "id": 204,
      "text": "you pass your software engineer interview at the first attempt, is click that link right"
    },
    {
      "id": 205,
      "text": "now in the top right hand corner of the video."
    },
    {
      "id": 206,
      "text": "Head straight through to my website, passmaintivue.com and you can immediately download"
    },
    {
      "id": 207,
      "text": "these slides with those great answers plus an additional 25 brilliant responses to difficult"
    },
    {
      "id": 208,
      "text": "software engineer interview questions."
    },
    {
      "id": 209,
      "text": "It comes as a PDF guide and that means you can have it in your inbox literally within"
    },
    {
      "id": 210,
      "text": "two minutes from now."
    },
    {
      "id": 211,
      "text": "Make sure you check out that link also."
    },
    {
      "id": 212,
      "text": "Please make sure you hit that subscribe button."
    },
    {
      "id": 213,
      "text": "I genuinely want to help you pass your interview and also progress throughout your career"
    },
    {
      "id": 214,
      "text": "and negotiate to higher salary."
    },
    {
      "id": 215,
      "text": "I can only do those things if you are subscribed."
    },
    {
      "id": 216,
      "text": "Please give the video a like because that really does motivate me to create more content"
    },
    {
      "id": 217,
      "text": "for you and don't forget to connect with me on LinkedIn."
    },
    {
      "id": 218,
      "text": "I have put my LinkedIn link in the description below the video."
    },
    {
      "id": 219,
      "text": "It is always a pleasure and an honour to connect with like minded professionals such as"
    },
    {
      "id": 220,
      "text": "yourselves."
    },
    {
      "id": 221,
      "text": "Thank you for watching and I wish you all a very best for passing your software engineer interview."
    },
    {
      "id": 222,
      "text": "Have a great day."
    }
  ]
}