{
  "file": "laXUWhJXpso.wav",
  "text": " Hello there, my name is Richard McMann from HowToBecome.com and in this tutorial I am going to teach you how to prepare for an Amazon job test and interview. And in particular I am going to focus on the very important Amazon leadership principles. If you are applying for any job role with Amazon you need to learn and understand the 16 Amazon leadership principles. So in this tutorial to help you prepare for your Amazon job selection process, this is what I will cover. So I will teach you the Amazon leadership principles and I will also explain why they are so important. Seriously, they are critical to your success. I will then give you some sample Amazon leadership principles, test questions to try live on the screen. So the aim is to develop your knowledge and understanding of the Amazon leadership principles because that will help you to pass your test and your interview. I will give you some Amazon leadership principles, interview questions to prepare for again, these are really important. And I will then tell you how you can access further downloadable resources to help you pass your Amazon test or your Amazon interview. And just very quickly if you are new to the channel, please make sure you hit that subscribe button. Lots of you and I mean lots of you are passing your tests and your interviews as a result of these tutorials. I can only help you if you are subscribed and please just hit the like button because that tells me you find these tutorials useful. Thank you very much. So to start with what are the Amazon leadership principles? Well, the 16 leadership principles are used every day in Amazon's work, including whenever exploring new product and service ideas or whenever they need to overcome difficult and challenging problems. So they want all of their employees to know the Amazon leadership principles and use them in their everyday work. They are basically the foundations of Amazon's success and in my opinion, Amazon is the greatest company in the world. And predominantly the reason why they have had so much success is because they hire the right people and they want those people to follow and use the 16 leadership principles. So you will be assessed against your knowledge understanding and experience of the 16 Amazon leadership principles. Therefore, you need to know them and understand them. And if you know them and understand them, it makes it far easier for you to get hired with this brilliant organisation. So let's now take a look at a quick overview of the 16 Amazon leadership principles and I will then work through some test questions with you and also give you more importantly some Amazon leadership principles into your questions to prepare for. So the 16 Amazon leadership principles briefly are customer obsession. Now Amazon obsesses over its customers. I use Amazon virtually every day. I think in the last month, I've placed over 30 orders. And I use Amazon because their customer service is so good. If there are any problems, I can contact them online and they will sort it out straight away. Amazon has been so successful because it obsesses over its customers. The next one in particular order is frugality. Now frugality is making sure that you look after resources you use them sparringly because the success of a business or an organisation such as Amazon isn't just focused on its turnover, how much it makes. It's also focused on keeping an eye on profits. So it expects all of its staff to take care of resources and supplies. The next one is that leaders are right a lot of the time. So leaders have the experience and the knowledge at Amazon to make the right decisions. The next one is deliver results. When you work at Amazon, you will be expected to deliver results. It's really important. And that brings me on to the next one which is a bias for action. There's a once people who work for its company to take action, to act with speed and not be afraid to take risks. The next one is learning be curious. So you need to be willing as an Amazon employee to always learn, be open to learning and also be curious. Look into things, find out how things work. The next one is that Amazon always hire and develops the best people. They want to raise the bar every time they hire someone new. And they also want to develop people. So if you were working at Amazon and someone in your team had the potential to progress, you should help them develop the right skills to progress through the organization because then that helps Amazon maintain its position as the number one e-commerce website in the world. The next Amazon leadership principle is a really important one which is dive deep. Amazon expects it to start to look into information and data carefully to dive deep into it because then that gives you the information and data to make the right decisions and to continually improve. The next one is that all Amazon employees should think big. Okay, think big and create brilliant products and services for their customers. So the next of our 16 Amazon leadership principles is insist on the highest standards. And this is definitely one of my favorites because in an organization such as Amazon, if you always insist everyone works to the highest standards achievable, you will gain success. The next leadership principle is invent and simplify. Amazon, once it's employees to come up with brilliant ideas that improve the efficiency of the company and the customer experience and they want to make things as simple as possible. The next leadership principle is strive to be the best employer. So Amazon takes its responsibility seriously. It wants everyone to be safe while they are at work. And it also wants to make sure that it employees a diverse workforce because diversity in any workforce is only a good thing. And it also takes responsibility for the impact it has on our environment. The next one of our 16 Amazon leadership principles is success and scale. Bring broad responsibility again. Amazon because of its success understands that it needs to take responsibility for its actions. The next leadership principle is to have backbone, disagree and then commit. So while that means it's, it wants its employees to not be afraid to disagree if they think something is wrong or if it can be done in a more efficient and effective manner. But it then also wants people to commit to the general consensus of what people are doing in the organization to succeed. And finally, the 16th Amazon leadership principle is earned trust. So you have to build trust between your team members, build trust with customers. And that will help the organization to succeed. So there's the 16 Amazon leadership principles, a brief overview. My interpretation of those leadership principles. So what we will now do is start taking a look at some Amazon leadership principles. Test questions to help you develop your knowledge and your understanding of them. Because as I mentioned previously, the Amazon leadership principles are crucial to your success. So the first question that I want to work through is based on the Amazon leadership principle of customer obsession. So just a quick recap, Amazon is obsessed with its customers, obsessed with giving out standing customer service and also creating products and services that make their customers lives better. So question one states, read the following information before choosing your answer. So I will put up on the screen a scenario and I will then give you four answer options. You choose which answer option you would go for based on the leadership principle of customer obsession. So the statement is, you are working as a customer service representative and a customer calls you during your schedule tea break to complain about the delay in receiving a product they have ordered. Now the customer paid for a 24 hour priority delivery service, but 48 hours have now passed. Answer product is ordered and dispatched. It is in the hands of a third party career company. What would you do in this situation? Answer option A. Ask the customer to call you back in 30 minutes once your tea break has finished. You will then deal with their complaint. Answer option B, apologise to the customer for the delay in them receiving their product. Ask for their order number until the customer, you will investigate the issue and call them back within the hour with an update. Contact the career company to obtain an exact delivery date before updating the customer and refunding their priority delivery fee. Logic complaint with a career company, it is important to make sure the situation does not happen again. Answer option C, apologise to the customer, but inform them that a third party career company takes care of company deliveries and it is therefore out of your hands. Tell the customer you will refund the fee they paid for the priority delivery service or answer option D, apologise to the customer for the delay in them receiving their product. Ask for their order number before telling the customer to contact the career company themselves to obtain an exact delivery date and time. Explain to the customer that all orders are handled by a third party career company for which you have no control. So which answer option would you choose? In my opinion, the only one that is relevant and suitable to customer obsession is answer option B. That is what Amazon would do in that scenario. If you choose any of the other three, you are not demonstrating customer obsession, which is being obsessed with customers, obsessed with giving outstanding customer service. So now it is your turn to try one live on the screen. So I want to tell you the answer or want you to tell me the answer to question number two in the comment section below the video please and I will come on here each day and mark your answers for you. So this Amazon leadership principle is based on fruit gallery. So question number two, read the following information before choosing your answer. You are working in an office and you feel the way office supplies are ordered is ineffective. Everyone in the team has the power to order office supplies as and when they need them. This results in several deliveries each week to the office which is costing the company expensive curry of fees. What would you do? Answer option A. This situation is the responsibility of your supervisor. If they are happy with the way office supplies are ordered, so be it. Answer option B. This situation is the responsibility of your supervisor, inform them about your concerns, so they can make a decision on what to do moving forward. Answer option C. Raise your concerns during the next team meeting and ask everyone to be more mindful about how they order supplies or answer option D. Do some research and obtain information that backs up your concerns. Create a proposal for how you think the team should order supplies moving forward to limit waste and then present your ideas to your manager for consideration. Now there is a timer on the right hand side. You have 10 seconds to put your answer option in the comment section below the video. Here's a time. And don't forget that leadership principle is based on fruitality. Is your answer option A. B. C. or D. Now don't go anywhere because I still have many more questions and answers to work through review that will help you prepare fully for the Amazon selection process. But when you're ready, click that link in the top right hand corner of the video. Head through to my website how to become.com and you can download my full set of Amazon leadership principles, test questions and also some brilliant answers to Amazon leadership principles into view questions. It's a great resource. Make sure you check that out when you are ready. Let's now work through Amazon leadership principles, test question number three and this is based on higher and develop the best. So question three read the following information before choosing your answer. You are working as a manager in a large organization and one of your best performing members of staff wants to go for a promotion. They need your approval to apply for the promotion. Now they have only been with the company for six months and they are relatively young. If they get promoted, they will move to a different department and you will lose your strongest team member. What would you do? Don't forget to focus on the leadership principle. Answer option A. Support them in their pursuit to get promoted. Now the needs of the organization come before the needs of your team and it's important that you encourage and develop talent because this helps the business grow. Their age and time with the company are irrelevant. Answer option B. Do not support them in their pursuit to get promoted because they are the strongest member of your team and they have only been with the company for a few months. You don't feel the time is right for them to get promoted. Answer options C. In form them, you will consider supporting them in the future once they have gained more experience. Tell them they are young and inexperienced but you will coach them over the next few months to help them prepare for future promotion. Or answer option D. In form them, they are your strongest performing team member and you cannot afford to lose them. Tell them you are sorry but you cannot support their application. Explain that once a new team member comes who is as good as they are, you will reconsider. Which answer option would you choose A. B. C. Or D. Well the only one that is relevant to Amazon's leadership principle is A. Support them in their pursuit to get promoted. The needs of the organization come before the needs of your team and it's important you encourage and develop talent because this helps the business grow. So don't forget the leadership principle of hiring develop the best means that this answer shows your ability to encourage and support talent. You understand that the needs of the organization must come first and your selfless approach to this situation identifies high performing members of staff, their needs and how they can help the organization progress. So now it's your turn to try another one on your own live on the screen. Please put your answer to question four in the comment section below for marking. Thank you. So this Amazon leadership principle is based on strive to be the Earth's best employer. Don't forget being an Amazon employee means making sure the working environment is safe productive and responsible. Amazon understands the importance of having a diverse workforce and it takes its responsibility seriously in respect of the environment. So again I will put the passage up on the screen and you choose the answer option which you would follow if you were working at Amazon. Here we go. You are walking through the warehouse whilst working at Amazon. When you notice a member of staff not wearing the correct personal protective clothing. Now the member of staff is not your responsibility from a management point of view. But what would you do in this scenario? A. Now because I am not managing the member of staff, they are not my responsibility. It is the responsibility of their manager to enforce company safety rules and so option B. Speak to the member of staff and ask them why they aren't wearing the appropriate personal protective clothing. If they don't have a valid reason, ask them to start wearing it immediately. Answer option C. Speak to the member of staff and ask them why they aren't wearing the appropriate personal protective clothing. If they don't have a valid reason, tell their manager so they can take the appropriate disciplinary reaction or answer option D. Speak to the member of staff and ask them why they aren't wearing the appropriate personal protective clothing. Now if they They don't have a valid reason. Awesome to start wearing it immediately and explain why. It is so important to wear the clothing at work and follow company rules. You have 10 seconds to put your answer in the comment section below the video. Here's your timer. Fantastic. We're making brilliant progress in helping you prepare for the Amazon selection process. So now it's time to try another one. Another Amazon leadership principles test question. Again, put your answer to question five in the comments section below the video. This one is based on bias for action. This is a difficult one. Tell me what you would do in this scenario. Don't forget bias for action is working fast and getting things done. And that's the difference between success and failure at Amazon. So Amazon encourages calculated risks that help the business move forward and maintain its position as the world's number one e-commerce website. Here we go. Read the following passage before choosing your answer. You work for a company that has just had its best financial year ever. You are holding a team meeting and a member of staff comes up with a new product idea. Now they present their idea to you. And whilst it appears to be an idea that could significantly improve the company's turnover, it is costly to develop and launch. What would you do in this situation? Answer option A. Thank them for putting forward their idea but explain the cost is too expensive. The company has just had its best financial year ever and you don't want to risk spending money on something that might not work. Answer option B. Thank them for putting forward their idea and agree to allocate the money to its development and launch. Answer option C. Thank them for putting forward their idea. Glory their idea in greater detail to establish its viability and the exact costs versus the potential return. Now with the data and information makes business sense, go ahead and develop and launch the product. Answer option D. Thank them for putting forward their idea. Tell them the company has had its best financial year ever and you don't want to agree to it just yet. However, you will explore their idea at a later stage. Tell me in the comment section below which answer option you would choose. What would you do in that situation? Here's the 10 second timer. You can see that all of these questions are helping you. These scenarios are helping you to develop your understanding and knowledge of the Amazon leadership principles. What I now want to do is move on and take a look at some Amazon leadership principles into you questions. So you will be assessed against the leadership principles during your forthcoming Amazon interview. The first question we will look at is, tell me about a time when you are to work with limited time or resources. Now this is based on deliver results which is basically get things done on time and to the required standard. Amazon employees are never held back by setbacks or remember that. Now the best way before I give you an example answer to structure your answers to Amazon leadership principles into your questions is to use a start technique. So the start technique stands for situation, task, action and result. So you start off by outlining the situation you were faced with. You then give brief details about the task that needed doing. You then go into specific details about the action you took to complete the task and then finally you finish off and tell the interviewer the results following your actions. Let me now give you an example answer to that difficult Amazon leadership principles interview question. Tell me about a time when you had to work with limited time or resources that utilizes a start technique. Here we go. In my previous job I was working as part of a team on a very important time-sensitive project. Partway through the project, two team members went off sick which placed enormous pressure on the project due to the lack of resources. It was my responsibility to find a solution to this problem then ensure the project still got delivered on time and to the right standards. So I called a team meeting with the remaining team members and encouraged everyone to put forward their ideas as to how we could get through this challenge. I suggested which commit extra hours to the project and assess which elements we could outsource online to experience and qualified freelancers. Everyone agreed to these ideas and I started assessing which tasks could be outsourced. Now after several hours analysing the project tasks and seeking suitable freelancers online I managed to find someone to be qualified who could do the work we needed. After each team member had committed to an additional three hours work per week and by using the freelancer we still managed to get the project delivered for our company on time and to the expected standard. It's not a really good answer because it is a situational response of situation that perhaps you've been in previously. You give details about the action you took. Now a lot of people would simply go to their manager and say, you know we're a couple of staff down what do we do but you are taking the initiative you are thinking on your feet and you are not being overcome by that setback and that's what Amazon wants people to not be afraid of setbacks to come up with innovative ideas to make sure things are done on time. Let's quickly look at more Amazon leadership principles, interview questions that I recommend you prepare for. Tell me about a time when you took responsibility for a task outside of your job description. The next one, tell me about a time when you found a simple solution to a complex problem. Tell me about a time when you had to make an unpopular decision. That's a difficult one. The next one, tell me about a time when you challenged someone's decision. Here's some more. Tell me about a time when you influenced a positive change in an organization. Tell me about a time when you came up with an idea that improved the efficiency of an organization. Tell me about a time when you exceeded a customer's expectations and tell me about a time when you had to work with limited information or data. These are all really difficult. Amazon interview questions to prepare for. If you would like further help, the next thing to do is click that link right now in the top right-hand corner of the video. Head through to my website how to become.com and you can download my Amazon leadership principles, test questions and answers and also brilliant example responses to all of those are more Amazon leadership principles interview questions. It's a fantastic resource. Make sure you check that out right now. Finally, don't forget to hit that subscribe button. I love helping you guys prepare for your job interviews. I can only do that if you are subscribed. Please give the video a like because that motivates me to create more content for you. And don't forget to connect with me on LinkedIn. I have put my LinkedIn link in the description below the video. It's always good to connect with light minded professionals such as yourself. Thank you so much for watching and for supporting my channel and I wish you all the best for passing your Amazon test or interview have a brilliant day.",
  "segments": [
    {
      "id": 0,
      "text": "Hello there, my name is Richard McMann from HowToBecome.com and in this tutorial I am going"
    },
    {
      "id": 1,
      "text": "to teach you how to prepare for an Amazon job test and interview."
    },
    {
      "id": 2,
      "text": "And in particular I am going to focus on the very important Amazon leadership principles."
    },
    {
      "id": 3,
      "text": "If you are applying for any job role with Amazon you need to learn and understand the"
    },
    {
      "id": 4,
      "text": "16 Amazon leadership principles."
    },
    {
      "id": 5,
      "text": "So in this tutorial to help you prepare for your Amazon job selection process, this is"
    },
    {
      "id": 6,
      "text": "what I will cover."
    },
    {
      "id": 7,
      "text": "So I will teach you the Amazon leadership principles and I will also explain why they are so"
    },
    {
      "id": 8,
      "text": "important."
    },
    {
      "id": 9,
      "text": "Seriously, they are critical to your success."
    },
    {
      "id": 10,
      "text": "I will then give you some sample Amazon leadership principles, test questions to try live"
    },
    {
      "id": 11,
      "text": "on the screen."
    },
    {
      "id": 12,
      "text": "So the aim is to develop your knowledge and understanding of the Amazon leadership principles"
    },
    {
      "id": 13,
      "text": "because that will help you to pass your test and your interview."
    },
    {
      "id": 14,
      "text": "I will give you some Amazon leadership principles, interview questions to prepare for again,"
    },
    {
      "id": 15,
      "text": "these are really important."
    },
    {
      "id": 16,
      "text": "And I will then tell you how you can access further downloadable resources to help you pass"
    },
    {
      "id": 17,
      "text": "your Amazon test or your Amazon interview."
    },
    {
      "id": 18,
      "text": "And just very quickly if you are new to the channel, please make sure you hit that subscribe"
    },
    {
      "id": 19,
      "text": "button."
    },
    {
      "id": 20,
      "text": "Lots of you and I mean lots of you are passing your tests and your interviews as a result"
    },
    {
      "id": 21,
      "text": "of these tutorials."
    },
    {
      "id": 22,
      "text": "I can only help you if you are subscribed and please just hit the like button because"
    },
    {
      "id": 23,
      "text": "that tells me you find these tutorials useful."
    },
    {
      "id": 24,
      "text": "Thank you very much."
    },
    {
      "id": 25,
      "text": "So to start with what are the Amazon leadership principles?"
    },
    {
      "id": 26,
      "text": "Well, the 16 leadership principles are used every day in Amazon's work, including whenever"
    },
    {
      "id": 27,
      "text": "exploring new product and service ideas or whenever they need to overcome difficult and"
    },
    {
      "id": 28,
      "text": "challenging problems."
    },
    {
      "id": 29,
      "text": "So they want all of their employees to know the Amazon leadership principles and use them"
    },
    {
      "id": 30,
      "text": "in their everyday work."
    },
    {
      "id": 31,
      "text": "They are basically the foundations of Amazon's success and in my opinion, Amazon is the"
    },
    {
      "id": 32,
      "text": "greatest company in the world."
    },
    {
      "id": 33,
      "text": "And predominantly the reason why they have had so much success is because they hire the"
    },
    {
      "id": 34,
      "text": "right people and they want those people to follow and use the 16 leadership principles."
    },
    {
      "id": 35,
      "text": "So you will be assessed against your knowledge understanding and experience of the 16"
    },
    {
      "id": 36,
      "text": "Amazon leadership principles."
    },
    {
      "id": 37,
      "text": "Therefore, you need to know them and understand them."
    },
    {
      "id": 38,
      "text": "And if you know them and understand them, it makes it far easier for you to get hired with"
    },
    {
      "id": 39,
      "text": "this brilliant organisation."
    },
    {
      "id": 40,
      "text": "So let's now take a look at a quick overview of the 16 Amazon leadership principles"
    },
    {
      "id": 41,
      "text": "and I will then work through some test questions with you and also give you more importantly"
    },
    {
      "id": 42,
      "text": "some Amazon leadership principles into your questions to prepare for."
    },
    {
      "id": 43,
      "text": "So the 16 Amazon leadership principles briefly are customer obsession."
    },
    {
      "id": 44,
      "text": "Now Amazon obsesses over its customers."
    },
    {
      "id": 45,
      "text": "I use Amazon virtually every day."
    },
    {
      "id": 46,
      "text": "I think in the last month, I've placed over 30 orders."
    },
    {
      "id": 47,
      "text": "And I use Amazon because their customer service is so good."
    },
    {
      "id": 48,
      "text": "If there are any problems, I can contact them online and they will sort it out straight"
    },
    {
      "id": 49,
      "text": "away."
    },
    {
      "id": 50,
      "text": "Amazon has been so successful because it obsesses over its customers."
    },
    {
      "id": 51,
      "text": "The next one in particular order is frugality."
    },
    {
      "id": 52,
      "text": "Now frugality is making sure that you look after resources you use them sparringly because"
    },
    {
      "id": 53,
      "text": "the success of a business or an organisation such as Amazon isn't just focused on its"
    },
    {
      "id": 54,
      "text": "turnover, how much it makes."
    },
    {
      "id": 55,
      "text": "It's also focused on keeping an eye on profits."
    },
    {
      "id": 56,
      "text": "So it expects all of its staff to take care of resources and supplies."
    },
    {
      "id": 57,
      "text": "The next one is that leaders are right a lot of the time."
    },
    {
      "id": 58,
      "text": "So leaders have the experience and the knowledge at Amazon to make the right decisions."
    },
    {
      "id": 59,
      "text": "The next one is deliver results."
    },
    {
      "id": 60,
      "text": "When you work at Amazon, you will be expected to deliver results."
    },
    {
      "id": 61,
      "text": "It's really important."
    },
    {
      "id": 62,
      "text": "And that brings me on to the next one which is a bias for action."
    },
    {
      "id": 63,
      "text": "There's a once people who work for its company to take action, to act with speed and not"
    },
    {
      "id": 64,
      "text": "be afraid to take risks."
    },
    {
      "id": 65,
      "text": "The next one is learning be curious."
    },
    {
      "id": 66,
      "text": "So you need to be willing as an Amazon employee to always learn, be open to learning and"
    },
    {
      "id": 67,
      "text": "also be curious."
    },
    {
      "id": 68,
      "text": "Look into things, find out how things work."
    },
    {
      "id": 69,
      "text": "The next one is that Amazon always hire and develops the best people."
    },
    {
      "id": 70,
      "text": "They want to raise the bar every time they hire someone new."
    },
    {
      "id": 71,
      "text": "And they also want to develop people."
    },
    {
      "id": 72,
      "text": "So if you were working at Amazon and someone in your team had the potential to progress,"
    },
    {
      "id": 73,
      "text": "you should help them develop the right skills to progress through the organization because"
    },
    {
      "id": 74,
      "text": "then that helps Amazon maintain its position as the number one e-commerce website in the"
    },
    {
      "id": 75,
      "text": "world."
    },
    {
      "id": 76,
      "text": "The next Amazon leadership principle is a really important one which is dive deep."
    },
    {
      "id": 77,
      "text": "Amazon expects it to start to look into information and data carefully to dive deep into"
    },
    {
      "id": 78,
      "text": "it because then that gives you the information and data to make the right decisions and"
    },
    {
      "id": 79,
      "text": "to continually improve."
    },
    {
      "id": 80,
      "text": "The next one is that all Amazon employees should think big."
    },
    {
      "id": 81,
      "text": "Okay, think big and create brilliant products and services for their customers."
    },
    {
      "id": 82,
      "text": "So the next of our 16 Amazon leadership principles is insist on the highest standards."
    },
    {
      "id": 83,
      "text": "And this is definitely one of my favorites because in an organization such as Amazon,"
    },
    {
      "id": 84,
      "text": "if you always insist everyone works to the highest standards achievable, you will gain"
    },
    {
      "id": 85,
      "text": "success."
    },
    {
      "id": 86,
      "text": "The next leadership principle is invent and simplify."
    },
    {
      "id": 87,
      "text": "Amazon, once it's employees to come up with brilliant ideas that improve the efficiency"
    },
    {
      "id": 88,
      "text": "of the company and the customer experience and they want to make things as simple as possible."
    },
    {
      "id": 89,
      "text": "The next leadership principle is strive to be the best employer."
    },
    {
      "id": 90,
      "text": "So Amazon takes its responsibility seriously."
    },
    {
      "id": 91,
      "text": "It wants everyone to be safe while they are at work."
    },
    {
      "id": 92,
      "text": "And it also wants to make sure that it employees a diverse workforce because diversity in"
    },
    {
      "id": 93,
      "text": "any workforce is only a good thing."
    },
    {
      "id": 94,
      "text": "And it also takes responsibility for the impact it has on our environment."
    },
    {
      "id": 95,
      "text": "The next one of our 16 Amazon leadership principles is success and scale."
    },
    {
      "id": 96,
      "text": "Bring broad responsibility again."
    },
    {
      "id": 97,
      "text": "Amazon because of its success understands that it needs to take responsibility for its actions."
    },
    {
      "id": 98,
      "text": "The next leadership principle is to have backbone, disagree and then commit."
    },
    {
      "id": 99,
      "text": "So while that means it's, it wants its employees to not be afraid to disagree if they think"
    },
    {
      "id": 100,
      "text": "something is wrong or if it can be done in a more efficient and effective manner."
    },
    {
      "id": 101,
      "text": "But it then also wants people to commit to the general consensus of what people are doing"
    },
    {
      "id": 102,
      "text": "in the organization to succeed."
    },
    {
      "id": 103,
      "text": "And finally, the 16th Amazon leadership principle is earned trust."
    },
    {
      "id": 104,
      "text": "So you have to build trust between your team members, build trust with customers."
    },
    {
      "id": 105,
      "text": "And that will help the organization to succeed."
    },
    {
      "id": 106,
      "text": "So there's the 16 Amazon leadership principles, a brief overview."
    },
    {
      "id": 107,
      "text": "My interpretation of those leadership principles."
    },
    {
      "id": 108,
      "text": "So what we will now do is start taking a look at some Amazon leadership principles."
    },
    {
      "id": 109,
      "text": "Test questions to help you develop your knowledge and your understanding of them."
    },
    {
      "id": 110,
      "text": "Because as I mentioned previously, the Amazon leadership principles are crucial to your success."
    },
    {
      "id": 111,
      "text": "So the first question that I want to work through is based on the Amazon leadership principle"
    },
    {
      "id": 112,
      "text": "of customer obsession."
    },
    {
      "id": 113,
      "text": "So just a quick recap, Amazon is obsessed with its customers,"
    },
    {
      "id": 114,
      "text": "obsessed with giving out standing customer service and also creating products and services"
    },
    {
      "id": 115,
      "text": "that make their customers lives better."
    },
    {
      "id": 116,
      "text": "So question one states, read the following information before choosing your answer."
    },
    {
      "id": 117,
      "text": "So I will put up on the screen a scenario and I will then give you four answer options."
    },
    {
      "id": 118,
      "text": "You choose which answer option you would go for based on the leadership principle of customer obsession."
    },
    {
      "id": 119,
      "text": "So the statement is, you are working as a customer service representative"
    },
    {
      "id": 120,
      "text": "and a customer calls you during your schedule tea break to complain about the delay in receiving"
    },
    {
      "id": 121,
      "text": "a product they have ordered."
    },
    {
      "id": 122,
      "text": "Now the customer paid for a 24 hour priority delivery service, but 48 hours have now passed."
    },
    {
      "id": 123,
      "text": "Answer product is ordered and dispatched."
    },
    {
      "id": 124,
      "text": "It is in the hands of a third party career company."
    },
    {
      "id": 125,
      "text": "What would you do in this situation?"
    },
    {
      "id": 126,
      "text": "Answer option A."
    },
    {
      "id": 127,
      "text": "Ask the customer to call you back in 30 minutes once your tea break has finished."
    },
    {
      "id": 128,
      "text": "You will then deal with their complaint."
    },
    {
      "id": 129,
      "text": "Answer option B, apologise to the customer for the delay in them receiving their product."
    },
    {
      "id": 130,
      "text": "Ask for their order number until the customer, you will investigate the issue and call them back"
    },
    {
      "id": 131,
      "text": "within the hour with an update."
    },
    {
      "id": 132,
      "text": "Contact the career company to obtain an exact delivery date before updating the customer and"
    },
    {
      "id": 133,
      "text": "refunding their priority delivery fee."
    },
    {
      "id": 134,
      "text": "Logic complaint with a career company, it is important to make sure the situation does not happen again."
    },
    {
      "id": 135,
      "text": "Answer option C, apologise to the customer, but inform them that a third party career company"
    },
    {
      "id": 136,
      "text": "takes care of company deliveries and it is therefore out of your hands."
    },
    {
      "id": 137,
      "text": "Tell the customer you will refund the fee they paid for the priority delivery service or answer"
    },
    {
      "id": 138,
      "text": "option D, apologise to the customer for the delay in them receiving their product."
    },
    {
      "id": 139,
      "text": "Ask for their order number before telling the customer to contact the career company themselves"
    },
    {
      "id": 140,
      "text": "to obtain an exact delivery date and time."
    },
    {
      "id": 141,
      "text": "Explain to the customer that all orders are handled by a third party career company"
    },
    {
      "id": 142,
      "text": "for which you have no control."
    },
    {
      "id": 143,
      "text": "So which answer option would you choose?"
    },
    {
      "id": 144,
      "text": "In my opinion, the only one that is relevant and suitable to customer obsession is answer"
    },
    {
      "id": 145,
      "text": "option B. That is what Amazon would do in that scenario."
    },
    {
      "id": 146,
      "text": "If you choose any of the other three, you are not demonstrating customer obsession, which is"
    },
    {
      "id": 147,
      "text": "being obsessed with customers, obsessed with giving outstanding customer service."
    },
    {
      "id": 148,
      "text": "So now it is your turn to try one live on the screen."
    },
    {
      "id": 149,
      "text": "So I want to tell you the answer or want you to tell me the answer to question number two in the"
    },
    {
      "id": 150,
      "text": "comment section below the video please and I will come on here each day and mark your answers for you."
    },
    {
      "id": 151,
      "text": "So this Amazon leadership principle is based on fruit gallery."
    },
    {
      "id": 152,
      "text": "So question number two, read the following information before choosing your answer."
    },
    {
      "id": 153,
      "text": "You are working in an office and you feel the way office supplies are ordered is ineffective."
    },
    {
      "id": 154,
      "text": "Everyone in the team has the power to order office supplies as and when they need them."
    },
    {
      "id": 155,
      "text": "This results in several deliveries each week to the office which is costing the company"
    },
    {
      "id": 156,
      "text": "expensive curry of fees. What would you do? Answer option A. This situation is the responsibility"
    },
    {
      "id": 157,
      "text": "of your supervisor. If they are happy with the way office supplies are ordered, so be it."
    },
    {
      "id": 158,
      "text": "Answer option B. This situation is the responsibility of your supervisor, inform them about your concerns,"
    },
    {
      "id": 159,
      "text": "so they can make a decision on what to do moving forward. Answer option C."
    },
    {
      "id": 160,
      "text": "Raise your concerns during the next team meeting and ask everyone to be more mindful about"
    },
    {
      "id": 161,
      "text": "how they order supplies or answer option D. Do some research and obtain information that backs"
    },
    {
      "id": 162,
      "text": "up your concerns. Create a proposal for how you think the team should order supplies moving forward"
    },
    {
      "id": 163,
      "text": "to limit waste and then present your ideas to your manager for consideration. Now there is a"
    },
    {
      "id": 164,
      "text": "timer on the right hand side. You have 10 seconds to put your answer option in the comment section"
    },
    {
      "id": 165,
      "text": "below the video. Here's a time."
    },
    {
      "id": 166,
      "text": "And don't forget that leadership principle is based on fruitality. Is your answer option A. B. C. or D."
    },
    {
      "id": 167,
      "text": "Now don't go anywhere because I still have many more questions and answers to work through"
    },
    {
      "id": 168,
      "text": "review that will help you prepare fully for the Amazon selection process. But when you're ready,"
    },
    {
      "id": 169,
      "text": "click that link in the top right hand corner of the video. Head through to my website how to become.com"
    },
    {
      "id": 170,
      "text": "and you can download my full set of Amazon leadership principles, test questions and also some"
    },
    {
      "id": 171,
      "text": "brilliant answers to Amazon leadership principles into view questions. It's a great resource."
    },
    {
      "id": 172,
      "text": "Make sure you check that out when you are ready. Let's now work through Amazon leadership"
    },
    {
      "id": 173,
      "text": "principles, test question number three and this is based on higher and develop the best."
    },
    {
      "id": 174,
      "text": "So question three read the following information before choosing your answer. You are working as a"
    },
    {
      "id": 175,
      "text": "manager in a large organization and one of your best performing members of staff wants to go for"
    },
    {
      "id": 176,
      "text": "a promotion. They need your approval to apply for the promotion. Now they have only been with"
    },
    {
      "id": 177,
      "text": "the company for six months and they are relatively young. If they get promoted, they will move"
    },
    {
      "id": 178,
      "text": "to a different department and you will lose your strongest team member. What would you do?"
    },
    {
      "id": 179,
      "text": "Don't forget to focus on the leadership principle. Answer option A. Support them in their"
    },
    {
      "id": 180,
      "text": "pursuit to get promoted. Now the needs of the organization come before the needs of your team"
    },
    {
      "id": 181,
      "text": "and it's important that you encourage and develop talent because this helps the business grow."
    },
    {
      "id": 182,
      "text": "Their age and time with the company are irrelevant. Answer option B. Do not support them in their"
    },
    {
      "id": 183,
      "text": "pursuit to get promoted because they are the strongest member of your team and they have only been"
    },
    {
      "id": 184,
      "text": "with the company for a few months. You don't feel the time is right for them to get promoted."
    },
    {
      "id": 185,
      "text": "Answer options C. In form them, you will consider supporting them in the future once they have"
    },
    {
      "id": 186,
      "text": "gained more experience. Tell them they are young and inexperienced but you will coach them over"
    },
    {
      "id": 187,
      "text": "the next few months to help them prepare for future promotion. Or answer option D. In form them,"
    },
    {
      "id": 188,
      "text": "they are your strongest performing team member and you cannot afford to lose them. Tell them"
    },
    {
      "id": 189,
      "text": "you are sorry but you cannot support their application. Explain that once a new team member comes"
    },
    {
      "id": 190,
      "text": "who is as good as they are, you will reconsider. Which answer option would you choose A. B. C."
    },
    {
      "id": 191,
      "text": "Or D. Well the only one that is relevant to Amazon's leadership principle is A. Support them in"
    },
    {
      "id": 192,
      "text": "their pursuit to get promoted. The needs of the organization come before the needs of your team"
    },
    {
      "id": 193,
      "text": "and it's important you encourage and develop talent because this helps the business grow. So don't"
    },
    {
      "id": 194,
      "text": "forget the leadership principle of hiring develop the best means that this answer shows your"
    },
    {
      "id": 195,
      "text": "ability to encourage and support talent. You understand that the needs of the organization"
    },
    {
      "id": 196,
      "text": "must come first and your selfless approach to this situation identifies high performing members"
    },
    {
      "id": 197,
      "text": "of staff, their needs and how they can help the organization progress. So now it's your turn to"
    },
    {
      "id": 198,
      "text": "try another one on your own live on the screen. Please put your answer to question four in the"
    },
    {
      "id": 199,
      "text": "comment section below for marking. Thank you. So this Amazon leadership principle is based on"
    },
    {
      "id": 200,
      "text": "strive to be the Earth's best employer. Don't forget being an Amazon employee means making sure"
    },
    {
      "id": 201,
      "text": "the working environment is safe productive and responsible. Amazon understands the importance"
    },
    {
      "id": 202,
      "text": "of having a diverse workforce and it takes its responsibility seriously in respect of the environment."
    },
    {
      "id": 203,
      "text": "So again I will put the passage up on the screen and you choose the answer option which you"
    },
    {
      "id": 204,
      "text": "would follow if you were working at Amazon. Here we go. You are walking through the warehouse"
    },
    {
      "id": 205,
      "text": "whilst working at Amazon. When you notice a member of staff not wearing the correct personal protective"
    },
    {
      "id": 206,
      "text": "clothing. Now the member of staff is not your responsibility from a management point of view."
    },
    {
      "id": 207,
      "text": "But what would you do in this scenario? A. Now because I am not managing the member of staff,"
    },
    {
      "id": 208,
      "text": "they are not my responsibility. It is the responsibility of their manager to enforce company safety rules"
    },
    {
      "id": 209,
      "text": "and so option B. Speak to the member of staff and ask them why they aren't wearing the appropriate"
    },
    {
      "id": 210,
      "text": "personal protective clothing. If they don't have a valid reason, ask them to start wearing it"
    },
    {
      "id": 211,
      "text": "immediately. Answer option C. Speak to the member of staff and ask them why they aren't wearing"
    },
    {
      "id": 212,
      "text": "the appropriate personal protective clothing. If they don't have a valid reason, tell their manager"
    },
    {
      "id": 213,
      "text": "so they can take the appropriate disciplinary reaction or answer option D. Speak to the member of"
    },
    {
      "id": 214,
      "text": "staff and ask them why they aren't wearing the appropriate personal protective clothing. Now if they"
    },
    {
      "id": 215,
      "text": "They don't have a valid reason."
    },
    {
      "id": 216,
      "text": "Awesome to start wearing it immediately and explain why."
    },
    {
      "id": 217,
      "text": "It is so important to wear the clothing at work and follow company rules."
    },
    {
      "id": 218,
      "text": "You have 10 seconds to put your answer in the comment section below the video."
    },
    {
      "id": 219,
      "text": "Here's your timer."
    },
    {
      "id": 220,
      "text": "Fantastic."
    },
    {
      "id": 221,
      "text": "We're making brilliant progress in helping you prepare for the Amazon selection process."
    },
    {
      "id": 222,
      "text": "So now it's time to try another one."
    },
    {
      "id": 223,
      "text": "Another Amazon leadership principles test question."
    },
    {
      "id": 224,
      "text": "Again, put your answer to question five in the comments section below the video."
    },
    {
      "id": 225,
      "text": "This one is based on bias for action."
    },
    {
      "id": 226,
      "text": "This is a difficult one."
    },
    {
      "id": 227,
      "text": "Tell me what you would do in this scenario."
    },
    {
      "id": 228,
      "text": "Don't forget bias for action is working fast and getting things done."
    },
    {
      "id": 229,
      "text": "And that's the difference between success and failure at Amazon."
    },
    {
      "id": 230,
      "text": "So Amazon encourages calculated risks that help the business move forward and maintain"
    },
    {
      "id": 231,
      "text": "its position as the world's number one e-commerce website."
    },
    {
      "id": 232,
      "text": "Here we go."
    },
    {
      "id": 233,
      "text": "Read the following passage before choosing your answer."
    },
    {
      "id": 234,
      "text": "You work for a company that has just had its best financial year ever."
    },
    {
      "id": 235,
      "text": "You are holding a team meeting and a member of staff comes up with a new product idea."
    },
    {
      "id": 236,
      "text": "Now they present their idea to you."
    },
    {
      "id": 237,
      "text": "And whilst it appears to be an idea that could significantly improve the company's turnover,"
    },
    {
      "id": 238,
      "text": "it is costly to develop and launch."
    },
    {
      "id": 239,
      "text": "What would you do in this situation?"
    },
    {
      "id": 240,
      "text": "Answer option A."
    },
    {
      "id": 241,
      "text": "Thank them for putting forward their idea but explain the cost is too expensive."
    },
    {
      "id": 242,
      "text": "The company has just had its best financial year ever and you don't want to risk spending"
    },
    {
      "id": 243,
      "text": "money on something that might not work."
    },
    {
      "id": 244,
      "text": "Answer option B."
    },
    {
      "id": 245,
      "text": "Thank them for putting forward their idea and agree to allocate the money to its development"
    },
    {
      "id": 246,
      "text": "and launch."
    },
    {
      "id": 247,
      "text": "Answer option C."
    },
    {
      "id": 248,
      "text": "Thank them for putting forward their idea."
    },
    {
      "id": 249,
      "text": "Glory their idea in greater detail to establish its viability and the exact costs versus"
    },
    {
      "id": 250,
      "text": "the potential return."
    },
    {
      "id": 251,
      "text": "Now with the data and information makes business sense, go ahead and develop and launch"
    },
    {
      "id": 252,
      "text": "the product."
    },
    {
      "id": 253,
      "text": "Answer option D."
    },
    {
      "id": 254,
      "text": "Thank them for putting forward their idea."
    },
    {
      "id": 255,
      "text": "Tell them the company has had its best financial year ever and you don't want to agree"
    },
    {
      "id": 256,
      "text": "to it just yet."
    },
    {
      "id": 257,
      "text": "However, you will explore their idea at a later stage."
    },
    {
      "id": 258,
      "text": "Tell me in the comment section below which answer option you would choose."
    },
    {
      "id": 259,
      "text": "What would you do in that situation?"
    },
    {
      "id": 260,
      "text": "Here's the 10 second timer."
    },
    {
      "id": 261,
      "text": "You can see that all of these questions are helping you."
    },
    {
      "id": 262,
      "text": "These scenarios are helping you to develop your understanding and knowledge of the Amazon"
    },
    {
      "id": 263,
      "text": "leadership principles."
    },
    {
      "id": 264,
      "text": "What I now want to do is move on and take a look at some Amazon leadership principles"
    },
    {
      "id": 265,
      "text": "into you questions."
    },
    {
      "id": 266,
      "text": "So you will be assessed against the leadership principles during your forthcoming Amazon"
    },
    {
      "id": 267,
      "text": "interview."
    },
    {
      "id": 268,
      "text": "The first question we will look at is, tell me about a time when you are to work with limited"
    },
    {
      "id": 269,
      "text": "time or resources."
    },
    {
      "id": 270,
      "text": "Now this is based on deliver results which is basically get things done on time and to"
    },
    {
      "id": 271,
      "text": "the required standard."
    },
    {
      "id": 272,
      "text": "Amazon employees are never held back by setbacks or remember that."
    },
    {
      "id": 273,
      "text": "Now the best way before I give you an example answer to structure your answers to Amazon"
    },
    {
      "id": 274,
      "text": "leadership principles into your questions is to use a start technique."
    },
    {
      "id": 275,
      "text": "So the start technique stands for situation, task, action and result."
    },
    {
      "id": 276,
      "text": "So you start off by outlining the situation you were faced with."
    },
    {
      "id": 277,
      "text": "You then give brief details about the task that needed doing."
    },
    {
      "id": 278,
      "text": "You then go into specific details about the action you took to complete the task and then"
    },
    {
      "id": 279,
      "text": "finally you finish off and tell the interviewer the results following your actions."
    },
    {
      "id": 280,
      "text": "Let me now give you an example answer to that difficult Amazon leadership principles"
    },
    {
      "id": 281,
      "text": "interview question."
    },
    {
      "id": 282,
      "text": "Tell me about a time when you had to work with limited time or resources that utilizes"
    },
    {
      "id": 283,
      "text": "a start technique."
    },
    {
      "id": 284,
      "text": "Here we go."
    },
    {
      "id": 285,
      "text": "In my previous job I was working as part of a team on a very important time-sensitive"
    },
    {
      "id": 286,
      "text": "project."
    },
    {
      "id": 287,
      "text": "Partway through the project, two team members went off sick which placed enormous pressure"
    },
    {
      "id": 288,
      "text": "on the project due to the lack of resources."
    },
    {
      "id": 289,
      "text": "It was my responsibility to find a solution to this problem then ensure the project"
    },
    {
      "id": 290,
      "text": "still got delivered on time and to the right standards."
    },
    {
      "id": 291,
      "text": "So I called a team meeting with the remaining team members and encouraged everyone to"
    },
    {
      "id": 292,
      "text": "put forward their ideas as to how we could get through this challenge."
    },
    {
      "id": 293,
      "text": "I suggested which commit extra hours to the project and assess which elements we could"
    },
    {
      "id": 294,
      "text": "outsource online to experience and qualified freelancers."
    },
    {
      "id": 295,
      "text": "Everyone agreed to these ideas and I started assessing which tasks could be outsourced."
    },
    {
      "id": 296,
      "text": "Now after several hours analysing the project tasks and seeking suitable freelancers"
    },
    {
      "id": 297,
      "text": "online I managed to find someone to be qualified who could do the work we needed."
    },
    {
      "id": 298,
      "text": "After each team member had committed to an additional three hours work per week and by using"
    },
    {
      "id": 299,
      "text": "the freelancer we still managed to get the project delivered for our company on time"
    },
    {
      "id": 300,
      "text": "and to the expected standard."
    },
    {
      "id": 301,
      "text": "It's not a really good answer because it is a situational response of situation that"
    },
    {
      "id": 302,
      "text": "perhaps you've been in previously."
    },
    {
      "id": 303,
      "text": "You give details about the action you took."
    },
    {
      "id": 304,
      "text": "Now a lot of people would simply go to their manager and say, you know we're a couple"
    },
    {
      "id": 305,
      "text": "of staff down what do we do but you are taking the initiative you are thinking on your"
    },
    {
      "id": 306,
      "text": "feet and you are not being overcome by that setback and that's what Amazon wants people"
    },
    {
      "id": 307,
      "text": "to not be afraid of setbacks to come up with innovative ideas to make sure things are done"
    },
    {
      "id": 308,
      "text": "on time."
    },
    {
      "id": 309,
      "text": "Let's quickly look at more Amazon leadership principles, interview questions that I recommend"
    },
    {
      "id": 310,
      "text": "you prepare for."
    },
    {
      "id": 311,
      "text": "Tell me about a time when you took responsibility for a task outside of your job description."
    },
    {
      "id": 312,
      "text": "The next one, tell me about a time when you found a simple solution to a complex problem."
    },
    {
      "id": 313,
      "text": "Tell me about a time when you had to make an unpopular decision."
    },
    {
      "id": 314,
      "text": "That's a difficult one."
    },
    {
      "id": 315,
      "text": "The next one, tell me about a time when you challenged someone's decision."
    },
    {
      "id": 316,
      "text": "Here's some more."
    },
    {
      "id": 317,
      "text": "Tell me about a time when you influenced a positive change in an organization."
    },
    {
      "id": 318,
      "text": "Tell me about a time when you came up with an idea that improved the efficiency of an organization."
    },
    {
      "id": 319,
      "text": "Tell me about a time when you exceeded a customer's expectations and tell me about a time"
    },
    {
      "id": 320,
      "text": "when you had to work with limited information or data."
    },
    {
      "id": 321,
      "text": "These are all really difficult."
    },
    {
      "id": 322,
      "text": "Amazon interview questions to prepare for."
    },
    {
      "id": 323,
      "text": "If you would like further help, the next thing to do is click that link right now in the"
    },
    {
      "id": 324,
      "text": "top right-hand corner of the video."
    },
    {
      "id": 325,
      "text": "Head through to my website how to become.com and you can download my Amazon leadership"
    },
    {
      "id": 326,
      "text": "principles, test questions and answers and also brilliant example responses to all of those"
    },
    {
      "id": 327,
      "text": "are more Amazon leadership principles interview questions."
    },
    {
      "id": 328,
      "text": "It's a fantastic resource."
    },
    {
      "id": 329,
      "text": "Make sure you check that out right now."
    },
    {
      "id": 330,
      "text": "Finally, don't forget to hit that subscribe button."
    },
    {
      "id": 331,
      "text": "I love helping you guys prepare for your job interviews."
    },
    {
      "id": 332,
      "text": "I can only do that if you are subscribed."
    },
    {
      "id": 333,
      "text": "Please give the video a like because that motivates me to create more content for you."
    },
    {
      "id": 334,
      "text": "And don't forget to connect with me on LinkedIn."
    },
    {
      "id": 335,
      "text": "I have put my LinkedIn link in the description below the video."
    },
    {
      "id": 336,
      "text": "It's always good to connect with light minded professionals such as yourself."
    },
    {
      "id": 337,
      "text": "Thank you so much for watching and for supporting my channel and I wish you all the best"
    },
    {
      "id": 338,
      "text": "for passing your Amazon test or interview have a brilliant day."
    }
  ]
}