{
  "file": "Nyi15V1Ro5I.wav",
  "text": " Hello, there my name is Richard McMunn from the interview training website, passmindevu.com and in this tutorial I will teach you how to pass an Amazon Transportation Specialist interview. So if you are applying to become a Transportation Specialist with Amazon, make sure you stay tuned because I promise to help you pass your interview. And to achieve that goal, this is what I will cover during this tutorial. So I am going to give you a list of Amazon Transportation Specialist Interview questions that I strongly recommend you prepare for. I will then give you some really important tips for answering each of the questions correctly and I will then give you some brilliant unique example answers to all of the interview questions to help you prepare. And then finally I will tell you where you can download all of the answers and further resources to help you succeed. And just very quickly, if you want you to this channel, please do make sure you hit that subscribe button. It's really important. Literally thousands of you are passing your job interviews as a result of my tutorials and I don't want you to miss out. And please also just hit the like button, give the video a like. I very much appreciate your support. Thank you very much. And by liking the video, it tells me that you find the questions and answers useful. Okay, let's get started. And the first question I recommend you prepare for is tell me about yourself. Now when answering this first Amazon Transportation Specialist Interview question, talk about the skills, qualities and experience you have and how these are a strong match for the job description. I also recommend that you practice your answer to this question because this will help you to get your interview off to a confident start. Remember that your Amazon interview is really important that you create a positive first impression. So here's a brilliant example answer to help you. Tell me about yourself. Here we go. Thank you for giving me the opportunity to be interviewed for this position with Amazon today. I would describe myself as a detail orientated, safety driven and fast and diligent worker who has a track record in previous roles of being able to quickly solve problems whilst adhering to strict rules and procedures. Over the years, I have worked in various positions where the need to provide exceptional service has been the norm and where people are depending on you to make difficult decisions that keep the business running smoothly. For example, in my last role, we had a situation where our regular supplier had letters down and this had the potential to impact on operations and customer service. However, because I already had a system in place to find a new suitable supplier quickly, it meant there was no downtime. If you hire me as an Amazon transportation specialist, I will ensure the 16 leadership principles are at the core of all my work. I will collaborate closely with internal managers, external contractors and stakeholders to ensure the highest levels of customer service Amazon is renowned for are always maintained. That's a really good answer to that first question. Tell me about yourself. Now you can either pause the video if you want to and take a note of the questions and answers as we work through them together or if you wait, I will soon tell you where you can download my full set of 23 Amazon transportation specialist interview questions and examples including the ones we are covering today. Here's the next question for you. Why do you want to be an Amazon transportation specialist? Now this question is assessing whether you have the motivation and natural abilities to become an effective and highly efficient Amazon transportation specialist. Now it takes certain qualities and attributes to do this job at Amazon. Simply due to the pressure you will be under. You need to be an excellent problem-solver. So here's another great example answer to help you. Why do you want to be an Amazon transportation specialist? I want to be a transportation specialist for Amazon because the skills and qualities needed in the role are a strong match for my natural abilities and my previous experience. I excel in roles where I have ultimate responsibility for smooth operations and I enjoy the challenge of having to quickly find solutions to problems that have the potential to impact on the performance of an organization. For example, in my last role, I noticed some customers were complaining about the lack of information available to them about their online orders. I carried out some research and I put forward a proposal to my manager about how we could make this type of information readily available to our customers via an online portal. Now once my proposal was implemented, customer service standards and customer retention rates increased significantly. I am a natural problem-solver. I thrive whilst working on the pressure and I enjoy having the responsibility that comes with a safety and operational critical role such as the Amazon transportation specialist. So that's an other really good solid answer and you will notice that what I'm doing in my example responses, I'm giving examples of previous high work performance. And I believe that's really important to do throughout your Amazon interview. Now don't go anywhere because I still have more questions and answers to give you, but when you're ready, click that link in the top right-hand corner of the video. Head through to my website, passmaintoview.com and you can instantly download my full set of 23 Amazon transportation specialist interview questions and examples are including the ones we are working through together today. But here's the next question for you. What are the most important skills and qualities needed to be an Amazon transportation specialist? Now this interview question is clearly assessing your knowledge of the job description and one of the best tips I can give you is to make sure you fully familiarize yourself with the job description for an Amazon transportation specialist before you attend your interview. Here's another example answer. What are the most important skills and qualities needed to be an Amazon transportation specialist? To be a competent and effective transportation specialist for Amazon, you need a background in transportation, possess outstanding data driven problem-solving skills, be able to quickly pull and analyze data from various sources and seek ways to make improvements to the transportation and logistical processes that are utilized by Amazon. You need outstanding critical thinking skills be able to identify the root cause of problems whilst working under extreme pressure and have excellent working knowledge of all Amazon transportation tools, apps, online resources and operational procedures. Other essential skills and qualities include being safety-focused on all your work, being able to conduct dynamic risk assessments, possess exceptional communication skills, and have the ability to take ownership of your ongoing professional development. Finally, you must have a good working knowledge of and be able to demonstrate in your work the 16 Amazon leadership principles and be a totally focused collaborator who can work closely with internal and external freight operators, drivers, suppliers and contractors. That's a great example answer to help you prepare for your Amazon interview. Here is the next question. This is a tough one and one that often catches candidates out. What is Amazon relay and how does it work? So this is another interview question that features often during Amazon transportation specialist interviews. I strongly recommend you familiarize yourself with Amazon relay before you attend your interview. It will form an integral part of your work as a transportation specialist. Here's my example answer to help you. What is Amazon relay and how does it work? Amazon relay simplifies great. It is a portal where freight and transportation carriers can quickly and easily access Amazon's network and their technology to grow their business whilst ensuring safety is the priority. For example, if you are a carrier, you can access Amazon relay to book loads at the click of a button. You can easily accept a sign and monitor your workflow seamlessly whilst gaining valuable insights into how your business is performing. Another example is if you are a driver. Amazon relay allows drivers to access an app in real time, which enables them to check in and check out read in yard instructions to reduce driver dwell time, and instantly receive alerts for assigned work and load cancellations. Now the app is universal in the fact that it is supported in 17 languages. So to summarize, Amazon relay is a technological resource and tool set that allows businesses to haul loads effectively for Amazon and it would be an integral part of my job as a transportation specialist. That's a great example answer. The next question I recommend you prepare for is, why do you want to work for Amazon? So this is another difficult Amazon interview question that comes up often. Make sure you give genuine and valid reasons for wanting to work for this great organization. In my opinion, Amazon is one of the best organizations to work for because they are innovative and forward thinking. They will always be the market leader in my opinion. So my advice is to write down a list of five things that attract you to Amazon before you attend your interview. That will help you to give a really good genuine answer. Here's my own example response to help you. Why do you want to work for Amazon? I want to work for Amazon because having used your products and services for many years now, I am a cutely aware of the exceptional levels of customer service you insist on from your employees. Your four principles of customer obsession, passion for invention, commitment to excellence and long-term thinking are very attractive to someone like me who is seeking long-term employment with the same organization. Amazon is so good at what it does because of the people it's employees. As a transportation specialist, I will get to work alongside lots of bright enthusiastic and talented people and I will also have the freedom to express myself in a diverse and inclusive working environment that thrives on change. That's a brilliant answer. That's how I would personally respond to that Amazon transportation specialist interview question. Why do you want to work for Amazon? The next question I want to work through with you is tell me about a time when you had a disagreement with your boss. So this is an example of an Amazon leadership principles interview question. So Amazon has 16 leadership principles and one of them is have backbone, disagree and commit. Now this question is assessing your ability to confidently challenge your boss in a professional manner. So here's a brilliant example answer to help you. Tell me about a time when you had a disagreement with your boss here we go. In a previous role, I had been communicating with a customer who was not happy with their order. They complained that the online description relating to the product was not accurate. I spoke to my manager to get permission to refund the customer but he refused. So he stated that the customer's reason for wanting the refund was invalid and the product description was actually fine. I disagreed with him and so I put forward my argument in a reason and respectful manner. I explained to my manager that all customers should be valued and we had the opportunity here to improve service standards and retain the customer moving forward simply by giving a refund. I also explained that I felt the product description was not entirely accurate and this same situation could happen again after listening to my argument and the potential benefits to the company my manager agreed for me to issue the refund. We then got together to discuss ways to improve all product descriptions moving forward. Now that is a really good example answer of a situation that I was in where I had a disagreement with my boss and it's a really good response because it shows that I'm putting the success of the organization above everything else. I'm caring for the company but I'm also caring for the customer. Remember one of the leadership principles for Amazon is customer obsession. They always obsess with customers instead of focusing on their competitors. So the next thing to do is please make sure you click that link right now in the top right hand corner of the video head through to my website. PassmainTV.com and you can instantly download my full set of 23 Amazon Transportation Specialist interview questions and examples are including the ones we covered today during this tutorial. Make sure at the very least you go through to that page because I've also given you some more really important tips for helping you to pass your Amazon interview. Remember Amazon only hires the best so it's really important that you put the preparation time in before you attend your interview. It will definitely be worth it because as I said previously I personally believe that Amazon is one of the greatest companies in the world to work for their fantastic and I really think that you should put the effort in to make sure you stand out during your interview. Okay finally don't forget to subscribe to the channel it is really important. We have a brilliant community here a career vids lots of you are passing your interviews. I can only help you if you are subscribed and by subscribing you will be the first person to be alerted whenever I upload interview tips. Career strategies and I can also help you to negotiate to salary or a pay rise when you are employed. Please do give the video a like it's a simple ask but it really does motivate me if I see people liking the video. It motivates me to create more content for you and also answer questions for you in the comments section below the video and also don't forget to connect with me on LinkedIn. I have put my LinkedIn link in the description below the video and it's always great to connect with like minded professionals such as yourself. Thank you so much for watching and I wish you all the best for passing your Amazon transportation specialist interview. Have a brilliant day.",
  "segments": [
    {
      "id": 0,
      "text": "Hello, there my name is Richard McMunn from the interview training website,"
    },
    {
      "id": 1,
      "text": "passmindevu.com and in this tutorial I will teach you how to pass an Amazon"
    },
    {
      "id": 2,
      "text": "Transportation Specialist interview. So if you are applying to become a"
    },
    {
      "id": 3,
      "text": "Transportation Specialist with Amazon, make sure you stay tuned because I promise"
    },
    {
      "id": 4,
      "text": "to help you pass your interview. And to achieve that goal, this is what I will cover during"
    },
    {
      "id": 5,
      "text": "this tutorial. So I am going to give you a list of Amazon Transportation Specialist"
    },
    {
      "id": 6,
      "text": "Interview questions that I strongly recommend you prepare for. I will then give you some"
    },
    {
      "id": 7,
      "text": "really important tips for answering each of the questions correctly and I will then give you"
    },
    {
      "id": 8,
      "text": "some brilliant unique example answers to all of the interview questions to help you prepare."
    },
    {
      "id": 9,
      "text": "And then finally I will tell you where you can download all of the answers"
    },
    {
      "id": 10,
      "text": "and further resources to help you succeed. And just very quickly, if you want you to this channel,"
    },
    {
      "id": 11,
      "text": "please do make sure you hit that subscribe button. It's really important. Literally thousands of"
    },
    {
      "id": 12,
      "text": "you are passing your job interviews as a result of my tutorials and I don't want you to miss out."
    },
    {
      "id": 13,
      "text": "And please also just hit the like button, give the video a like. I very much appreciate your support."
    },
    {
      "id": 14,
      "text": "Thank you very much. And by liking the video, it tells me that you find the questions and answers"
    },
    {
      "id": 15,
      "text": "useful. Okay, let's get started. And the first question I recommend you prepare for is"
    },
    {
      "id": 16,
      "text": "tell me about yourself. Now when answering this first Amazon Transportation Specialist"
    },
    {
      "id": 17,
      "text": "Interview question, talk about the skills, qualities and experience you have and how these are"
    },
    {
      "id": 18,
      "text": "a strong match for the job description. I also recommend that you practice your answer to this"
    },
    {
      "id": 19,
      "text": "question because this will help you to get your interview off to a confident start. Remember"
    },
    {
      "id": 20,
      "text": "that your Amazon interview is really important that you create a positive first impression."
    },
    {
      "id": 21,
      "text": "So here's a brilliant example answer to help you. Tell me about yourself. Here we go."
    },
    {
      "id": 22,
      "text": "Thank you for giving me the opportunity to be interviewed for this position with Amazon today."
    },
    {
      "id": 23,
      "text": "I would describe myself as a detail orientated, safety driven and fast and diligent worker"
    },
    {
      "id": 24,
      "text": "who has a track record in previous roles of being able to quickly solve problems whilst"
    },
    {
      "id": 25,
      "text": "adhering to strict rules and procedures. Over the years, I have worked in various positions where"
    },
    {
      "id": 26,
      "text": "the need to provide exceptional service has been the norm and where people are depending on you"
    },
    {
      "id": 27,
      "text": "to make difficult decisions that keep the business running smoothly. For example, in my last role,"
    },
    {
      "id": 28,
      "text": "we had a situation where our regular supplier had letters down and this had the potential to impact"
    },
    {
      "id": 29,
      "text": "on operations and customer service. However, because I already had a system in place to find"
    },
    {
      "id": 30,
      "text": "a new suitable supplier quickly, it meant there was no downtime. If you hire me as an Amazon"
    },
    {
      "id": 31,
      "text": "transportation specialist, I will ensure the 16 leadership principles are at the core of all my work."
    },
    {
      "id": 32,
      "text": "I will collaborate closely with internal managers, external contractors and stakeholders"
    },
    {
      "id": 33,
      "text": "to ensure the highest levels of customer service Amazon is renowned for are always maintained."
    },
    {
      "id": 34,
      "text": "That's a really good answer to that first question. Tell me about yourself. Now you can"
    },
    {
      "id": 35,
      "text": "either pause the video if you want to and take a note of the questions and answers as we work"
    },
    {
      "id": 36,
      "text": "through them together or if you wait, I will soon tell you where you can download my full set of"
    },
    {
      "id": 37,
      "text": "23 Amazon transportation specialist interview questions and examples including the ones we are"
    },
    {
      "id": 38,
      "text": "covering today. Here's the next question for you. Why do you want to be an Amazon transportation"
    },
    {
      "id": 39,
      "text": "specialist? Now this question is assessing whether you have the motivation and natural abilities"
    },
    {
      "id": 40,
      "text": "to become an effective and highly efficient Amazon transportation specialist. Now it takes certain"
    },
    {
      "id": 41,
      "text": "qualities and attributes to do this job at Amazon. Simply due to the pressure you will be under."
    },
    {
      "id": 42,
      "text": "You need to be an excellent problem-solver. So here's another great example answer to help you."
    },
    {
      "id": 43,
      "text": "Why do you want to be an Amazon transportation specialist? I want to be a transportation specialist"
    },
    {
      "id": 44,
      "text": "for Amazon because the skills and qualities needed in the role are a strong match for my natural"
    },
    {
      "id": 45,
      "text": "abilities and my previous experience. I excel in roles where I have ultimate responsibility for"
    },
    {
      "id": 46,
      "text": "smooth operations and I enjoy the challenge of having to quickly find solutions to problems"
    },
    {
      "id": 47,
      "text": "that have the potential to impact on the performance of an organization. For example, in my last"
    },
    {
      "id": 48,
      "text": "role, I noticed some customers were complaining about the lack of information available to them"
    },
    {
      "id": 49,
      "text": "about their online orders. I carried out some research and I put forward a proposal to my manager"
    },
    {
      "id": 50,
      "text": "about how we could make this type of information readily available to our customers via an online portal."
    },
    {
      "id": 51,
      "text": "Now once my proposal was implemented, customer service standards and customer retention rates increased"
    },
    {
      "id": 52,
      "text": "significantly. I am a natural problem-solver. I thrive whilst working on the pressure and I enjoy"
    },
    {
      "id": 53,
      "text": "having the responsibility that comes with a safety and operational critical role such as the"
    },
    {
      "id": 54,
      "text": "Amazon transportation specialist. So that's an other really good solid answer and you will notice"
    },
    {
      "id": 55,
      "text": "that what I'm doing in my example responses, I'm giving examples of previous high work performance."
    },
    {
      "id": 56,
      "text": "And I believe that's really important to do throughout your Amazon interview."
    },
    {
      "id": 57,
      "text": "Now don't go anywhere because I still have more questions and answers to give you,"
    },
    {
      "id": 58,
      "text": "but when you're ready, click that link in the top right-hand corner of the video."
    },
    {
      "id": 59,
      "text": "Head through to my website, passmaintoview.com and you can instantly download my full set of 23"
    },
    {
      "id": 60,
      "text": "Amazon transportation specialist interview questions and examples are including the ones we are"
    },
    {
      "id": 61,
      "text": "working through together today. But here's the next question for you. What are the most"
    },
    {
      "id": 62,
      "text": "important skills and qualities needed to be an Amazon transportation specialist? Now this interview"
    },
    {
      "id": 63,
      "text": "question is clearly assessing your knowledge of the job description and one of the best tips I"
    },
    {
      "id": 64,
      "text": "can give you is to make sure you fully familiarize yourself with the job description for an Amazon"
    },
    {
      "id": 65,
      "text": "transportation specialist before you attend your interview. Here's another example answer."
    },
    {
      "id": 66,
      "text": "What are the most important skills and qualities needed to be an Amazon transportation specialist?"
    },
    {
      "id": 67,
      "text": "To be a competent and effective transportation specialist for Amazon, you need a background in"
    },
    {
      "id": 68,
      "text": "transportation, possess outstanding data driven problem-solving skills, be able to quickly pull"
    },
    {
      "id": 69,
      "text": "and analyze data from various sources and seek ways to make improvements to the transportation"
    },
    {
      "id": 70,
      "text": "and logistical processes that are utilized by Amazon. You need outstanding critical thinking skills"
    },
    {
      "id": 71,
      "text": "be able to identify the root cause of problems whilst working under extreme pressure and have"
    },
    {
      "id": 72,
      "text": "excellent working knowledge of all Amazon transportation tools, apps, online resources and"
    },
    {
      "id": 73,
      "text": "operational procedures. Other essential skills and qualities include being safety-focused on all your"
    },
    {
      "id": 74,
      "text": "work, being able to conduct dynamic risk assessments, possess exceptional communication skills,"
    },
    {
      "id": 75,
      "text": "and have the ability to take ownership of your ongoing professional development. Finally,"
    },
    {
      "id": 76,
      "text": "you must have a good working knowledge of and be able to demonstrate in your work the"
    },
    {
      "id": 77,
      "text": "16 Amazon leadership principles and be a totally focused collaborator who can work closely"
    },
    {
      "id": 78,
      "text": "with internal and external freight operators, drivers, suppliers and contractors. That's a great"
    },
    {
      "id": 79,
      "text": "example answer to help you prepare for your Amazon interview. Here is the next question. This is a"
    },
    {
      "id": 80,
      "text": "tough one and one that often catches candidates out. What is Amazon relay and how does it work?"
    },
    {
      "id": 81,
      "text": "So this is another interview question that features often during Amazon"
    },
    {
      "id": 82,
      "text": "transportation specialist interviews. I strongly recommend you familiarize yourself with"
    },
    {
      "id": 83,
      "text": "Amazon relay before you attend your interview. It will form an integral part of your work as a"
    },
    {
      "id": 84,
      "text": "transportation specialist. Here's my example answer to help you. What is Amazon relay and how does it work?"
    },
    {
      "id": 85,
      "text": "Amazon relay simplifies great. It is a portal where freight and transportation carriers"
    },
    {
      "id": 86,
      "text": "can quickly and easily access Amazon's network and their technology to grow their business"
    },
    {
      "id": 87,
      "text": "whilst ensuring safety is the priority. For example, if you are a carrier, you can access"
    },
    {
      "id": 88,
      "text": "Amazon relay to book loads at the click of a button. You can easily accept a sign and monitor your"
    },
    {
      "id": 89,
      "text": "workflow seamlessly whilst gaining valuable insights into how your business is performing. Another"
    },
    {
      "id": 90,
      "text": "example is if you are a driver. Amazon relay allows drivers to access an app in real time,"
    },
    {
      "id": 91,
      "text": "which enables them to check in and check out read in yard instructions to reduce driver dwell time,"
    },
    {
      "id": 92,
      "text": "and instantly receive alerts for assigned work and load cancellations. Now the app is universal"
    },
    {
      "id": 93,
      "text": "in the fact that it is supported in 17 languages. So to summarize, Amazon relay is a technological"
    },
    {
      "id": 94,
      "text": "resource and tool set that allows businesses to haul loads effectively for Amazon and it would be"
    },
    {
      "id": 95,
      "text": "an integral part of my job as a transportation specialist. That's a great example answer."
    },
    {
      "id": 96,
      "text": "The next question I recommend you prepare for is, why do you want to work for Amazon?"
    },
    {
      "id": 97,
      "text": "So this is another difficult Amazon interview question that comes up often. Make sure you give"
    },
    {
      "id": 98,
      "text": "genuine and valid reasons for wanting to work for this great organization. In my opinion,"
    },
    {
      "id": 99,
      "text": "Amazon is one of the best organizations to work for because they are innovative and forward thinking."
    },
    {
      "id": 100,
      "text": "They will always be the market leader in my opinion. So my advice is to write down a list of"
    },
    {
      "id": 101,
      "text": "five things that attract you to Amazon before you attend your interview. That will help you to"
    },
    {
      "id": 102,
      "text": "give a really good genuine answer. Here's my own example response to help you."
    },
    {
      "id": 103,
      "text": "Why do you want to work for Amazon? I want to work for Amazon because having used your products"
    },
    {
      "id": 104,
      "text": "and services for many years now, I am a cutely aware of the exceptional levels of customer service"
    },
    {
      "id": 105,
      "text": "you insist on from your employees. Your four principles of customer obsession, passion for"
    },
    {
      "id": 106,
      "text": "invention, commitment to excellence and long-term thinking are very attractive to someone like me"
    },
    {
      "id": 107,
      "text": "who is seeking long-term employment with the same organization. Amazon is so good at what it does"
    },
    {
      "id": 108,
      "text": "because of the people it's employees. As a transportation specialist, I will get to work alongside"
    },
    {
      "id": 109,
      "text": "lots of bright enthusiastic and talented people and I will also have the freedom to express myself"
    },
    {
      "id": 110,
      "text": "in a diverse and inclusive working environment that thrives on change. That's a brilliant answer."
    },
    {
      "id": 111,
      "text": "That's how I would personally respond to that Amazon transportation specialist interview question."
    },
    {
      "id": 112,
      "text": "Why do you want to work for Amazon? The next question I want to work through with you is tell"
    },
    {
      "id": 113,
      "text": "me about a time when you had a disagreement with your boss. So this is an example of an Amazon"
    },
    {
      "id": 114,
      "text": "leadership principles interview question. So Amazon has 16 leadership principles and one of them"
    },
    {
      "id": 115,
      "text": "is have backbone, disagree and commit. Now this question is assessing your ability to confidently"
    },
    {
      "id": 116,
      "text": "challenge your boss in a professional manner. So here's a brilliant example answer to help you."
    },
    {
      "id": 117,
      "text": "Tell me about a time when you had a disagreement with your boss here we go."
    },
    {
      "id": 118,
      "text": "In a previous role, I had been communicating with a customer who was not happy with their order."
    },
    {
      "id": 119,
      "text": "They complained that the online description relating to the product was not accurate. I spoke to my"
    },
    {
      "id": 120,
      "text": "manager to get permission to refund the customer but he refused. So he stated that the customer's"
    },
    {
      "id": 121,
      "text": "reason for wanting the refund was invalid and the product description was actually fine."
    },
    {
      "id": 122,
      "text": "I disagreed with him and so I put forward my argument in a reason and respectful manner."
    },
    {
      "id": 123,
      "text": "I explained to my manager that all customers should be valued and we had the opportunity here"
    },
    {
      "id": 124,
      "text": "to improve service standards and retain the customer moving forward simply by giving a refund."
    },
    {
      "id": 125,
      "text": "I also explained that I felt the product description was not entirely accurate and this same"
    },
    {
      "id": 126,
      "text": "situation could happen again after listening to my argument and the potential benefits to the company"
    },
    {
      "id": 127,
      "text": "my manager agreed for me to issue the refund. We then got together to discuss ways to improve"
    },
    {
      "id": 128,
      "text": "all product descriptions moving forward. Now that is a really good example answer of a situation"
    },
    {
      "id": 129,
      "text": "that I was in where I had a disagreement with my boss and it's a really good response"
    },
    {
      "id": 130,
      "text": "because it shows that I'm putting the success of the organization above everything else. I'm"
    },
    {
      "id": 131,
      "text": "caring for the company but I'm also caring for the customer. Remember one of the leadership"
    },
    {
      "id": 132,
      "text": "principles for Amazon is customer obsession. They always obsess with customers instead of focusing"
    },
    {
      "id": 133,
      "text": "on their competitors. So the next thing to do is please make sure you click that link right now"
    },
    {
      "id": 134,
      "text": "in the top right hand corner of the video head through to my website. PassmainTV.com and you can"
    },
    {
      "id": 135,
      "text": "instantly download my full set of 23 Amazon Transportation Specialist interview questions and"
    },
    {
      "id": 136,
      "text": "examples are including the ones we covered today during this tutorial. Make sure at the very"
    },
    {
      "id": 137,
      "text": "least you go through to that page because I've also given you some more really important tips for"
    },
    {
      "id": 138,
      "text": "helping you to pass your Amazon interview. Remember Amazon only hires the best so it's really"
    },
    {
      "id": 139,
      "text": "important that you put the preparation time in before you attend your interview. It will definitely"
    },
    {
      "id": 140,
      "text": "be worth it because as I said previously I personally believe that Amazon is one of the greatest"
    },
    {
      "id": 141,
      "text": "companies in the world to work for their fantastic and I really think that you should put the"
    },
    {
      "id": 142,
      "text": "effort in to make sure you stand out during your interview. Okay finally don't forget to subscribe"
    },
    {
      "id": 143,
      "text": "to the channel it is really important. We have a brilliant community here a career vids lots of"
    },
    {
      "id": 144,
      "text": "you are passing your interviews. I can only help you if you are subscribed and by subscribing you"
    },
    {
      "id": 145,
      "text": "will be the first person to be alerted whenever I upload interview tips. Career strategies and I can"
    },
    {
      "id": 146,
      "text": "also help you to negotiate to salary or a pay rise when you are employed. Please do give the video"
    },
    {
      "id": 147,
      "text": "a like it's a simple ask but it really does motivate me if I see people liking the video. It motivates"
    },
    {
      "id": 148,
      "text": "me to create more content for you and also answer questions for you in the comments section below"
    },
    {
      "id": 149,
      "text": "the video and also don't forget to connect with me on LinkedIn. I have put my LinkedIn link in the"
    },
    {
      "id": 150,
      "text": "description below the video and it's always great to connect with like minded professionals such as"
    },
    {
      "id": 151,
      "text": "yourself. Thank you so much for watching and I wish you all the best for passing your Amazon"
    },
    {
      "id": 152,
      "text": "transportation specialist interview. Have a brilliant day."
    }
  ]
}