{
  "file": "ofUW9YauiPI.wav",
  "text": " If you have a job interview coming up with Amazon, they are going to ask you the question, why Amazon? Why do you want to work for Amazon? And in this tutorial, I am going to give you a number of examples that will help you prepare fully for your Amazon interview. So here's the first example answer to the interview question, why Amazon? Here we go. I want to work for Amazon for five reasons. The first reason is Amazon has an impressive track record of achievement over the years. It has constantly been innovative in the products that it creates and how it delivers its goods and services to its customers. I only want to work for an organization that is constantly moving and driving forward. The second reason why I want to work for Amazon is because having personally used Amazon's products and services over the years, they are always created to a very high standard. You are always trying to solve problems that customers might have and that is one of the main reasons why I believe customers are constantly coming back to the organization. The third reason why I want to work for Amazon is because you are clearly obsessed with customers. In everything you do, I understand that you always start with a customer and you then work backwards. And that's a great model for an organization to have and it tells me that Amazon will always be successful. And I want to work in a role where I am constantly pushed and challenged. And that's the fourth reason why I want to work for Amazon is because I want to work for a company where I will be rewarded for helping other people. So within Amazon, I will get to be creative and innovative and come up with different ideas to help the organization to move forward and also to solve problems for customers. And I believe that will be highly rewarding. The final reason why I want to work for Amazon is because of your leadership principles, your 14 leadership principles. I studied them in detail before applying for this position today and I was impressed by them. I believe they are the foundations of why Amazon has always been successful. And if I am successful in applying for this position, I will look forward to implementing all of them into my daily work. So that was a confident and positive answer to that common Amazon interview question. Why Amazon? Why do you want to work for Amazon? And in a second, I am going to give you some more example scripted answers you can use in your Amazon interview. But first of all, let me give you a list of good things to mention in your answer to the interview question. Why Amazon? Well, you could say that Amazon has a brilliant track record of success. It is innovative and it is at the cutting edge of product development. You could also say that Amazon always focuses on delivering exceptional customer service and you have first hand experience of using some of their products and services. You could also say that you want to work for Amazon because Amazon is an employer that encourages it start to invent and create. And being a creative person yourself, you find this highly appealing. Or you could say that having studied and learned the Amazon leadership principles, you are impressed with the foundations the company has been built up. So let me now give you some more example answers to the interview question. Why Amazon? Here's the first one. Answer option one. Why do you want to work for Amazon? I want to work for Amazon for several reasons. The first reason is Amazon is an organization that is constantly pushing the boundaries of innovation. You are always moving forward and I find this appealing because I want to work in an organization where I can be creative and innovative. I want to work for Amazon because the leadership principles you have are the bedrock of success. And if I apply the leadership principles in my work, I will always be successful. Finally, I want to work for Amazon because I will get to work alongside other like-minded professionals who are all seeking to grow, learn, improve and develop. We spend a lot of time at work and I want that time to be put to good use. Now I like that answer to the why Amazon interview question because you are not just giving one reason why you want to work for Amazon. You are giving lots of different reasons and that's the best way to tackle that interview question. Here's my second example answer to the question why Amazon to help you. I want to work for Amazon because having personally used many of your products and services before, you are a company that stands for exceptional customer service and high quality. You genuinely care about your customers and I find this appealing. I also want to work for Amazon because there will be opportunities for me to advance within the organization. I have ambitious career plans and I see myself as a long-term employee of Amazon and someone who will be able to help the organization grow and improve. Finally, I want to work for Amazon because you are never satisfied with what you have achieved. I will feel proud to work for an organization that is always creating new things and that is at the cutting edge of innovation. That is a really good answer. You can decide out of the three answers I have given you which one you want to use, join your Amazon interview when responding to the question why Amazon. Now if you would like to download my full set of Amazon interview questions and answers in a PDF guide, click that link right now that has appeared in the top right hand corner of the video. Head over to more website, passmaintevue.com and you can download my full set of Amazon interview questions and top scoring answers, including the ones I have covered during today within this presentation. Finally, please don't forget to subscribe to the channel. Lots of you are passing your interviews and I don't need to miss out. I have also placed some links to a number of other Amazon interview questions and answers training tutorials in the description below the video. Make sure you check them out. Finally, don't forget to give the video a thumbs up. I very appreciate your support. Thank you very much for watching and wish you all the best for passing your Amazon interview. Have a brilliant day.",
  "segments": [
    {
      "id": 0,
      "text": "If you have a job interview coming up with Amazon, they are going to ask you the question,"
    },
    {
      "id": 1,
      "text": "why Amazon? Why do you want to work for Amazon? And in this tutorial, I am going to give you"
    },
    {
      "id": 2,
      "text": "a number of examples that will help you prepare fully for your Amazon interview. So here's"
    },
    {
      "id": 3,
      "text": "the first example answer to the interview question, why Amazon? Here we go."
    },
    {
      "id": 4,
      "text": "I want to work for Amazon for five reasons. The first reason is Amazon has an impressive"
    },
    {
      "id": 5,
      "text": "track record of achievement over the years. It has constantly been innovative in the products"
    },
    {
      "id": 6,
      "text": "that it creates and how it delivers its goods and services to its customers. I only want to work"
    },
    {
      "id": 7,
      "text": "for an organization that is constantly moving and driving forward. The second reason why I want to"
    },
    {
      "id": 8,
      "text": "work for Amazon is because having personally used Amazon's products and services over the years,"
    },
    {
      "id": 9,
      "text": "they are always created to a very high standard. You are always trying to solve problems that"
    },
    {
      "id": 10,
      "text": "customers might have and that is one of the main reasons why I believe customers are constantly"
    },
    {
      "id": 11,
      "text": "coming back to the organization. The third reason why I want to work for Amazon is because you are"
    },
    {
      "id": 12,
      "text": "clearly obsessed with customers. In everything you do, I understand that you always start with a"
    },
    {
      "id": 13,
      "text": "customer and you then work backwards. And that's a great model for an organization to have and it"
    },
    {
      "id": 14,
      "text": "tells me that Amazon will always be successful. And I want to work in a role where I am constantly"
    },
    {
      "id": 15,
      "text": "pushed and challenged. And that's the fourth reason why I want to work for Amazon is because I want"
    },
    {
      "id": 16,
      "text": "to work for a company where I will be rewarded for helping other people. So within Amazon,"
    },
    {
      "id": 17,
      "text": "I will get to be creative and innovative and come up with different ideas to help the organization"
    },
    {
      "id": 18,
      "text": "to move forward and also to solve problems for customers. And I believe that will be highly"
    },
    {
      "id": 19,
      "text": "rewarding. The final reason why I want to work for Amazon is because of your leadership principles,"
    },
    {
      "id": 20,
      "text": "your 14 leadership principles. I studied them in detail before applying for this position"
    },
    {
      "id": 21,
      "text": "today and I was impressed by them. I believe they are the foundations of why Amazon has always been"
    },
    {
      "id": 22,
      "text": "successful. And if I am successful in applying for this position, I will look forward to implementing"
    },
    {
      "id": 23,
      "text": "all of them into my daily work. So that was a confident and positive answer to that common"
    },
    {
      "id": 24,
      "text": "Amazon interview question. Why Amazon? Why do you want to work for Amazon? And in a second,"
    },
    {
      "id": 25,
      "text": "I am going to give you some more example scripted answers you can use in your Amazon interview."
    },
    {
      "id": 26,
      "text": "But first of all, let me give you a list of good things to mention in your answer to the"
    },
    {
      "id": 27,
      "text": "interview question. Why Amazon? Well, you could say that Amazon has a brilliant track record of"
    },
    {
      "id": 28,
      "text": "success. It is innovative and it is at the cutting edge of product development. You could also say"
    },
    {
      "id": 29,
      "text": "that Amazon always focuses on delivering exceptional customer service and you have first hand"
    },
    {
      "id": 30,
      "text": "experience of using some of their products and services. You could also say that you want to work"
    },
    {
      "id": 31,
      "text": "for Amazon because Amazon is an employer that encourages it start to invent and create."
    },
    {
      "id": 32,
      "text": "And being a creative person yourself, you find this highly appealing. Or you could say that having"
    },
    {
      "id": 33,
      "text": "studied and learned the Amazon leadership principles, you are impressed with the foundations"
    },
    {
      "id": 34,
      "text": "the company has been built up. So let me now give you some more example answers to the interview"
    },
    {
      "id": 35,
      "text": "question. Why Amazon? Here's the first one. Answer option one. Why do you want to work for"
    },
    {
      "id": 36,
      "text": "Amazon? I want to work for Amazon for several reasons. The first reason is Amazon is an"
    },
    {
      "id": 37,
      "text": "organization that is constantly pushing the boundaries of innovation. You are always moving forward"
    },
    {
      "id": 38,
      "text": "and I find this appealing because I want to work in an organization where I can be creative and"
    },
    {
      "id": 39,
      "text": "innovative. I want to work for Amazon because the leadership principles you have are the bedrock"
    },
    {
      "id": 40,
      "text": "of success. And if I apply the leadership principles in my work, I will always be successful. Finally,"
    },
    {
      "id": 41,
      "text": "I want to work for Amazon because I will get to work alongside other like-minded professionals"
    },
    {
      "id": 42,
      "text": "who are all seeking to grow, learn, improve and develop. We spend a lot of time at work and I want"
    },
    {
      "id": 43,
      "text": "that time to be put to good use. Now I like that answer to the why Amazon interview question"
    },
    {
      "id": 44,
      "text": "because you are not just giving one reason why you want to work for Amazon. You are giving lots"
    },
    {
      "id": 45,
      "text": "of different reasons and that's the best way to tackle that interview question. Here's my second"
    },
    {
      "id": 46,
      "text": "example answer to the question why Amazon to help you. I want to work for Amazon because having"
    },
    {
      "id": 47,
      "text": "personally used many of your products and services before, you are a company that stands for"
    },
    {
      "id": 48,
      "text": "exceptional customer service and high quality. You genuinely care about your customers and I find"
    },
    {
      "id": 49,
      "text": "this appealing. I also want to work for Amazon because there will be opportunities for me to"
    },
    {
      "id": 50,
      "text": "advance within the organization. I have ambitious career plans and I see myself as a long-term"
    },
    {
      "id": 51,
      "text": "employee of Amazon and someone who will be able to help the organization grow and improve."
    },
    {
      "id": 52,
      "text": "Finally, I want to work for Amazon because you are never satisfied with what you have achieved."
    },
    {
      "id": 53,
      "text": "I will feel proud to work for an organization that is always creating new things and that is at"
    },
    {
      "id": 54,
      "text": "the cutting edge of innovation. That is a really good answer. You can decide out of the three"
    },
    {
      "id": 55,
      "text": "answers I have given you which one you want to use, join your Amazon interview when responding"
    },
    {
      "id": 56,
      "text": "to the question why Amazon. Now if you would like to download my full set of Amazon"
    },
    {
      "id": 57,
      "text": "interview questions and answers in a PDF guide, click that link right now that has appeared"
    },
    {
      "id": 58,
      "text": "in the top right hand corner of the video. Head over to more website, passmaintevue.com"
    },
    {
      "id": 59,
      "text": "and you can download my full set of Amazon interview questions and top scoring answers,"
    },
    {
      "id": 60,
      "text": "including the ones I have covered during today within this presentation."
    },
    {
      "id": 61,
      "text": "Finally, please don't forget to subscribe to the channel. Lots of you are passing your"
    },
    {
      "id": 62,
      "text": "interviews and I don't need to miss out. I have also placed some links to a number of other"
    },
    {
      "id": 63,
      "text": "Amazon interview questions and answers training tutorials in the description below the video."
    },
    {
      "id": 64,
      "text": "Make sure you check them out. Finally, don't forget to give the video a thumbs up. I very"
    },
    {
      "id": 65,
      "text": "appreciate your support. Thank you very much for watching and wish you all the best for passing"
    },
    {
      "id": 66,
      "text": "your Amazon interview. Have a brilliant day."
    }
  ]
}