{
  "file": "QASkQVFLtyI.wav",
  "text": " In this next very important job interview training video, I will show you how to answer behavioral interview questions in a live job interview using the star method. Now the star method situation at task action and result is recognized by all hiring managers as the best way to answer difficult behavioral interview questions. Use the star method in your own interview and your chances of success will increase significantly. And just very quickly, if you are new to my channel, please make sure you hit that subscribe button right now. Thousands of you are passing your interviews at the first attempt. I can only help you if you are subscribed and please hit the like button right now. Give the video a like because that really does motivate me to create more great content for you. Thank you very much indeed. Okay, let's jump straight into the tutorial. So to make sure you pass your job interview at the first attempt, I will cover the following four things in this training video. Number one, I will quickly explain what behavioral interview questions are and why the hiring manager will ask them during your interview. Number two, I will then teach you what the star method is and how to use it when answering difficult behavioral interview questions. Number three, I will then give you top scoring answers to behavioral interview questions in a live job interview before giving you the scripts to write down. And then finally, number four, I will tell you where you can instantly download my 50 quick and easy to remember answers to difficult interview questions. Okay, to begin with, let me explain what behavioral interview questions are and why the hiring manager will ask you them during your interview. Please take notes. Examples of behavioral interview questions include, tell me about a time you delivered excellent customer service. Tell me about a time you made a mistake. Tell me about a time you had a conflict with a coworker and tell me about a time when you disagreeing with your boss. Now behavioral interview questions are designed to quickly determine whether or not you have the experience to handle difficult situations you will likely encounter in the workplace. Now the idea is that if you have already experienced the situation being assessed, you will be able to meet the demands of the job role and therefore require less training and supervision in the position. Now that is why it is so important when answering behavioral interview questions you give a specific situation you have been in based on the question being asked. However, if this is your first ever job interview and you have no previous experience of the situation being assessed, make sure you answer the question by telling the hiring manager what you would do in the situation to achieve a successful outcome. Okay, let me now quickly tell you what the star method is and how to use it while answering behavioral interview questions. Now the star method stands for situation task action and result. Now when answering behavioral interview questions, start your answer by outlining the situation you were faced with. Next, tell the hiring manager the task that need you doing, then give details in depth details about the action you took to complete the task and then finally finish your answer with the results following your actions. Okay, let me now show you how to answer behavioral interview questions in a live job interview and I will then give you the scripts to write down here we go. Richard tell me about a time you made him stake. In my last job, I was taking a customer's order over the telephone. It was my task to pay attention to the customer and deliver excellent service. However, in my hastiness to deal with the customer quickly, I failed to listen fully to their requested order and when I dispatched their goods, it was incomplete. This was a foolish mistake and as soon as I realized, I contacted the customer, apologized and sent out the correct items along with an apology note and a 10% discount off their next order. Now to make sure I never made the same mistake again, I wrote down all customer orders on a sheet of paper and double check them with the customer to make sure they were correct. Tell me about a time you disagreed with your boss. I was in a team meeting with my boss discussing the redesign of our company's website. My boss wanted to use an expensive local contract for the work but I disagreed with their choice. It was my task to explain to my boss why I disagreed in a professional manner. I explained to my boss that the contract was expensive and after reading reviews from previous clients, I felt there were better alternatives. I suggested we use an online contractor from the website at work.com where we could choose one with better reviews and who would be more cost effective helping save the company money. Now after considering my alternative option, my manager went ahead and hired a contractor from upwork.com who delivered a great design at half the price. Okay next question, tell me about a time you delivered excellent customer service. In a previous job, I was helping an elderly customer on the telephone. They wanted to place an order from our website but they had concerns about security. It was my task to be patient with a customer reassure them and walk them through the online payment process. I listened patiently to the customer's concerns, asked them questions and taught them clearly through every step of the ordering process, making sure they fully understood everything I was saying. Now although the call took much longer than expected, the customer successfully placed their order and they thanked me for being patient and reassuring them throughout the process. Tell me about a time you had to work and to pressure. I was working on several important tasks in my last job when my manager asked for a volunteer to cover the duties of a coworker who had to take a leave of absence due to a family emergency. I volunteered to do their work. It was my task to reassess my current workload in addition to my coworkers duties to ensure everything was completed on time. I created a list of all tasks I was now responsible for and collocoded them in order of priority. Red tasks required my immediate attention. Blue tasks came second and green tasks could be left for the end of the working day. I then estimated the time it would take to complete each task blocked out distractions and started work. By prioritising my workload against the company's goals and working methodically and efficiently, I completed all tasks to the required standard and on time. There's four top scoring, powerful answers to difficult behavioral interview questions. In a second, I'm going to give you the scripts to write down. I will put up live on the screen, the exact answers I just gave in that job interview and you can pause the video and write them down and then use them when preparing for your own interview. If you don't want to do any of that and you simply want to download the answers, you can click that link at any time. Okay, here's my top scoring answers. I just gave in that interview here we go. Okay, so let's start working through those exact answers. I just gave in that interview to the behavioral interview questions. All these answers use the star method of situation, task action and result. So the first behavioral interview question was, tell me about a time you made a mistake. Lots of people respond to this question by saying they never made a mistake because they are a perfectionist. That is not the way to answer this difficult question. Here's the exact response I gave. Tell me about a time you made a mistake. In my last job, I was taking a customer's order over the telephone. It was my task to pay attention and deliver excellent customer service. However, in my hastiness to deal with the customer quickly, I failed to listen fully to their requested order. And when I dispatched the goods, it was incomplete. Now this was a foolish mistake. And as soon as I realised, I contacted the customer, apologized, and sent out the correct items along with an apology note and they discount off their next order. To make sure I never made the same mistake again, I wrote down all orders on a sheet of paper and double checked them with the customer to ensure they were correct. That is a really good answer you are using the star method, situation, task action and result. You are giving a situation where you made a mistake, you are recognizing the mistake, apologizing and then taking immediate steps to put things right. And then more importantly, at the end, you are saying you learned from the situation. So it's a really good answer to that tough behavioral interview question. Don't forget, you can pause the video and write down the answers if you want to, or at the end, I will tell you where you can download all of the answers in a PDF document. Meaning you can have everything in your inbox within two minutes from now. Here is the next question. Tell me about a time you disagreed with your boss. Here is the answer. I just gave that uses a star method. I was in a team meeting with my boss discussing the redesign of the company's website. My boss wanted to use an expensive local contractor for the work, but I disagreed with their choice. It was my task to explain why I disagreed in a professional manner. I explained to my boss that the contractor was expensive and after reading reviews from previous clients, I felt there were better alternatives. I suggested we use an online contractor from the website upwork.com where we could choose one with better reviews and who would be more cost-effective helping save the company money. Now, after considering my alternative option, my manager went ahead and hired an online contractor from upwork and created a brilliant website for the company at half the price. That is a really good answer again. The use is a star method of situation, task action and result. Lots of people respond to that tough behavioural interview question by saying they would never disagree with their boss because their boss is the person who is in charge. However, this question is assessing your confidence and communication skills to see whether you would disagree if you think there's a better alternative that will help the company. That is a great answer. The next behavioural interview question I had to answer in that live job interview was tell me about a time you delivered excellent customer service. This question comes up all the time during job interviews. Don't forget to give a specific situation you have been in. Or if it's your first job interview, tell them what you would do to deliver excellent customer service. Here is the exact answer I gave that uses a star method. Here we go. Tell me about a time you delivered excellent customer service. I was helping an elderly customer on the telephone. They wanted to place an order from our website, but had concerns about security. It was my task to be patient with the customer, reassure them and walk them through the payment process. I listened to their concerns, asked questions, and talked them through every step of the ordering process, making sure they fully understood everything I was saying. Although the call took much longer than expected, the customer successfully placed the order and they thanked me for being patient and reassuring them while assisting them placed their order. The really good answer is shows that you go above and beyond to deliver excellent customer service. Again, you are using that brilliant technique, the star method of situation, task, action and result. It will help you get higher scores in your job interview because it is recognized by all hiring managers. Now the next behavioral interview question I had to answer was tell me about a time you had to work under pressure. Again, this is one of the more common behavioral interview questions. Here is the exact answer I gave. I was working on several important tasks in my last job when my manager asked for a volunteer to cover the duties of a coworker who had to take a leave of absence due to a family emergency. Although I was busy, I volunteered to do their work. It was my task to reassess my current workload in addition to my coworkers to ensure everything was completed on time. I created a list of all tasks I was now responsible for and color coded them in order of priority. Red tasks required my immediate attention. Blue tasks came second and green tasks could be left for the end of the working day. I then assessed the time it would take to complete each task. Blocked out distractions and started work. By prioritizing my workload against the company's goals and working methodically and efficiently, I completed all tasks to the required standard and on time. That's a great answer. I like that response because at the beginning you are saying, although you are really busy, you volunteered to do the work of your coworker as well as your own. It shows that you are a team player. It's a really good answer to that tough behavioral interview question that uses a star method again situation task action and result. Now the next thing to do is click that link right now in the top right hand corner of the video. Head straight through to my website, passmaintevue.com and you can instantly download. These answers I just gave these slides plus 50 brilliant quick answers to tough interview questions. That guide includes more brilliant responses to common behavioral interview questions. Make sure you check out that link download the guide. It will make a huge difference to your performance at every job interview you ever attend. It will save you lots of time when preparing for your interview, so make sure you check it out and download it. Also, don't forget to hit the subscribe button. Thousands of you are passing your job interviews. I can only help you if you are subscribed. Please hit the like button. It's a small favour to ask you, but if you like the videos, it does motivate me to create more great free content for you. Thank you very much. And don't forget to connect with me on LinkedIn. I have put my LinkedIn link in the description below the video. Thank you very much for watching and I wish you all the best for passing your job interview. Have a great day.",
  "segments": [
    {
      "id": 0,
      "text": "In this next very important job interview training video, I will show you how to answer"
    },
    {
      "id": 1,
      "text": "behavioral interview questions in a live job interview using the star method."
    },
    {
      "id": 2,
      "text": "Now the star method situation at task action and result is recognized by all hiring managers"
    },
    {
      "id": 3,
      "text": "as the best way to answer difficult behavioral interview questions."
    },
    {
      "id": 4,
      "text": "Use the star method in your own interview and your chances of success will increase significantly."
    },
    {
      "id": 5,
      "text": "And just very quickly, if you are new to my channel, please make sure you hit that subscribe button right now."
    },
    {
      "id": 6,
      "text": "Thousands of you are passing your interviews at the first attempt."
    },
    {
      "id": 7,
      "text": "I can only help you if you are subscribed and please hit the like button right now."
    },
    {
      "id": 8,
      "text": "Give the video a like because that really does motivate me to create more great content for you."
    },
    {
      "id": 9,
      "text": "Thank you very much indeed. Okay, let's jump straight into the tutorial."
    },
    {
      "id": 10,
      "text": "So to make sure you pass your job interview at the first attempt, I will cover the following four things in this training video."
    },
    {
      "id": 11,
      "text": "Number one, I will quickly explain what behavioral interview questions are and why the hiring manager will ask them during your interview."
    },
    {
      "id": 12,
      "text": "Number two, I will then teach you what the star method is and how to use it when answering difficult behavioral interview questions."
    },
    {
      "id": 13,
      "text": "Number three, I will then give you top scoring answers to behavioral interview questions in a live job interview before giving you the scripts to write down."
    },
    {
      "id": 14,
      "text": "And then finally, number four, I will tell you where you can instantly download my 50 quick and easy to remember answers to difficult interview questions."
    },
    {
      "id": 15,
      "text": "Okay, to begin with, let me explain what behavioral interview questions are and why the hiring manager will ask you them during your interview."
    },
    {
      "id": 16,
      "text": "Please take notes."
    },
    {
      "id": 17,
      "text": "Examples of behavioral interview questions include, tell me about a time you delivered excellent customer service."
    },
    {
      "id": 18,
      "text": "Tell me about a time you made a mistake. Tell me about a time you had a conflict with a coworker and tell me about a time when you disagreeing with your boss."
    },
    {
      "id": 19,
      "text": "Now behavioral interview questions are designed to quickly determine whether or not you have the experience to handle difficult situations you will likely encounter in the workplace."
    },
    {
      "id": 20,
      "text": "Now the idea is that if you have already experienced the situation being assessed, you will be able to meet the demands of the job role and therefore require less training and supervision in the position."
    },
    {
      "id": 21,
      "text": "Now that is why it is so important when answering behavioral interview questions you give a specific situation you have been in based on the question being asked."
    },
    {
      "id": 22,
      "text": "However, if this is your first ever job interview and you have no previous experience of the situation being assessed, make sure you answer the question by telling the hiring manager what you would do in the situation to achieve a successful outcome."
    },
    {
      "id": 23,
      "text": "Okay, let me now quickly tell you what the star method is and how to use it while answering behavioral interview questions."
    },
    {
      "id": 24,
      "text": "Now the star method stands for situation task action and result."
    },
    {
      "id": 25,
      "text": "Now when answering behavioral interview questions, start your answer by outlining the situation you were faced with."
    },
    {
      "id": 26,
      "text": "Next, tell the hiring manager the task that need you doing, then give details in depth details about the action you took to complete the task and then finally finish your answer with the results following your actions."
    },
    {
      "id": 27,
      "text": "Okay, let me now show you how to answer behavioral interview questions in a live job interview and I will then give you the scripts to write down here we go."
    },
    {
      "id": 28,
      "text": "Richard tell me about a time you made him stake."
    },
    {
      "id": 29,
      "text": "In my last job, I was taking a customer's order over the telephone."
    },
    {
      "id": 30,
      "text": "It was my task to pay attention to the customer and deliver excellent service."
    },
    {
      "id": 31,
      "text": "However, in my hastiness to deal with the customer quickly, I failed to listen fully to their requested order and when I dispatched their goods, it was incomplete."
    },
    {
      "id": 32,
      "text": "This was a foolish mistake and as soon as I realized, I contacted the customer, apologized and sent out the correct items along with an apology note and a 10% discount off their next order."
    },
    {
      "id": 33,
      "text": "Now to make sure I never made the same mistake again, I wrote down all customer orders on a sheet of paper and double check them with the customer to make sure they were correct."
    },
    {
      "id": 34,
      "text": "Tell me about a time you disagreed with your boss."
    },
    {
      "id": 35,
      "text": "I was in a team meeting with my boss discussing the redesign of our company's website."
    },
    {
      "id": 36,
      "text": "My boss wanted to use an expensive local contract for the work but I disagreed with their choice."
    },
    {
      "id": 37,
      "text": "It was my task to explain to my boss why I disagreed in a professional manner."
    },
    {
      "id": 38,
      "text": "I explained to my boss that the contract was expensive and after reading reviews from previous clients, I felt there were better alternatives."
    },
    {
      "id": 39,
      "text": "I suggested we use an online contractor from the website at work.com where we could choose one with better reviews and who would be more cost effective helping save the company money."
    },
    {
      "id": 40,
      "text": "Now after considering my alternative option, my manager went ahead and hired a contractor from upwork.com who delivered a great design at half the price."
    },
    {
      "id": 41,
      "text": "Okay next question, tell me about a time you delivered excellent customer service."
    },
    {
      "id": 42,
      "text": "In a previous job, I was helping an elderly customer on the telephone."
    },
    {
      "id": 43,
      "text": "They wanted to place an order from our website but they had concerns about security."
    },
    {
      "id": 44,
      "text": "It was my task to be patient with a customer reassure them and walk them through the online payment process."
    },
    {
      "id": 45,
      "text": "I listened patiently to the customer's concerns, asked them questions and taught them clearly through every step of the ordering process, making sure they fully understood everything I was saying."
    },
    {
      "id": 46,
      "text": "Now although the call took much longer than expected, the customer successfully placed their order and they thanked me for being patient and reassuring them throughout the process."
    },
    {
      "id": 47,
      "text": "Tell me about a time you had to work and to pressure."
    },
    {
      "id": 48,
      "text": "I was working on several important tasks in my last job when my manager asked for a volunteer to cover the duties of a coworker who had to take a leave of absence due to a family emergency."
    },
    {
      "id": 49,
      "text": "I volunteered to do their work."
    },
    {
      "id": 50,
      "text": "It was my task to reassess my current workload in addition to my coworkers duties to ensure everything was completed on time."
    },
    {
      "id": 51,
      "text": "I created a list of all tasks I was now responsible for and collocoded them in order of priority."
    },
    {
      "id": 52,
      "text": "Red tasks required my immediate attention."
    },
    {
      "id": 53,
      "text": "Blue tasks came second and green tasks could be left for the end of the working day."
    },
    {
      "id": 54,
      "text": "I then estimated the time it would take to complete each task blocked out distractions and started work."
    },
    {
      "id": 55,
      "text": "By prioritising my workload against the company's goals and working methodically and efficiently, I completed all tasks to the required standard and on time."
    },
    {
      "id": 56,
      "text": "There's four top scoring, powerful answers to difficult behavioral interview questions."
    },
    {
      "id": 57,
      "text": "In a second, I'm going to give you the scripts to write down."
    },
    {
      "id": 58,
      "text": "I will put up live on the screen, the exact answers I just gave in that job interview and you can pause the video and write them down and then use them when preparing for your own interview."
    },
    {
      "id": 59,
      "text": "If you don't want to do any of that and you simply want to download the answers, you can click that link at any time."
    },
    {
      "id": 60,
      "text": "Okay, here's my top scoring answers. I just gave in that interview here we go."
    },
    {
      "id": 61,
      "text": "Okay, so let's start working through those exact answers. I just gave in that interview to the behavioral interview questions."
    },
    {
      "id": 62,
      "text": "All these answers use the star method of situation, task action and result."
    },
    {
      "id": 63,
      "text": "So the first behavioral interview question was, tell me about a time you made a mistake."
    },
    {
      "id": 64,
      "text": "Lots of people respond to this question by saying they never made a mistake because they are a perfectionist. That is not the way to answer this difficult question. Here's the exact response I gave."
    },
    {
      "id": 65,
      "text": "Tell me about a time you made a mistake."
    },
    {
      "id": 66,
      "text": "In my last job, I was taking a customer's order over the telephone."
    },
    {
      "id": 67,
      "text": "It was my task to pay attention and deliver excellent customer service. However, in my hastiness to deal with the customer quickly, I failed to listen fully to their requested order."
    },
    {
      "id": 68,
      "text": "And when I dispatched the goods, it was incomplete. Now this was a foolish mistake. And as soon as I realised, I contacted the customer, apologized, and sent out the correct items along with an apology note and they discount off their next order."
    },
    {
      "id": 69,
      "text": "To make sure I never made the same mistake again, I wrote down all orders on a sheet of paper and double checked them with the customer to ensure they were correct."
    },
    {
      "id": 70,
      "text": "That is a really good answer you are using the star method, situation, task action and result. You are giving a situation where you made a mistake, you are recognizing the mistake, apologizing and then taking immediate steps to put things right."
    },
    {
      "id": 71,
      "text": "And then more importantly, at the end, you are saying you learned from the situation. So it's a really good answer to that tough behavioral interview question."
    },
    {
      "id": 72,
      "text": "Don't forget, you can pause the video and write down the answers if you want to, or at the end, I will tell you where you can download all of the answers in a PDF document."
    },
    {
      "id": 73,
      "text": "Meaning you can have everything in your inbox within two minutes from now. Here is the next question."
    },
    {
      "id": 74,
      "text": "Tell me about a time you disagreed with your boss. Here is the answer. I just gave that uses a star method."
    },
    {
      "id": 75,
      "text": "I was in a team meeting with my boss discussing the redesign of the company's website. My boss wanted to use an expensive local contractor for the work, but I disagreed with their choice."
    },
    {
      "id": 76,
      "text": "It was my task to explain why I disagreed in a professional manner. I explained to my boss that the contractor was expensive and after reading reviews from previous clients, I felt there were better alternatives."
    },
    {
      "id": 77,
      "text": "I suggested we use an online contractor from the website upwork.com where we could choose one with better reviews and who would be more cost-effective helping save the company money."
    },
    {
      "id": 78,
      "text": "Now, after considering my alternative option, my manager went ahead and hired an online contractor from upwork and created a brilliant website for the company at half the price."
    },
    {
      "id": 79,
      "text": "That is a really good answer again. The use is a star method of situation, task action and result."
    },
    {
      "id": 80,
      "text": "Lots of people respond to that tough behavioural interview question by saying they would never disagree with their boss because their boss is the person who is in charge."
    },
    {
      "id": 81,
      "text": "However, this question is assessing your confidence and communication skills to see whether you would disagree if you think there's a better alternative that will help the company."
    },
    {
      "id": 82,
      "text": "That is a great answer."
    },
    {
      "id": 83,
      "text": "The next behavioural interview question I had to answer in that live job interview was tell me about a time you delivered excellent customer service."
    },
    {
      "id": 84,
      "text": "This question comes up all the time during job interviews. Don't forget to give a specific situation you have been in."
    },
    {
      "id": 85,
      "text": "Or if it's your first job interview, tell them what you would do to deliver excellent customer service. Here is the exact answer I gave that uses a star method."
    },
    {
      "id": 86,
      "text": "Here we go. Tell me about a time you delivered excellent customer service. I was helping an elderly customer on the telephone."
    },
    {
      "id": 87,
      "text": "They wanted to place an order from our website, but had concerns about security."
    },
    {
      "id": 88,
      "text": "It was my task to be patient with the customer, reassure them and walk them through the payment process."
    },
    {
      "id": 89,
      "text": "I listened to their concerns, asked questions, and talked them through every step of the ordering process, making sure they fully understood everything I was saying."
    },
    {
      "id": 90,
      "text": "Although the call took much longer than expected, the customer successfully placed the order and they thanked me for being patient and reassuring them while assisting them placed their order."
    },
    {
      "id": 91,
      "text": "The really good answer is shows that you go above and beyond to deliver excellent customer service."
    },
    {
      "id": 92,
      "text": "Again, you are using that brilliant technique, the star method of situation, task, action and result."
    },
    {
      "id": 93,
      "text": "It will help you get higher scores in your job interview because it is recognized by all hiring managers."
    },
    {
      "id": 94,
      "text": "Now the next behavioral interview question I had to answer was tell me about a time you had to work under pressure."
    },
    {
      "id": 95,
      "text": "Again, this is one of the more common behavioral interview questions. Here is the exact answer I gave."
    },
    {
      "id": 96,
      "text": "I was working on several important tasks in my last job when my manager asked for a volunteer to cover the duties of a coworker who had to take a leave of absence due to a family emergency."
    },
    {
      "id": 97,
      "text": "Although I was busy, I volunteered to do their work. It was my task to reassess my current workload in addition to my coworkers to ensure everything was completed on time."
    },
    {
      "id": 98,
      "text": "I created a list of all tasks I was now responsible for and color coded them in order of priority."
    },
    {
      "id": 99,
      "text": "Red tasks required my immediate attention. Blue tasks came second and green tasks could be left for the end of the working day."
    },
    {
      "id": 100,
      "text": "I then assessed the time it would take to complete each task. Blocked out distractions and started work."
    },
    {
      "id": 101,
      "text": "By prioritizing my workload against the company's goals and working methodically and efficiently, I completed all tasks to the required standard and on time."
    },
    {
      "id": 102,
      "text": "That's a great answer. I like that response because at the beginning you are saying, although you are really busy, you volunteered to do the work of your coworker as well as your own."
    },
    {
      "id": 103,
      "text": "It shows that you are a team player. It's a really good answer to that tough behavioral interview question that uses a star method again situation task action and result."
    },
    {
      "id": 104,
      "text": "Now the next thing to do is click that link right now in the top right hand corner of the video."
    },
    {
      "id": 105,
      "text": "Head straight through to my website, passmaintevue.com and you can instantly download. These answers I just gave these slides plus 50 brilliant quick answers to tough interview questions."
    },
    {
      "id": 106,
      "text": "That guide includes more brilliant responses to common behavioral interview questions."
    },
    {
      "id": 107,
      "text": "Make sure you check out that link download the guide. It will make a huge difference to your performance at every job interview you ever attend."
    },
    {
      "id": 108,
      "text": "It will save you lots of time when preparing for your interview, so make sure you check it out and download it."
    },
    {
      "id": 109,
      "text": "Also, don't forget to hit the subscribe button. Thousands of you are passing your job interviews. I can only help you if you are subscribed. Please hit the like button."
    },
    {
      "id": 110,
      "text": "It's a small favour to ask you, but if you like the videos, it does motivate me to create more great free content for you. Thank you very much."
    },
    {
      "id": 111,
      "text": "And don't forget to connect with me on LinkedIn. I have put my LinkedIn link in the description below the video."
    },
    {
      "id": 112,
      "text": "Thank you very much for watching and I wish you all the best for passing your job interview. Have a great day."
    }
  ]
}