{
  "file": "Qyga2TfbgEw.wav",
  "text": " Hello there, my name is Richard McMunn from HowToBecome.com and in this training video, I'm going to help you prepare for an Amazon assessment test. If you are applying for any job role with Amazon, make sure you stay tuned because the tips and practice questions I am about to give you will help you get the highest scores possible during the real Amazon aptitude test. To help you pass your Amazon assessment test at the first attempt, I will cover the following three things in this training video. I am going to give you five great tips to help you pass your Amazon assessment test at the first attempt. I will then give you lots of practice test questions to try in preparation for the real Amazon test. And then finally, number three, I will tell you how you can instantly access my free online Amazon testing resource. And just for a quickly, if you are new to my YouTube channel, please make sure you hit that subscribe button right now. Thousands of you are passing your tests and job interviews at the first attempt. I can only help you if you are subscribed and please give the video a thumbs up. Hit that like button right now because that tells me you find these training videos useful and it also motivates me to create more great content for you. Thank you very much indeed. Okay, let's get started with those five tips for passing your Amazon assessment test at the first attempt. So tip number one is to make sure you focus on practicing a variety of different tests that are similar to the ones you must undertake during the real Amazon assessment test. So the questions we are going to focus on today include work style, chart data interpretation, work simulation, numerical reasoning and the Amazon leadership principles. Now Amazon has a set of 16 leadership principles. If you want to pass your Amazon assessment test, you need to quickly learn and understand these leadership principles. They are absolutely crucial to your success during the Amazon selection process. Tip number two is to make sure you practice as many sample test questions as possible before the real Amazon assessment test. Now basically the more questions you practice, the higher your scores will be on the real Amazon test. So we are going to cover lots of practice test questions during this free training tutorial and I am then going to give you further free tests to try out on my website. Tip number three for passing your Amazon test. This is important. Make sure you practice your test questions under timed conditions. This is important. Now during the real Amazon test, you will be timed. So make sure you get used to that time pressure by practicing the test questions under strict time guidelines. And tip number four, when answering customer based test questions, make sure you put the needs of the customer first and act quickly. So during the real Amazon assessment test, you will have to answer some questions based on how you would deal with customer inquiries. Make sure you always put the needs of the customer first and act really quickly. Amazon is such a successful and brilliant organization because it obsesses about its customers. So make sure you focus on delivering excellent customer service when answering the customer based test questions. And tip number five for passing your Amazon assessment test is to make sure and I have already mentioned this, you learn and understand those 16 Amazon leadership principles. I strongly believe if you learn and understand these leadership principles, you will pass your Amazon test at the first attempt. So let me give you to start off with a quick explanation as to what those 16 Amazon leadership principles are. These are vital to your success. So the first of our 16 Amazon leadership principles is customer obsession. So this basically means and I've written this in my own words that Amazon always starts with the customer, they earn their trust and they obsess over their needs. The second of our 16 leadership principles is called ownership. So you should always think long-term act for the entire company and never ever say that's not my job. When you work for Amazon, you will take ownership of difficult challenges and help the entire company. The next of our 16 leadership principles that Amazon is invent and simplify. So this basically means that you expect to innovate in your work, you always look to simplify processes, make things easier and more efficient and also embrace external ideas. So you will always ask other people for their views and opinions and embrace external ideas. The next leadership principle of Amazon is that you are right a lot of the time. So this means that you will exhibit strong judgment, you will seek diverse perspectives other people's opinions and then confirm beliefs. The next one is learn and be curious. This is important. So it means that you will continuously learn and develop, explore new possibilities and improve yourself. So if ever you are given the opportunity to undertake training development courses, you will say yes and you will do your best during the training course to learn and improve your skills. The next of our 16 Amazon leadership principles is to hire and develop the best people. This means raising the performance bar, recognising talent and also developing leaders. So if there is someone in your team when you are working at Amazon who has the potential to be a great leader then you should put them forward and support them. The next leadership principle is to always insist on the highest standards. So this is all about maintaining high quality, again raising the bar and fixing problems permanently. So a lot of companies will just put together a solution to a problem that isn't long term. But when you work at Amazon you have to fix the problem permanently. The next leadership principle is to think big. This means that you will create bold directions, think differently than other companies and also serve customers innovatively. The next leadership principle, bias for action, is meaning that you will value speed. That means that you will act quickly, take calculated risks. Always remember that Amazon has become so successful and in my opinion probably the best organisation in the world because it is prepared to take calculated risks. Not stupid risks but calculated risk and you always act decisively. The next leadership principle, through gality, this means that you will achieve more with fewer resources and you will also foster resourcefulness. So you should always take a cost conscious approach to your work when working at Amazon. That's called frugality. You look to save costs and be more efficient in processes and company procedures. Earned trust is the next leadership principle. So you will listen to others. Speak candidly, say how you feel professionally and also benchmark against the best organisations. The next one is to dive deep. This means that you will dive deep by operating at all levels, stay connected to details and audit frequently. This is one of the reasons why we are going to take a look at some data chart interpretation tests so that you start looking at information on the screen and then use that data and information to make the right decisions. The next one is to always have backbone, not be afraid to disagree with others professionally and then commit. So you will challenge decisions respectfully and then commit once everyone has decided on the best way forward. The next leadership principle that Amazon is to deliver results. Always focus on key inputs, deliver with quality and timelines and also persevere. The next one is to strive to be the Earth's best employer. And that's all about creating a safer environment, having a diverse workforce and also an enjoyable work environment. And then finally, the 16th Amazon Leadership Principle is called Success and Scale Bring Broad Responsibility. So that means you should be humble, thoughtful and leave a positive impact on everything you do in your work. Those are the 16 Leadership Principles. Make sure you learn and understand them and you will realize how we progress during this training video. You will realize how important these Leadership Principles are. They will help you to answer the Amazon Assessment Test Questions correctly. Okay, let's start off with our first practice session and this is called a work simulation assessment test. Now this type of Amazon test assesses an applicant's problem solving and decision-making capabilities. Let's take a look at a sample test question that I have created. So basically you start work at 9 a.m. And there are five customer inquiries that need your attention. So these are the five customer inquiries. Now we're going to take a look at these individually. But the question states which of these inquiries would you respond to first? Now this is a difficult question to answer. However, if you understand those Leadership Principles, you will know which one the you need to respond to first. So let's take a look at them and then I will get you to answer this question by putting your response in the comment section below the video. So let's have a look. The first one is called an urgent, unfulfilled audit. You start work and these five inquiries are in your email inbox. And this one says, it's from a customer. I placed an order for a laptop two weeks ago and it still hasn't been delivered. This is urgent. I need it for work. Please assist ASAP. Now the second customer inquiry is called a product inquiry. So the customer has said to you, hi, I am interested in buying a laptop. But I need help comparing different models. Can you provide detailed specifications for laptops, A, B and C? The next customer inquiry is a return and refund request. I received a damaged phone case. I would like to return it and get a refund. Please guide me through the return process. The fourth customer inquiry is called Account Access Issue. I can't access my account. It says my password is incorrect. But I haven't changed it. Please help me regain access to my account. And the fifth customer inquiry that you have to deal with is called feedback and suggestion. And it says, I have some feedback and suggestions about your website's user interface. Is there a way I can share my thoughts with the development team? Okay, so those are the five customer inquiries you have to deal with. But the question is, which of those inquiries would you respond to first? Would you respond to A, the urgent unfulfilled order? B, that product inquiry, C, the return and refund request, D, that account access issue, or the feedback and suggestion? So please tell me which answer option you would respond to first, A, B, C, D, or E. Tell me in the comments section below the video. I will come on a each day and mark your answers for you. You've got 10 seconds to put your answer in the comment section below the video. Here we go. Okay, well done. And don't forget, the 16 Amazon leadership principles, customer obsession. Question number two, try another answer. This time, question two is, which of the inquiries would you respond to last? B, C, D, or E? Tell me your answer in the comment section below the video. Here's your 10 second timer. Don't forget, customer obsession is one of the leadership principles and you have to act decisively. Okay, let's now move on to a different type of Amazon assessment test, practice question. This is called a work style assessment test. Now, this test, assesses that your work style is in line with Amazon's leadership principles. So again, you can see why it is so important that you learn, understand and demonstrate these leadership principles in your work. So work style assessment test question number three. Now we are given a statement. My emphasis on making customers feel valued and delivering excellent service outweighs my focus on outperforming competitors. And we are given some options. Do we a strongly agree with that statement? Be agree with it. See, neither agree or disagree. D disagree or E strongly disagree. Now, I would choose strongly agree. Why would I choose that answer? I would choose it because of the customer obsession leadership principle, which says, start with a customer earn their trust and obsess over their needs. So that's exactly how I would answer that question. And again, you can see why it is so important to learn and understand those leadership principles before you undertake your Amazon assessment test. Because you're making the customer feel valued and you are delivering excellent service. And that is more important to you than your focus on outperforming competitors. The reason being, if you deliver brilliant outstanding service, customers will come back to you time and time again and you will by default beat your competitors. So now it's your turn to try some. Work style assessment test question number four. Whenever I have an idea during a team meeting, I will either a, put forward my idea or as soon as possible without interrupting others. B, wait until the end of the meeting and then put forward my idea. C, listen to others contributions first before deciding whether my idea is worthy. D, wait for my manager to give me the opportunity to put forward my idea and E, wait until the meeting is over and then send my idea to my manager by email. Please put your answer, ABC, D, or E in the comments section below the video and I will market for you. Here is your 10 second timer. Okay, brilliant. Well done and don't forget to focus on those leadership principles. Is another one for you to try. Work style assessment test question number five. You propose an idea during a team meeting, but your manager explains to you why it will not work. What do you do? A, apologise for putting forward a bad idea and don't contribute any further. B, decide that this job isn't for you and start to look for a new job elsewhere where your ideas will be valued. C, accept your manager is right, learn from the experience and think of alternative ideas to contribute to the team. D, wait until the meeting is finished before confronting your manager about why you believe your idea will work. Please put your answer in the comments section below the video for marking. Is it ABC or D that you would do based on that statement? Here's your timer. Brilliant. Well done. You are making fantastic progress. Let's try two more. Work style assessment test question number six. Now your manager gives you the opportunity to attend a training course that will develop a new skill, but you are very busy with lots of tasks. What do you do? A, politely decline the offer of the course stating you are too busy to attend. B, accept the offer of the training course and then find the time to study and complete all your tasks simultaneously. See, tell your manager you are very busy but you would love to attend the course later in the year when you have more time or D, tell your manager you are too busy to attend, but you would be happy if they offer the course to one of your co-workers so it isn't wasted. Put your answer in the comments section below the video. Don't forget those Amazon leadership principles. Here is your 10 second timer. ABC or D in the comments section below please. Thanks. And try one more before we move on to some different test questions. This is Work style assessment test question seven. You notice one of your co-workers keeps making errors in their work and they are often late completing tasks. What would you do? A. For the situation you are not a manager and therefore this is none of your business. B, inform your manager of your co-workers under performance so they can deal with the situation. C, tell other people in your team about your co-workers under performance so you can collectively put pressure on them to improve. D, speak to your co-worker privately to explain your concerns and tell them what they need to do to put things right and then offer to support them in their work. Your answer, ABC or D in the comments section below the video for marking. Thank you very much. Here is your 10 second timer. Here we go. So again you can see that those people who learn those leadership principles read and learn them are more likely far more likely to pass their Amazon online assessment test. Let's now try a slightly different type of work style Amazon practice test question. This is test question number eight. So it says read the two statements below one and two and then choose the one statement that best applies to you. Let's have a look at it. Statement number one says I will not take calculated risks when making important decisions and statement number two is I see waste elimination is an important part of budget control and your answer options are statement one or statement two. So which of those statements one or two best applies for you? Now I would choose statement two why? Well because of the leadership principles. Don't forget through Galatys states you achieve more with fewer resources and you foster resourcefulness and statement two says I see waste elimination is an important part of budget control. So that statement shows that you are applying the leadership principle of frugality. Now statement number one says I will not take calculated risks when making important decisions but that goes against the leadership principle of bias for action which is value speed take calculated risks but that says not take calculated risks. So that one is not applicable to me because I want to demonstrate those leadership principles again you can see why it is so imperative you learn and understand those leadership principles take calculated risks. Right now it's time for you to try some work style assessment test question number nine. Read the two statements below one and two and choose the one statement the best applies for you. Statement one rules and regulations at work are there to be broken. Statement number two I obsess over the needs of customers which one would you choose a statement one or b statement two please put your answer in the comment section below to video for marking for question nine is your 10 second timer. Well done let's now try work style assessment test question number ten. Read the two statements below one and two and choose the one statement the best applies to you statement one quantity is more important than quality statement two we should be led by customer input answer option a statement one or statement two which one of those best applies to you please put your answer in the comment section below the video. Don't forget the leadership principles. He's your 10 second timer. Tremendous well done I'm really proud that you are still practicing these questions. They're definitely going to help you pass your Amazon assessment test. Let's now take a look at chart data interpretation test. So this type of practice test assesses your ability to use accurate information and data to solve challenging problems. So we are given a chart. Now this chart is called online daily orders for a three week period at a specific company. And question 11 states what was the total number of online orders for that three week period? So the chart we have the weeks one two and three across the top on the left we have the days. Monday Tuesday Wednesday Thursday Friday Saturday and Sunday at the bottom we have the total for each week. So we after then decide what was the total number of online orders for that three week period? Is it a? 2,196 orders be? 2,916c? 1,946d? 1,216 orders or e none of the above? Put your answer to question 11 in the comment section below the video. I'll give you 12 seconds to answer this question and you can use a calculator if you want to or the calculator on your smartphone to work out this answer to this question 11. He's your time. Brilliant. Well done try another one. So this is the same chart. But question 12 is how many more orders were there on Monday compared to Sunday across the three week period? Is it a? 2,196b? 2,916c? 93d? 119 or e none of the above? So put your answer to question 12 in the comment section below the video for marking. So the question again is how many more orders were there on Monday compared to Sunday across the three week period? Here's your 12 second timer. Fantastic. Well done. You can see how important it is to practice under time conditions. By the way, if you need more time to answer any of these questions, just pause the video is important. You get the answer correct. Question 13, which day of the week had the most orders across that three week period? Is it a? Monday, b, Tuesday, c Wednesday? D Thursday or e none of the above? Please put your answer in the comment section below the video. Now you should be able to do this just by analyzing the data and numbers on the page. Try doing it without a calculator. Have a look at each day and see what which one you think has the most orders across the three week period? Here's your 12 second timer. Brilliant. Well done. You are making tremendous progress. Let's now take a look at a different chart. Question 14, the following chart shows the number of five star reviews received by a company in one week. What is the average daily number of five star reviews? So across the left we have the number of five star reviews received by the company. And across the bottom we have the day of the week. So we have Monday, Tuesday, Wednesday, Thursday, Friday, Saturday and Sunday. Okay, how do we calculate the answer? We'll step one at the total number of reviews for the week. So we have 100 there, 60 on Tuesday, 40 on Wednesday, 100 on Thursday, we have 60 on Friday, we have 20 on Saturday and 40 on Sunday. We had all of those together and that equals 420 but we need to know the average daily number of five star reviews. Well to work out the average we follow step two which is divide the total number of reviews for 120 by the number of days seven and then we get the average. So the answer is 420 divided by seven and the answer there would be 60. So now it's your turn to try some of these test questions. Question 15. Of our Amazon practice test questions. The following chart shows the number of orders a company processes per day. What is the average daily number of orders processed? So across the left the number of orders across the bottom the day of the week. So tell me your answer in the comment section below the video. Feel free to use a calculator. Now I'm going to give you 15 seconds. If you can do this in 15 seconds you are doing brilliant. But don't forget pause the video if you need more time here's your timer. Tremendous well done. Let's now try some numerical reasoning practice test questions that will help you prepare for your Amazon assessment test. So this test assesses your ability to use basic calculations in your daily work duties. Question 16. Mary has $100 to spend at the shops. If she spends $7 on a drink $5 on chocolate $37 on a dress and $38 on a pair of shoes, how much does she have left? Is it a $17? B $15? See $13 or D nothing. How do we calculate this? Well here's what we do. Step one. Simply add together all the items purchased by Mary. So that would be $7 $5. $37 and $38. And that equals 87. That's how much she has spent. And in step two simply deduct subtract what she has left from a total amount. $100 she had to spend at the shops minus 87 will give us the answer of C. So now it's your turn to try some of these. It will help you prepare for your Amazon assessment test. Question 17. Jonathan goes shopping and spends $42 on a pair of trousers. $57 on a pair of shoes. $16 on a shirt. And $29 on food. How much change will he have left from $145? A $1. B $4. C $11. D nothing. Put your answer in the comment section below the video for marking. Here's your timer. Well done. You are making fantastic progress. Don't forget very soon. I'm going to tell you where you can get more free practice tests to help you pass your Amazon assessment test. Question 18. A family have $1,500 to spend on a holiday. If they spend $350 on flights, $370 on a hotel, and $220 on a higher car, how much spending money will they have left? A $660. B $750. C $560. D $650. Please put your answer in the comment section below the video for marking. Here's your timer. Well done. Question number 19. Clive. There's Clive. Travels to work five days a week in his car. If he's journey to work is 22 kilometers, how many kilometers will he cover in three weeks? A $310. B $101. C $770. D $330. Please put your answer in the comment section below the video for marking. Here is your 12 second timer. Fantastic. Well done. Question number 20. Mario gets a taxi to work four days a week. Each day it costs him $17. How much will he have spent on taxes in eight weeks? Is it a? $870. B $952. C $588. Or D $544. Please put your answer in the comment section below the video. Here is your 12 second timer. Well done. Tramendous work. Now the next thing to do, if you want to accelerate your learning even further and try more, practice Amazon assessment test questions, is click that link right now in the top right-hand corner of the video. Head straight through to my website how to become.com and you can instantly get access to more free Amazon assessment test questions. This is a brilliant resource. It will help improve your scores during the real Amazon assessment test. Make sure you check out that link. Also don't forget to give the video a thumbs up. Hit that like button. It really does motivate me to create more great content for you. Don't forget to hit the subscribe button. I am here to help you pass every job interview and assessment test you ever undertake. I can only do those things if you are subscribed. Also please consider connecting with me on LinkedIn. I have put my LinkedIn link in the description below the video. It is always a pleasure and an honour to connect with like-minded professionals such as yourself. Thank you for watching and I wish you all the best for passing your Amazon assessment test have a wonderful day.",
  "segments": [
    {
      "id": 0,
      "text": "Hello there, my name is Richard McMunn from HowToBecome.com and in this training video, I'm"
    },
    {
      "id": 1,
      "text": "going to help you prepare for an Amazon assessment test."
    },
    {
      "id": 2,
      "text": "If you are applying for any job role with Amazon, make sure you stay tuned because"
    },
    {
      "id": 3,
      "text": "the tips and practice questions I am about to give you will help you get the highest"
    },
    {
      "id": 4,
      "text": "scores possible during the real Amazon aptitude test."
    },
    {
      "id": 5,
      "text": "To help you pass your Amazon assessment test at the first attempt, I will cover the following"
    },
    {
      "id": 6,
      "text": "three things in this training video."
    },
    {
      "id": 7,
      "text": "I am going to give you five great tips to help you pass your Amazon assessment test at the"
    },
    {
      "id": 8,
      "text": "first attempt."
    },
    {
      "id": 9,
      "text": "I will then give you lots of practice test questions to try in preparation for the real"
    },
    {
      "id": 10,
      "text": "Amazon test."
    },
    {
      "id": 11,
      "text": "And then finally, number three, I will tell you how you can instantly access my free online"
    },
    {
      "id": 12,
      "text": "Amazon testing resource."
    },
    {
      "id": 13,
      "text": "And just for a quickly, if you are new to my YouTube channel, please make sure you hit"
    },
    {
      "id": 14,
      "text": "that subscribe button right now."
    },
    {
      "id": 15,
      "text": "Thousands of you are passing your tests and job interviews at the first attempt."
    },
    {
      "id": 16,
      "text": "I can only help you if you are subscribed and please give the video a thumbs up."
    },
    {
      "id": 17,
      "text": "Hit that like button right now because that tells me you find these training videos"
    },
    {
      "id": 18,
      "text": "useful and it also motivates me to create more great content for you."
    },
    {
      "id": 19,
      "text": "Thank you very much indeed."
    },
    {
      "id": 20,
      "text": "Okay, let's get started with those five tips for passing your Amazon assessment test"
    },
    {
      "id": 21,
      "text": "at the first attempt."
    },
    {
      "id": 22,
      "text": "So tip number one is to make sure you focus on practicing a variety of different tests"
    },
    {
      "id": 23,
      "text": "that are similar to the ones you must undertake during the real Amazon assessment test."
    },
    {
      "id": 24,
      "text": "So the questions we are going to focus on today include work style, chart data interpretation,"
    },
    {
      "id": 25,
      "text": "work simulation, numerical reasoning and the Amazon leadership principles."
    },
    {
      "id": 26,
      "text": "Now Amazon has a set of 16 leadership principles."
    },
    {
      "id": 27,
      "text": "If you want to pass your Amazon assessment test, you need to quickly learn and understand"
    },
    {
      "id": 28,
      "text": "these leadership principles."
    },
    {
      "id": 29,
      "text": "They are absolutely crucial to your success during the Amazon selection process."
    },
    {
      "id": 30,
      "text": "Tip number two is to make sure you practice as many sample test questions as possible before"
    },
    {
      "id": 31,
      "text": "the real Amazon assessment test."
    },
    {
      "id": 32,
      "text": "Now basically the more questions you practice, the higher your scores will be on the real"
    },
    {
      "id": 33,
      "text": "Amazon test."
    },
    {
      "id": 34,
      "text": "So we are going to cover lots of practice test questions during this free training tutorial"
    },
    {
      "id": 35,
      "text": "and I am then going to give you further free tests to try out on my website."
    },
    {
      "id": 36,
      "text": "Tip number three for passing your Amazon test."
    },
    {
      "id": 37,
      "text": "This is important."
    },
    {
      "id": 38,
      "text": "Make sure you practice your test questions under timed conditions."
    },
    {
      "id": 39,
      "text": "This is important."
    },
    {
      "id": 40,
      "text": "Now during the real Amazon test, you will be timed."
    },
    {
      "id": 41,
      "text": "So make sure you get used to that time pressure by practicing the test questions under"
    },
    {
      "id": 42,
      "text": "strict time guidelines."
    },
    {
      "id": 43,
      "text": "And tip number four, when answering customer based test questions, make sure you put the"
    },
    {
      "id": 44,
      "text": "needs of the customer first and act quickly."
    },
    {
      "id": 45,
      "text": "So during the real Amazon assessment test, you will have to answer some questions based"
    },
    {
      "id": 46,
      "text": "on how you would deal with customer inquiries."
    },
    {
      "id": 47,
      "text": "Make sure you always put the needs of the customer first and act really quickly."
    },
    {
      "id": 48,
      "text": "Amazon is such a successful and brilliant organization because it obsesses about its customers."
    },
    {
      "id": 49,
      "text": "So make sure you focus on delivering excellent customer service when answering the customer"
    },
    {
      "id": 50,
      "text": "based test questions."
    },
    {
      "id": 51,
      "text": "And tip number five for passing your Amazon assessment test is to make sure and I have already"
    },
    {
      "id": 52,
      "text": "mentioned this, you learn and understand those 16 Amazon leadership principles."
    },
    {
      "id": 53,
      "text": "I strongly believe if you learn and understand these leadership principles, you will"
    },
    {
      "id": 54,
      "text": "pass your Amazon test at the first attempt."
    },
    {
      "id": 55,
      "text": "So let me give you to start off with a quick explanation as to what those 16 Amazon leadership"
    },
    {
      "id": 56,
      "text": "principles are."
    },
    {
      "id": 57,
      "text": "These are vital to your success."
    },
    {
      "id": 58,
      "text": "So the first of our 16 Amazon leadership principles is customer obsession."
    },
    {
      "id": 59,
      "text": "So this basically means and I've written this in my own words that Amazon always starts"
    },
    {
      "id": 60,
      "text": "with the customer, they earn their trust and they obsess over their needs."
    },
    {
      "id": 61,
      "text": "The second of our 16 leadership principles is called ownership."
    },
    {
      "id": 62,
      "text": "So you should always think long-term act for the entire company and never ever say that's"
    },
    {
      "id": 63,
      "text": "not my job."
    },
    {
      "id": 64,
      "text": "When you work for Amazon, you will take ownership of difficult challenges and help the"
    },
    {
      "id": 65,
      "text": "entire company."
    },
    {
      "id": 66,
      "text": "The next of our 16 leadership principles that Amazon is invent and simplify."
    },
    {
      "id": 67,
      "text": "So this basically means that you expect to innovate in your work, you always look to simplify"
    },
    {
      "id": 68,
      "text": "processes, make things easier and more efficient and also embrace external ideas."
    },
    {
      "id": 69,
      "text": "So you will always ask other people for their views and opinions and embrace external ideas."
    },
    {
      "id": 70,
      "text": "The next leadership principle of Amazon is that you are right a lot of the time."
    },
    {
      "id": 71,
      "text": "So this means that you will exhibit strong judgment, you will seek diverse perspectives"
    },
    {
      "id": 72,
      "text": "other people's opinions and then confirm beliefs."
    },
    {
      "id": 73,
      "text": "The next one is learn and be curious."
    },
    {
      "id": 74,
      "text": "This is important."
    },
    {
      "id": 75,
      "text": "So it means that you will continuously learn and develop, explore new possibilities and"
    },
    {
      "id": 76,
      "text": "improve yourself."
    },
    {
      "id": 77,
      "text": "So if ever you are given the opportunity to undertake training development courses, you"
    },
    {
      "id": 78,
      "text": "will say yes and you will do your best during the training course to learn and improve"
    },
    {
      "id": 79,
      "text": "your skills."
    },
    {
      "id": 80,
      "text": "The next of our 16 Amazon leadership principles is to hire and develop the best people."
    },
    {
      "id": 81,
      "text": "This means raising the performance bar, recognising talent and also developing leaders."
    },
    {
      "id": 82,
      "text": "So if there is someone in your team when you are working at Amazon who has the potential"
    },
    {
      "id": 83,
      "text": "to be a great leader then you should put them forward and support them."
    },
    {
      "id": 84,
      "text": "The next leadership principle is to always insist on the highest standards."
    },
    {
      "id": 85,
      "text": "So this is all about maintaining high quality, again raising the bar and fixing problems"
    },
    {
      "id": 86,
      "text": "permanently."
    },
    {
      "id": 87,
      "text": "So a lot of companies will just put together a solution to a problem that isn't long term."
    },
    {
      "id": 88,
      "text": "But when you work at Amazon you have to fix the problem permanently."
    },
    {
      "id": 89,
      "text": "The next leadership principle is to think big."
    },
    {
      "id": 90,
      "text": "This means that you will create bold directions, think differently than other companies"
    },
    {
      "id": 91,
      "text": "and also serve customers innovatively."
    },
    {
      "id": 92,
      "text": "The next leadership principle, bias for action, is meaning that you will value speed."
    },
    {
      "id": 93,
      "text": "That means that you will act quickly, take calculated risks."
    },
    {
      "id": 94,
      "text": "Always remember that Amazon has become so successful and in my opinion probably the best"
    },
    {
      "id": 95,
      "text": "organisation in the world because it is prepared to take calculated risks."
    },
    {
      "id": 96,
      "text": "Not stupid risks but calculated risk and you always act decisively."
    },
    {
      "id": 97,
      "text": "The next leadership principle, through gality, this means that you will achieve more with"
    },
    {
      "id": 98,
      "text": "fewer resources and you will also foster resourcefulness."
    },
    {
      "id": 99,
      "text": "So you should always take a cost conscious approach to your work when working at Amazon."
    },
    {
      "id": 100,
      "text": "That's called frugality."
    },
    {
      "id": 101,
      "text": "You look to save costs and be more efficient in processes and company procedures."
    },
    {
      "id": 102,
      "text": "Earned trust is the next leadership principle."
    },
    {
      "id": 103,
      "text": "So you will listen to others."
    },
    {
      "id": 104,
      "text": "Speak candidly, say how you feel professionally and also benchmark against the best"
    },
    {
      "id": 105,
      "text": "organisations."
    },
    {
      "id": 106,
      "text": "The next one is to dive deep."
    },
    {
      "id": 107,
      "text": "This means that you will dive deep by operating at all levels, stay connected to details"
    },
    {
      "id": 108,
      "text": "and audit frequently."
    },
    {
      "id": 109,
      "text": "This is one of the reasons why we are going to take a look at some data chart interpretation"
    },
    {
      "id": 110,
      "text": "tests so that you start looking at information on the screen and then use that data and"
    },
    {
      "id": 111,
      "text": "information to make the right decisions."
    },
    {
      "id": 112,
      "text": "The next one is to always have backbone, not be afraid to disagree with others professionally"
    },
    {
      "id": 113,
      "text": "and then commit."
    },
    {
      "id": 114,
      "text": "So you will challenge decisions respectfully and then commit once everyone has decided on"
    },
    {
      "id": 115,
      "text": "the best way forward."
    },
    {
      "id": 116,
      "text": "The next leadership principle that Amazon is to deliver results."
    },
    {
      "id": 117,
      "text": "Always focus on key inputs, deliver with quality and timelines and also persevere."
    },
    {
      "id": 118,
      "text": "The next one is to strive to be the Earth's best employer."
    },
    {
      "id": 119,
      "text": "And that's all about creating a safer environment, having a diverse workforce and also"
    },
    {
      "id": 120,
      "text": "an enjoyable work environment."
    },
    {
      "id": 121,
      "text": "And then finally, the 16th Amazon Leadership Principle is called Success and Scale"
    },
    {
      "id": 122,
      "text": "Bring Broad Responsibility."
    },
    {
      "id": 123,
      "text": "So that means you should be humble, thoughtful and leave a positive impact on everything"
    },
    {
      "id": 124,
      "text": "you do in your work."
    },
    {
      "id": 125,
      "text": "Those are the 16 Leadership Principles."
    },
    {
      "id": 126,
      "text": "Make sure you learn and understand them and you will realize how we progress during this training"
    },
    {
      "id": 127,
      "text": "video."
    },
    {
      "id": 128,
      "text": "You will realize how important these Leadership Principles are."
    },
    {
      "id": 129,
      "text": "They will help you to answer the Amazon Assessment Test Questions correctly."
    },
    {
      "id": 130,
      "text": "Okay, let's start off with our first practice session and this is called a work simulation"
    },
    {
      "id": 131,
      "text": "assessment test."
    },
    {
      "id": 132,
      "text": "Now this type of Amazon test assesses an applicant's problem solving and decision-making"
    },
    {
      "id": 133,
      "text": "capabilities."
    },
    {
      "id": 134,
      "text": "Let's take a look at a sample test question that I have created."
    },
    {
      "id": 135,
      "text": "So basically you start work at 9 a.m."
    },
    {
      "id": 136,
      "text": "And there are five customer inquiries that need your attention."
    },
    {
      "id": 137,
      "text": "So these are the five customer inquiries."
    },
    {
      "id": 138,
      "text": "Now we're going to take a look at these individually."
    },
    {
      "id": 139,
      "text": "But the question states which of these inquiries would you respond to first?"
    },
    {
      "id": 140,
      "text": "Now this is a difficult question to answer."
    },
    {
      "id": 141,
      "text": "However, if you understand those Leadership Principles, you will know which one the"
    },
    {
      "id": 142,
      "text": "you need to respond to first."
    },
    {
      "id": 143,
      "text": "So let's take a look at them and then I will get you to answer this question by putting"
    },
    {
      "id": 144,
      "text": "your response in the comment section below the video."
    },
    {
      "id": 145,
      "text": "So let's have a look."
    },
    {
      "id": 146,
      "text": "The first one is called an urgent, unfulfilled audit."
    },
    {
      "id": 147,
      "text": "You start work and these five inquiries are in your email inbox."
    },
    {
      "id": 148,
      "text": "And this one says, it's from a customer."
    },
    {
      "id": 149,
      "text": "I placed an order for a laptop two weeks ago and it still hasn't been delivered."
    },
    {
      "id": 150,
      "text": "This is urgent."
    },
    {
      "id": 151,
      "text": "I need it for work."
    },
    {
      "id": 152,
      "text": "Please assist ASAP."
    },
    {
      "id": 153,
      "text": "Now the second customer inquiry is called a product inquiry."
    },
    {
      "id": 154,
      "text": "So the customer has said to you, hi, I am interested in buying a laptop."
    },
    {
      "id": 155,
      "text": "But I need help comparing different models."
    },
    {
      "id": 156,
      "text": "Can you provide detailed specifications for laptops, A, B and C?"
    },
    {
      "id": 157,
      "text": "The next customer inquiry is a return and refund request."
    },
    {
      "id": 158,
      "text": "I received a damaged phone case."
    },
    {
      "id": 159,
      "text": "I would like to return it and get a refund."
    },
    {
      "id": 160,
      "text": "Please guide me through the return process."
    },
    {
      "id": 161,
      "text": "The fourth customer inquiry is called Account Access Issue."
    },
    {
      "id": 162,
      "text": "I can't access my account."
    },
    {
      "id": 163,
      "text": "It says my password is incorrect."
    },
    {
      "id": 164,
      "text": "But I haven't changed it."
    },
    {
      "id": 165,
      "text": "Please help me regain access to my account."
    },
    {
      "id": 166,
      "text": "And the fifth customer inquiry that you have to deal with is called feedback and suggestion."
    },
    {
      "id": 167,
      "text": "And it says, I have some feedback and suggestions about your website's user interface."
    },
    {
      "id": 168,
      "text": "Is there a way I can share my thoughts with the development team?"
    },
    {
      "id": 169,
      "text": "Okay, so those are the five customer inquiries you have to deal with."
    },
    {
      "id": 170,
      "text": "But the question is, which of those inquiries would you respond to first?"
    },
    {
      "id": 171,
      "text": "Would you respond to A, the urgent unfulfilled order?"
    },
    {
      "id": 172,
      "text": "B, that product inquiry, C, the return and refund request, D, that account access issue,"
    },
    {
      "id": 173,
      "text": "or the feedback and suggestion?"
    },
    {
      "id": 174,
      "text": "So please tell me which answer option you would respond to first, A, B, C, D, or E."
    },
    {
      "id": 175,
      "text": "Tell me in the comments section below the video."
    },
    {
      "id": 176,
      "text": "I will come on a each day and mark your answers for you."
    },
    {
      "id": 177,
      "text": "You've got 10 seconds to put your answer in the comment section below the video."
    },
    {
      "id": 178,
      "text": "Here we go."
    },
    {
      "id": 179,
      "text": "Okay, well done."
    },
    {
      "id": 180,
      "text": "And don't forget, the 16 Amazon leadership principles, customer obsession."
    },
    {
      "id": 181,
      "text": "Question number two, try another answer."
    },
    {
      "id": 182,
      "text": "This time, question two is, which of the inquiries would you respond to last?"
    },
    {
      "id": 183,
      "text": "B, C, D, or E?"
    },
    {
      "id": 184,
      "text": "Tell me your answer in the comment section below the video."
    },
    {
      "id": 185,
      "text": "Here's your 10 second timer."
    },
    {
      "id": 186,
      "text": "Don't forget, customer obsession is one of the leadership principles"
    },
    {
      "id": 187,
      "text": "and you have to act decisively."
    },
    {
      "id": 188,
      "text": "Okay, let's now move on to a different type of Amazon assessment test,"
    },
    {
      "id": 189,
      "text": "practice question."
    },
    {
      "id": 190,
      "text": "This is called a work style assessment test."
    },
    {
      "id": 191,
      "text": "Now, this test, assesses that your work style is in line with Amazon's leadership"
    },
    {
      "id": 192,
      "text": "principles."
    },
    {
      "id": 193,
      "text": "So again, you can see why it is so important that you learn, understand and"
    },
    {
      "id": 194,
      "text": "demonstrate these leadership principles in your work."
    },
    {
      "id": 195,
      "text": "So work style assessment test question number three."
    },
    {
      "id": 196,
      "text": "Now we are given a statement."
    },
    {
      "id": 197,
      "text": "My emphasis on making customers feel valued and delivering excellent service"
    },
    {
      "id": 198,
      "text": "outweighs my focus on outperforming competitors."
    },
    {
      "id": 199,
      "text": "And we are given some options."
    },
    {
      "id": 200,
      "text": "Do we a strongly agree with that statement?"
    },
    {
      "id": 201,
      "text": "Be agree with it."
    },
    {
      "id": 202,
      "text": "See, neither agree or disagree."
    },
    {
      "id": 203,
      "text": "D disagree or E strongly disagree."
    },
    {
      "id": 204,
      "text": "Now, I would choose strongly agree."
    },
    {
      "id": 205,
      "text": "Why would I choose that answer?"
    },
    {
      "id": 206,
      "text": "I would choose it because of the customer obsession leadership principle,"
    },
    {
      "id": 207,
      "text": "which says, start with a customer earn their trust and obsess over their needs."
    },
    {
      "id": 208,
      "text": "So that's exactly how I would answer that question."
    },
    {
      "id": 209,
      "text": "And again, you can see why it is so important to learn and understand those"
    },
    {
      "id": 210,
      "text": "leadership principles before you undertake your Amazon assessment test."
    },
    {
      "id": 211,
      "text": "Because you're making the customer feel valued and you are delivering excellent"
    },
    {
      "id": 212,
      "text": "service."
    },
    {
      "id": 213,
      "text": "And that is more important to you than your focus on outperforming competitors."
    },
    {
      "id": 214,
      "text": "The reason being, if you deliver brilliant outstanding service, customers will come back"
    },
    {
      "id": 215,
      "text": "to you time and time again and you will by default beat your competitors."
    },
    {
      "id": 216,
      "text": "So now it's your turn to try some."
    },
    {
      "id": 217,
      "text": "Work style assessment test question number four."
    },
    {
      "id": 218,
      "text": "Whenever I have an idea during a team meeting, I will either a, put forward my idea"
    },
    {
      "id": 219,
      "text": "or as soon as possible without interrupting others."
    },
    {
      "id": 220,
      "text": "B, wait until the end of the meeting and then put forward my idea."
    },
    {
      "id": 221,
      "text": "C, listen to others contributions first before deciding whether my idea is worthy."
    },
    {
      "id": 222,
      "text": "D, wait for my manager to give me the opportunity to put forward my idea and"
    },
    {
      "id": 223,
      "text": "E, wait until the meeting is over and then send my idea to my manager by email."
    },
    {
      "id": 224,
      "text": "Please put your answer, ABC, D, or E in the comments section below the video and I will"
    },
    {
      "id": 225,
      "text": "market for you."
    },
    {
      "id": 226,
      "text": "Here is your 10 second timer."
    },
    {
      "id": 227,
      "text": "Okay, brilliant."
    },
    {
      "id": 228,
      "text": "Well done and don't forget to focus on those leadership principles."
    },
    {
      "id": 229,
      "text": "Is another one for you to try."
    },
    {
      "id": 230,
      "text": "Work style assessment test question number five."
    },
    {
      "id": 231,
      "text": "You propose an idea during a team meeting, but your manager explains to you why it will"
    },
    {
      "id": 232,
      "text": "not work."
    },
    {
      "id": 233,
      "text": "What do you do?"
    },
    {
      "id": 234,
      "text": "A, apologise for putting forward a bad idea and don't contribute any further."
    },
    {
      "id": 235,
      "text": "B, decide that this job isn't for you and start to look for a new job elsewhere where"
    },
    {
      "id": 236,
      "text": "your ideas will be valued."
    },
    {
      "id": 237,
      "text": "C, accept your manager is right, learn from the experience and think of alternative ideas"
    },
    {
      "id": 238,
      "text": "to contribute to the team."
    },
    {
      "id": 239,
      "text": "D, wait until the meeting is finished before confronting your manager about why you believe"
    },
    {
      "id": 240,
      "text": "your idea will work."
    },
    {
      "id": 241,
      "text": "Please put your answer in the comments section below the video for marking."
    },
    {
      "id": 242,
      "text": "Is it ABC or D that you would do based on that statement?"
    },
    {
      "id": 243,
      "text": "Here's your timer."
    },
    {
      "id": 244,
      "text": "Brilliant."
    },
    {
      "id": 245,
      "text": "Well done."
    },
    {
      "id": 246,
      "text": "You are making fantastic progress."
    },
    {
      "id": 247,
      "text": "Let's try two more."
    },
    {
      "id": 248,
      "text": "Work style assessment test question number six."
    },
    {
      "id": 249,
      "text": "Now your manager gives you the opportunity to attend a training course that will develop"
    },
    {
      "id": 250,
      "text": "a new skill, but you are very busy with lots of tasks."
    },
    {
      "id": 251,
      "text": "What do you do?"
    },
    {
      "id": 252,
      "text": "A, politely decline the offer of the course stating you are too busy to attend."
    },
    {
      "id": 253,
      "text": "B, accept the offer of the training course and then find the time to study and complete"
    },
    {
      "id": 254,
      "text": "all your tasks simultaneously."
    },
    {
      "id": 255,
      "text": "See, tell your manager you are very busy but you would love to attend the course later"
    },
    {
      "id": 256,
      "text": "in the year when you have more time or D, tell your manager you are too busy to attend,"
    },
    {
      "id": 257,
      "text": "but you would be happy if they offer the course to one of your co-workers so it isn't"
    },
    {
      "id": 258,
      "text": "wasted."
    },
    {
      "id": 259,
      "text": "Put your answer in the comments section below the video."
    },
    {
      "id": 260,
      "text": "Don't forget those Amazon leadership principles."
    },
    {
      "id": 261,
      "text": "Here is your 10 second timer."
    },
    {
      "id": 262,
      "text": "ABC or D in the comments section below please."
    },
    {
      "id": 263,
      "text": "Thanks."
    },
    {
      "id": 264,
      "text": "And try one more before we move on to some different test questions."
    },
    {
      "id": 265,
      "text": "This is Work style assessment test question seven."
    },
    {
      "id": 266,
      "text": "You notice one of your co-workers keeps making errors in their work and they are often"
    },
    {
      "id": 267,
      "text": "late completing tasks."
    },
    {
      "id": 268,
      "text": "What would you do?"
    },
    {
      "id": 269,
      "text": "A."
    },
    {
      "id": 270,
      "text": "For the situation you are not a manager and therefore this is none of your business."
    },
    {
      "id": 271,
      "text": "B, inform your manager of your co-workers under performance so they can deal with the situation."
    },
    {
      "id": 272,
      "text": "C, tell other people in your team about your co-workers under performance so you can collectively"
    },
    {
      "id": 273,
      "text": "put pressure on them to improve."
    },
    {
      "id": 274,
      "text": "D, speak to your co-worker privately to explain your concerns and tell them what they need"
    },
    {
      "id": 275,
      "text": "to do to put things right and then offer to support them in their work."
    },
    {
      "id": 276,
      "text": "Your answer, ABC or D in the comments section below the video for marking."
    },
    {
      "id": 277,
      "text": "Thank you very much."
    },
    {
      "id": 278,
      "text": "Here is your 10 second timer."
    },
    {
      "id": 279,
      "text": "Here we go."
    },
    {
      "id": 280,
      "text": "So again you can see that those people who learn those leadership principles read and"
    },
    {
      "id": 281,
      "text": "learn them are more likely far more likely to pass their Amazon online assessment test."
    },
    {
      "id": 282,
      "text": "Let's now try a slightly different type of work style Amazon practice test question."
    },
    {
      "id": 283,
      "text": "This is test question number eight."
    },
    {
      "id": 284,
      "text": "So it says read the two statements below one and two and then choose the one statement"
    },
    {
      "id": 285,
      "text": "that best applies to you."
    },
    {
      "id": 286,
      "text": "Let's have a look at it."
    },
    {
      "id": 287,
      "text": "Statement number one says I will not take calculated risks when making important decisions"
    },
    {
      "id": 288,
      "text": "and statement number two is I see waste elimination is an important part of budget"
    },
    {
      "id": 289,
      "text": "control and your answer options are statement one or statement two."
    },
    {
      "id": 290,
      "text": "So which of those statements one or two best applies for you?"
    },
    {
      "id": 291,
      "text": "Now I would choose statement two why?"
    },
    {
      "id": 292,
      "text": "Well because of the leadership principles."
    },
    {
      "id": 293,
      "text": "Don't forget through Galatys states you achieve more with fewer resources and you"
    },
    {
      "id": 294,
      "text": "foster resourcefulness and statement two says I see waste elimination is an important"
    },
    {
      "id": 295,
      "text": "part of budget control."
    },
    {
      "id": 296,
      "text": "So that statement shows that you are applying the leadership principle of frugality."
    },
    {
      "id": 297,
      "text": "Now statement number one says I will not take calculated risks when making important decisions"
    },
    {
      "id": 298,
      "text": "but that goes against the leadership principle of bias for action which is value"
    },
    {
      "id": 299,
      "text": "speed take calculated risks but that says not take calculated risks."
    },
    {
      "id": 300,
      "text": "So that one is not applicable to me because I want to demonstrate those leadership"
    },
    {
      "id": 301,
      "text": "principles again you can see why it is so imperative you learn and understand those leadership"
    },
    {
      "id": 302,
      "text": "principles take calculated risks."
    },
    {
      "id": 303,
      "text": "Right now it's time for you to try some work style assessment test question number nine."
    },
    {
      "id": 304,
      "text": "Read the two statements below one and two and choose the one statement the best applies"
    },
    {
      "id": 305,
      "text": "for you."
    },
    {
      "id": 306,
      "text": "Statement one rules and regulations at work are there to be broken."
    },
    {
      "id": 307,
      "text": "Statement number two I obsess over the needs of customers which one would you choose"
    },
    {
      "id": 308,
      "text": "a statement one or b statement two please put your answer in the comment section below"
    },
    {
      "id": 309,
      "text": "to video for marking for question nine is your 10 second timer."
    },
    {
      "id": 310,
      "text": "Well done let's now try work style assessment test question number ten."
    },
    {
      "id": 311,
      "text": "Read the two statements below one and two and choose the one statement the best applies"
    },
    {
      "id": 312,
      "text": "to you statement one quantity is more important than quality statement two we should be"
    },
    {
      "id": 313,
      "text": "led by customer input answer option a statement one or statement two which one of those"
    },
    {
      "id": 314,
      "text": "best applies to you please put your answer in the comment section below the video."
    },
    {
      "id": 315,
      "text": "Don't forget the leadership principles."
    },
    {
      "id": 316,
      "text": "He's your 10 second timer."
    },
    {
      "id": 317,
      "text": "Tremendous well done I'm really proud that you are still practicing these questions."
    },
    {
      "id": 318,
      "text": "They're definitely going to help you pass your Amazon assessment test."
    },
    {
      "id": 319,
      "text": "Let's now take a look at chart data interpretation test."
    },
    {
      "id": 320,
      "text": "So this type of practice test assesses your ability to use accurate information and data"
    },
    {
      "id": 321,
      "text": "to solve challenging problems."
    },
    {
      "id": 322,
      "text": "So we are given a chart."
    },
    {
      "id": 323,
      "text": "Now this chart is called online daily orders for a three week period at a specific company."
    },
    {
      "id": 324,
      "text": "And question 11 states what was the total number of online orders for that three week period?"
    },
    {
      "id": 325,
      "text": "So the chart we have the weeks one two and three across the top on the left we have the"
    },
    {
      "id": 326,
      "text": "days."
    },
    {
      "id": 327,
      "text": "Monday Tuesday Wednesday Thursday Friday Saturday and Sunday at the bottom we have the total"
    },
    {
      "id": 328,
      "text": "for each week."
    },
    {
      "id": 329,
      "text": "So we after then decide what was the total number of online orders for that three week period?"
    },
    {
      "id": 330,
      "text": "Is it a?"
    },
    {
      "id": 331,
      "text": "2,196 orders be?"
    },
    {
      "id": 332,
      "text": "2,916c?"
    },
    {
      "id": 333,
      "text": "1,946d?"
    },
    {
      "id": 334,
      "text": "1,216 orders or e none of the above?"
    },
    {
      "id": 335,
      "text": "Put your answer to question 11 in the comment section below the video."
    },
    {
      "id": 336,
      "text": "I'll give you 12 seconds to answer this question and you can use a calculator if you want"
    },
    {
      "id": 337,
      "text": "to or the calculator on your smartphone to work out this answer to this question 11."
    },
    {
      "id": 338,
      "text": "He's your time."
    },
    {
      "id": 339,
      "text": "Brilliant."
    },
    {
      "id": 340,
      "text": "Well done try another one."
    },
    {
      "id": 341,
      "text": "So this is the same chart."
    },
    {
      "id": 342,
      "text": "But question 12 is how many more orders were there on Monday compared to Sunday across"
    },
    {
      "id": 343,
      "text": "the three week period?"
    },
    {
      "id": 344,
      "text": "Is it a?"
    },
    {
      "id": 345,
      "text": "2,196b?"
    },
    {
      "id": 346,
      "text": "2,916c?"
    },
    {
      "id": 347,
      "text": "93d?"
    },
    {
      "id": 348,
      "text": "119 or e none of the above?"
    },
    {
      "id": 349,
      "text": "So put your answer to question 12 in the comment section below the video for marking."
    },
    {
      "id": 350,
      "text": "So the question again is how many more orders were there on Monday compared to Sunday"
    },
    {
      "id": 351,
      "text": "across the three week period?"
    },
    {
      "id": 352,
      "text": "Here's your 12 second timer."
    },
    {
      "id": 353,
      "text": "Fantastic."
    },
    {
      "id": 354,
      "text": "Well done."
    },
    {
      "id": 355,
      "text": "You can see how important it is to practice under time conditions."
    },
    {
      "id": 356,
      "text": "By the way, if you need more time to answer any of these questions, just pause the video"
    },
    {
      "id": 357,
      "text": "is important."
    },
    {
      "id": 358,
      "text": "You get the answer correct."
    },
    {
      "id": 359,
      "text": "Question 13, which day of the week had the most orders across that three week period?"
    },
    {
      "id": 360,
      "text": "Is it a?"
    },
    {
      "id": 361,
      "text": "Monday, b, Tuesday, c Wednesday?"
    },
    {
      "id": 362,
      "text": "D Thursday or e none of the above?"
    },
    {
      "id": 363,
      "text": "Please put your answer in the comment section below the video."
    },
    {
      "id": 364,
      "text": "Now you should be able to do this just by analyzing the data and numbers on the page."
    },
    {
      "id": 365,
      "text": "Try doing it without a calculator."
    },
    {
      "id": 366,
      "text": "Have a look at each day and see what which one you think has the most orders across"
    },
    {
      "id": 367,
      "text": "the three week period?"
    },
    {
      "id": 368,
      "text": "Here's your 12 second timer."
    },
    {
      "id": 369,
      "text": "Brilliant."
    },
    {
      "id": 370,
      "text": "Well done."
    },
    {
      "id": 371,
      "text": "You are making tremendous progress."
    },
    {
      "id": 372,
      "text": "Let's now take a look at a different chart."
    },
    {
      "id": 373,
      "text": "Question 14, the following chart shows the number of five star reviews received by a company"
    },
    {
      "id": 374,
      "text": "in one week."
    },
    {
      "id": 375,
      "text": "What is the average daily number of five star reviews?"
    },
    {
      "id": 376,
      "text": "So across the left we have the number of five star reviews received by the company."
    },
    {
      "id": 377,
      "text": "And across the bottom we have the day of the week."
    },
    {
      "id": 378,
      "text": "So we have Monday, Tuesday, Wednesday, Thursday, Friday, Saturday and Sunday."
    },
    {
      "id": 379,
      "text": "Okay, how do we calculate the answer?"
    },
    {
      "id": 380,
      "text": "We'll step one at the total number of reviews for the week."
    },
    {
      "id": 381,
      "text": "So we have 100 there, 60 on Tuesday, 40 on Wednesday, 100 on Thursday, we have 60 on Friday,"
    },
    {
      "id": 382,
      "text": "we have 20 on Saturday and 40 on Sunday."
    },
    {
      "id": 383,
      "text": "We had all of those together and that equals 420 but we need to know the average daily number"
    },
    {
      "id": 384,
      "text": "of five star reviews."
    },
    {
      "id": 385,
      "text": "Well to work out the average we follow step two which is divide the total number of reviews"
    },
    {
      "id": 386,
      "text": "for 120 by the number of days seven and then we get the average."
    },
    {
      "id": 387,
      "text": "So the answer is 420 divided by seven and the answer there would be 60."
    },
    {
      "id": 388,
      "text": "So now it's your turn to try some of these test questions."
    },
    {
      "id": 389,
      "text": "Question 15."
    },
    {
      "id": 390,
      "text": "Of our Amazon practice test questions."
    },
    {
      "id": 391,
      "text": "The following chart shows the number of orders a company processes per day."
    },
    {
      "id": 392,
      "text": "What is the average daily number of orders processed?"
    },
    {
      "id": 393,
      "text": "So across the left the number of orders across the bottom the day of the week."
    },
    {
      "id": 394,
      "text": "So tell me your answer in the comment section below the video."
    },
    {
      "id": 395,
      "text": "Feel free to use a calculator."
    },
    {
      "id": 396,
      "text": "Now I'm going to give you 15 seconds."
    },
    {
      "id": 397,
      "text": "If you can do this in 15 seconds you are doing brilliant."
    },
    {
      "id": 398,
      "text": "But don't forget pause the video if you need more time here's your timer."
    },
    {
      "id": 399,
      "text": "Tremendous well done."
    },
    {
      "id": 400,
      "text": "Let's now try some numerical reasoning practice test questions that will help you prepare"
    },
    {
      "id": 401,
      "text": "for your Amazon assessment test."
    },
    {
      "id": 402,
      "text": "So this test assesses your ability to use basic calculations in your daily work duties."
    },
    {
      "id": 403,
      "text": "Question 16."
    },
    {
      "id": 404,
      "text": "Mary has $100 to spend at the shops."
    },
    {
      "id": 405,
      "text": "If she spends $7 on a drink $5 on chocolate $37 on a dress and $38 on a pair of shoes,"
    },
    {
      "id": 406,
      "text": "how much does she have left?"
    },
    {
      "id": 407,
      "text": "Is it a $17?"
    },
    {
      "id": 408,
      "text": "B $15?"
    },
    {
      "id": 409,
      "text": "See $13 or D nothing."
    },
    {
      "id": 410,
      "text": "How do we calculate this?"
    },
    {
      "id": 411,
      "text": "Well here's what we do."
    },
    {
      "id": 412,
      "text": "Step one."
    },
    {
      "id": 413,
      "text": "Simply add together all the items purchased by Mary."
    },
    {
      "id": 414,
      "text": "So that would be $7 $5."
    },
    {
      "id": 415,
      "text": "$37 and $38."
    },
    {
      "id": 416,
      "text": "And that equals 87."
    },
    {
      "id": 417,
      "text": "That's how much she has spent."
    },
    {
      "id": 418,
      "text": "And in step two simply deduct subtract what she has left from a total amount."
    },
    {
      "id": 419,
      "text": "$100 she had to spend at the shops minus 87 will give us the answer of C."
    },
    {
      "id": 420,
      "text": "So now it's your turn to try some of these."
    },
    {
      "id": 421,
      "text": "It will help you prepare for your Amazon assessment test."
    },
    {
      "id": 422,
      "text": "Question 17."
    },
    {
      "id": 423,
      "text": "Jonathan goes shopping and spends $42 on a pair of trousers."
    },
    {
      "id": 424,
      "text": "$57 on a pair of shoes."
    },
    {
      "id": 425,
      "text": "$16 on a shirt."
    },
    {
      "id": 426,
      "text": "And $29 on food."
    },
    {
      "id": 427,
      "text": "How much change will he have left from $145?"
    },
    {
      "id": 428,
      "text": "A $1."
    },
    {
      "id": 429,
      "text": "B $4."
    },
    {
      "id": 430,
      "text": "C $11."
    },
    {
      "id": 431,
      "text": "D nothing."
    },
    {
      "id": 432,
      "text": "Put your answer in the comment section below the video for marking."
    },
    {
      "id": 433,
      "text": "Here's your timer."
    },
    {
      "id": 434,
      "text": "Well done."
    },
    {
      "id": 435,
      "text": "You are making fantastic progress."
    },
    {
      "id": 436,
      "text": "Don't forget very soon."
    },
    {
      "id": 437,
      "text": "I'm going to tell you where you can get more free practice tests to help you pass your Amazon"
    },
    {
      "id": 438,
      "text": "assessment test."
    },
    {
      "id": 439,
      "text": "Question 18."
    },
    {
      "id": 440,
      "text": "A family have $1,500 to spend on a holiday."
    },
    {
      "id": 441,
      "text": "If they spend $350 on flights, $370 on a hotel, and $220 on a higher car,"
    },
    {
      "id": 442,
      "text": "how much spending money will they have left?"
    },
    {
      "id": 443,
      "text": "A $660."
    },
    {
      "id": 444,
      "text": "B $750."
    },
    {
      "id": 445,
      "text": "C $560."
    },
    {
      "id": 446,
      "text": "D $650."
    },
    {
      "id": 447,
      "text": "Please put your answer in the comment section below the video for marking."
    },
    {
      "id": 448,
      "text": "Here's your timer."
    },
    {
      "id": 449,
      "text": "Well done."
    },
    {
      "id": 450,
      "text": "Question number 19."
    },
    {
      "id": 451,
      "text": "Clive."
    },
    {
      "id": 452,
      "text": "There's Clive."
    },
    {
      "id": 453,
      "text": "Travels to work five days a week in his car."
    },
    {
      "id": 454,
      "text": "If he's journey to work is 22 kilometers, how many kilometers will he cover in three weeks?"
    },
    {
      "id": 455,
      "text": "A $310."
    },
    {
      "id": 456,
      "text": "B $101."
    },
    {
      "id": 457,
      "text": "C $770."
    },
    {
      "id": 458,
      "text": "D $330."
    },
    {
      "id": 459,
      "text": "Please put your answer in the comment section below the video for marking."
    },
    {
      "id": 460,
      "text": "Here is your 12 second timer."
    },
    {
      "id": 461,
      "text": "Fantastic."
    },
    {
      "id": 462,
      "text": "Well done."
    },
    {
      "id": 463,
      "text": "Question number 20."
    },
    {
      "id": 464,
      "text": "Mario gets a taxi to work four days a week."
    },
    {
      "id": 465,
      "text": "Each day it costs him $17."
    },
    {
      "id": 466,
      "text": "How much will he have spent on taxes in eight weeks?"
    },
    {
      "id": 467,
      "text": "Is it a?"
    },
    {
      "id": 468,
      "text": "$870."
    },
    {
      "id": 469,
      "text": "B $952."
    },
    {
      "id": 470,
      "text": "C $588."
    },
    {
      "id": 471,
      "text": "Or D $544."
    },
    {
      "id": 472,
      "text": "Please put your answer in the comment section below the video."
    },
    {
      "id": 473,
      "text": "Here is your 12 second timer."
    },
    {
      "id": 474,
      "text": "Well done."
    },
    {
      "id": 475,
      "text": "Tramendous work."
    },
    {
      "id": 476,
      "text": "Now the next thing to do, if you want to accelerate your learning even further and try more,"
    },
    {
      "id": 477,
      "text": "practice Amazon assessment test questions, is click that link right now in the top right-hand"
    },
    {
      "id": 478,
      "text": "corner of the video."
    },
    {
      "id": 479,
      "text": "Head straight through to my website how to become.com and you can instantly get access to more"
    },
    {
      "id": 480,
      "text": "free Amazon assessment test questions."
    },
    {
      "id": 481,
      "text": "This is a brilliant resource."
    },
    {
      "id": 482,
      "text": "It will help improve your scores during the real Amazon assessment test."
    },
    {
      "id": 483,
      "text": "Make sure you check out that link."
    },
    {
      "id": 484,
      "text": "Also don't forget to give the video a thumbs up."
    },
    {
      "id": 485,
      "text": "Hit that like button."
    },
    {
      "id": 486,
      "text": "It really does motivate me to create more great content for you."
    },
    {
      "id": 487,
      "text": "Don't forget to hit the subscribe button."
    },
    {
      "id": 488,
      "text": "I am here to help you pass every job interview and assessment test you ever undertake."
    },
    {
      "id": 489,
      "text": "I can only do those things if you are subscribed."
    },
    {
      "id": 490,
      "text": "Also please consider connecting with me on LinkedIn."
    },
    {
      "id": 491,
      "text": "I have put my LinkedIn link in the description below the video."
    },
    {
      "id": 492,
      "text": "It is always a pleasure and an honour to connect with like-minded professionals such as yourself."
    },
    {
      "id": 493,
      "text": "Thank you for watching and I wish you all the best for passing your Amazon assessment test"
    },
    {
      "id": 494,
      "text": "have a wonderful day."
    }
  ]
}