{
  "file": "R_dxlajqA4s.wav",
  "text": " Thank you for coming in today and I'm happy to help you with your preparing for your interview. Why don't we start by having you tell me a little bit about yourself? So I'm a senior communications major here at Curry. Graduating anticipated graduation is May of 2015. I have very strong points in working with people. I am very involved here at Curry so I'm a part of the student activities office. I'm a student worker there. I'm an orientation leader as well. I have a background in theater. I've spent almost half of my life doing theater. I have vocal talents. I've taken voice lessons for nine years. I don't know what else to say. I don't know what else to talk about. I'm from Franklin Vance. Overall, really good. I think you did a really nice job of showing both parts of your background but also some interests. It really helps to paint a picture of who you are as a person. I think what you need to be careful of and what is a common mistake is to not just reiterate everything that they're looking at on your resume. So once you started to get into that I'm at this type of major and that I did this job and before that I did that job, all you're doing is reading your resume to them and they've already read your resume. That's why they brought you in as a candidate. So you kind of have to think about what your pitch is and what your story is and what is it that I want them to know within the first few minutes of meeting me. And that's really hard. This isn't something that's an easy thing to do but you want to just try to stay away. And you actually did a good job. I would say you weren't. I've had, you know, I, well, I'm from Franklin Mass and I went to such and such high school and then I went to Curry College and then I did this job and you didn't do that which was good. But you want to try to stay away from what I kind of would describe as like the chronology of your background and more as a summary of who you are as a candidate, what you're looking for, where your passion lies as it relates to the position. What is a weakness that you have? A weakness is when things are going, aren't going my way, I tend to like stress myself out to the max and I just don't know where to go from there but then when it all comes down to it I can pick myself back up. So it's a weakness that builds into a string kind of thing. I have a little bit of a formula that I like students to follow when it comes to answering this question because this is a tough one and it's a three-part formula. Pick something that's honest and authentic. So you did that. I didn't get the, oh I'm just, I work too hard, right? That's not very authentic. So you did, you picked an authentic weakness. Step two is to not pick a weakness that's going to throw yourself under the bus. So you don't want to say for instance you're going into PR, I really don't like working with people. Like that's a weakness that's going to be a deal breaker for that kind of industry. Three, you then take it and you talk about how you mitigate that weakness. So that's where the step, the third step I'd want you to take. So I think you hit one and two, but three would be to then say so typically what I do when I feel myself getting really overwhelmed is I stop, I take a breather or I begin to write lists or I figure out a way to organize my day so that if you were to ask my co-workers at Outback they probably have no idea that I'm like this but internally this is something that I go through and so these are the things that I do to make sure that it doesn't affect my work. Can you give me an example of an accomplishment you've had and what that tells us about you? So I think one of my greatest accomplishments is the general focus of me going to college because initially graduating high school I didn't, I wasn't planning on going to college. I was a C student high school, wasn't involved in anything, basically just went to school and left and didn't really do much. And then coming to college I had that mindset of I'm just going to do whatever and then I got involved on campus. I ended up getting deans list both semesters of my freshman year and then both semester sophomore year and then it continued up until my senior year, made deans list almost every semester a couple of semesters I haven't but close enough. I'm extremely involved on campus, I was an orientation leader, I have been involved in Curry Theatre and I'm participating in all of these specific things that go on at Curry which initially had no idea or anticipation of me doing anything that I've done at Curry so far. So I think that right there is a great aspect of my life that I initially had never expected to happen. Great. I think again very good, very good sort of common way to answer an interview question I think taking it up a notch is to complete the question which I kind of fed you which was and what does that tell us about you as a worker and that's usually not how that question is going to be asked. I'll say what can you give me a sense of an accomplishment that you've had but what you want in your brain to do is to translate that for them. So your example of making deans list. So I didn't think I was going to go to college and then I went to school and I made deans list immediately and what that can tell you about me is that once I get myself going I'm really committed that I've got great time management skills. You know it took me a little while to really put a commitment to education but once I did I was committed and that's where I am now and you know to start to think about what those what is it that made you get that accomplishment. So what skills because those are transferable skills those skills that you might that helped you to get deans list or the same type of skills that an employer wants that time management the attention to detail the getting things done getting things done on time. Those are the things that help you to get deans list are also the things that help you be a productive employee. So anytime you have an opportunity to talk about an accomplishment you want to tie immediately back to what attributes about you helps you get that accomplishment because that's going to paint a picture for them of what kind of worker you're going to be. What do you think sets you apart from other candidates? This sort of ties into like my strengths. I'm incredibly well at communicating with people and just being with people in general. I tend to have people gravitate towards me when I go places. I'm respectful. I am able to put forth any effort to help others including myself but others as well. And I'm just very creative as well and I'm always able to bring like a creative aspect into a situation. So again, I would encourage you to think about what sets you apart what makes you truly different and oftentimes look at your combination of experiences because most people won't have the exact same background as you. So if you piece together the different areas that make you different so might be the combination of event planning plus the theater or something that is a real interesting cross section that then brings a certain caliber to the workplace and kind of figure out what that is. And I think the other part of it is anytime you have an opportunity to talk about a story or an example that that could have been another opportunity to to providing an example to support what you're saying when you answer that question. Do you have any questions for us? I don't have any questions. Thank you. We always want to have questions prepared prior to coming into an interview and oftentimes what happens is just through the back and forth of the interview those questions get naturally answered. That said, you do want to have some additional questions or have questions that are most likely not going to get answered unless you ask them. So the best way to do that is through company research. Research that organization, research have they been covered in the news. If you ask a question related to PR agency or interview with a PR agency and you saw it in the news that they just had a new client come on, that's a great opportunity to show that you've been really keeping track of them as an organization. So I noticed that you are now PR agency for XYZ company. Can you tell me a little bit about how that might impact the work of this area that I'm interviewing for? So that's a way to show that you've been engaged and you've been following them and that you're really interested in them as an organization and it also gives you a chance to ask a really good question. I would say overall, very good. I think your interviewing level is above average of a typical college student. I think this feedback is intended to take you to the next level and to be more on a professional, seasoned professional level of interviewing. So it's not an organ exam. I think a lot of times students think it's just answering the questions and there's a right way to answer, wrong way to answer and it's an ABC. It's not that it's really a back and forth conversation and you should be driving the interview as much as them. So it's your opportunity to learn about the position, the organization, when you're on an interview, you're trying to figure out whether this organization is a good match for you as much as they're trying to figure out whether you're a good match for them.",
  "segments": [
    {
      "id": 0,
      "text": "Thank you for coming in today and I'm happy to help you with your preparing for your"
    },
    {
      "id": 1,
      "text": "interview."
    },
    {
      "id": 2,
      "text": "Why don't we start by having you tell me a little bit about yourself?"
    },
    {
      "id": 3,
      "text": "So I'm a senior communications major here at Curry."
    },
    {
      "id": 4,
      "text": "Graduating anticipated graduation is May of 2015."
    },
    {
      "id": 5,
      "text": "I have very strong points in working with people."
    },
    {
      "id": 6,
      "text": "I am very involved here at Curry so I'm a part of the student activities office."
    },
    {
      "id": 7,
      "text": "I'm a student worker there."
    },
    {
      "id": 8,
      "text": "I'm an orientation leader as well."
    },
    {
      "id": 9,
      "text": "I have a background in theater."
    },
    {
      "id": 10,
      "text": "I've spent almost half of my life doing theater."
    },
    {
      "id": 11,
      "text": "I have vocal talents."
    },
    {
      "id": 12,
      "text": "I've taken voice lessons for nine years."
    },
    {
      "id": 13,
      "text": "I don't know what else to say."
    },
    {
      "id": 14,
      "text": "I don't know what else to talk about."
    },
    {
      "id": 15,
      "text": "I'm from Franklin Vance."
    },
    {
      "id": 16,
      "text": "Overall, really good."
    },
    {
      "id": 17,
      "text": "I think you did a really nice job of showing both parts of your background but also some"
    },
    {
      "id": 18,
      "text": "interests."
    },
    {
      "id": 19,
      "text": "It really helps to paint a picture of who you are as a person."
    },
    {
      "id": 20,
      "text": "I think what you need to be careful of and what is a common mistake is to not just reiterate"
    },
    {
      "id": 21,
      "text": "everything that they're looking at on your resume."
    },
    {
      "id": 22,
      "text": "So once you started to get into that I'm at this type of major and that I did this job"
    },
    {
      "id": 23,
      "text": "and before that I did that job, all you're doing is reading your resume to them and they've"
    },
    {
      "id": 24,
      "text": "already read your resume."
    },
    {
      "id": 25,
      "text": "That's why they brought you in as a candidate."
    },
    {
      "id": 26,
      "text": "So you kind of have to think about what your pitch is and what your story is and what is"
    },
    {
      "id": 27,
      "text": "it that I want them to know within the first few minutes of meeting me."
    },
    {
      "id": 28,
      "text": "And that's really hard."
    },
    {
      "id": 29,
      "text": "This isn't something that's an easy thing to do but you want to just try to stay away."
    },
    {
      "id": 30,
      "text": "And you actually did a good job."
    },
    {
      "id": 31,
      "text": "I would say you weren't."
    },
    {
      "id": 32,
      "text": "I've had, you know, I, well, I'm from Franklin Mass and I went to such and such high school"
    },
    {
      "id": 33,
      "text": "and then I went to Curry College and then I did this job and you didn't do that which"
    },
    {
      "id": 34,
      "text": "was good."
    },
    {
      "id": 35,
      "text": "But you want to try to stay away from what I kind of would describe as like the chronology"
    },
    {
      "id": 36,
      "text": "of your background and more as a summary of who you are as a candidate, what you're"
    },
    {
      "id": 37,
      "text": "looking for, where your passion lies as it relates to the position."
    },
    {
      "id": 38,
      "text": "What is a weakness that you have?"
    },
    {
      "id": 39,
      "text": "A weakness is when things are going, aren't going my way, I tend to like stress myself"
    },
    {
      "id": 40,
      "text": "out to the max and I just don't know where to go from there but then when it all comes"
    },
    {
      "id": 41,
      "text": "down to it I can pick myself back up."
    },
    {
      "id": 42,
      "text": "So it's a weakness that builds into a string kind of thing."
    },
    {
      "id": 43,
      "text": "I have a little bit of a formula that I like students to follow when it comes to answering"
    },
    {
      "id": 44,
      "text": "this question because this is a tough one and it's a three-part formula."
    },
    {
      "id": 45,
      "text": "Pick something that's honest and authentic."
    },
    {
      "id": 46,
      "text": "So you did that."
    },
    {
      "id": 47,
      "text": "I didn't get the, oh I'm just, I work too hard, right?"
    },
    {
      "id": 48,
      "text": "That's not very authentic."
    },
    {
      "id": 49,
      "text": "So you did, you picked an authentic weakness."
    },
    {
      "id": 50,
      "text": "Step two is to not pick a weakness that's going to throw yourself under the bus."
    },
    {
      "id": 51,
      "text": "So you don't want to say for instance you're going into PR, I really don't like working"
    },
    {
      "id": 52,
      "text": "with people."
    },
    {
      "id": 53,
      "text": "Like that's a weakness that's going to be a deal breaker for that kind of industry."
    },
    {
      "id": 54,
      "text": "Three, you then take it and you talk about how you mitigate that weakness."
    },
    {
      "id": 55,
      "text": "So that's where the step, the third step I'd want you to take."
    },
    {
      "id": 56,
      "text": "So I think you hit one and two, but three would be to then say so typically what I do"
    },
    {
      "id": 57,
      "text": "when I feel myself getting really overwhelmed is I stop, I take a breather or I begin to write"
    },
    {
      "id": 58,
      "text": "lists or I figure out a way to organize my day so that if you were to ask my co-workers"
    },
    {
      "id": 59,
      "text": "at Outback they probably have no idea that I'm like this but internally this is something"
    },
    {
      "id": 60,
      "text": "that I go through and so these are the things that I do to make sure that it doesn't affect"
    },
    {
      "id": 61,
      "text": "my work."
    },
    {
      "id": 62,
      "text": "Can you give me an example of an accomplishment you've had and what that tells us about"
    },
    {
      "id": 63,
      "text": "you?"
    },
    {
      "id": 64,
      "text": "So I think one of my greatest accomplishments is the general focus of me going to college"
    },
    {
      "id": 65,
      "text": "because initially graduating high school I didn't, I wasn't planning on going to college."
    },
    {
      "id": 66,
      "text": "I was a C student high school, wasn't involved in anything, basically just went to school"
    },
    {
      "id": 67,
      "text": "and left and didn't really do much."
    },
    {
      "id": 68,
      "text": "And then coming to college I had that mindset of I'm just going to do whatever and then"
    },
    {
      "id": 69,
      "text": "I got involved on campus."
    },
    {
      "id": 70,
      "text": "I ended up getting deans list both semesters of my freshman year and then both semester"
    },
    {
      "id": 71,
      "text": "sophomore year and then it continued up until my senior year, made deans list almost every"
    },
    {
      "id": 72,
      "text": "semester a couple of semesters I haven't but close enough."
    },
    {
      "id": 73,
      "text": "I'm extremely involved on campus, I was an orientation leader, I have been involved"
    },
    {
      "id": 74,
      "text": "in Curry Theatre and I'm participating in all of these specific things that go on at"
    },
    {
      "id": 75,
      "text": "Curry which initially had no idea or anticipation of me doing anything that I've done at Curry"
    },
    {
      "id": 76,
      "text": "so far."
    },
    {
      "id": 77,
      "text": "So I think that right there is a great aspect of my life that I initially had never expected"
    },
    {
      "id": 78,
      "text": "to happen."
    },
    {
      "id": 79,
      "text": "Great."
    },
    {
      "id": 80,
      "text": "I think again very good, very good sort of common way to answer an interview question I"
    },
    {
      "id": 81,
      "text": "think taking it up a notch is to complete the question which I kind of fed you which"
    },
    {
      "id": 82,
      "text": "was and what does that tell us about you as a worker and that's usually not how that"
    },
    {
      "id": 83,
      "text": "question is going to be asked."
    },
    {
      "id": 84,
      "text": "I'll say what can you give me a sense of an accomplishment that you've had but what"
    },
    {
      "id": 85,
      "text": "you want in your brain to do is to translate that for them."
    },
    {
      "id": 86,
      "text": "So your example of making deans list."
    },
    {
      "id": 87,
      "text": "So I didn't think I was going to go to college and then I went to school and I made deans"
    },
    {
      "id": 88,
      "text": "list immediately and what that can tell you about me is that once I get myself going"
    },
    {
      "id": 89,
      "text": "I'm really committed that I've got great time management skills."
    },
    {
      "id": 90,
      "text": "You know it took me a little while to really put a commitment to education but once I did"
    },
    {
      "id": 91,
      "text": "I was committed and that's where I am now and you know to start to think about what those"
    },
    {
      "id": 92,
      "text": "what is it that made you get that accomplishment."
    },
    {
      "id": 93,
      "text": "So what skills because those are transferable skills those skills that you might that helped"
    },
    {
      "id": 94,
      "text": "you to get deans list or the same type of skills that an employer wants that time management"
    },
    {
      "id": 95,
      "text": "the attention to detail the getting things done getting things done on time."
    },
    {
      "id": 96,
      "text": "Those are the things that help you to get deans list are also the things that help"
    },
    {
      "id": 97,
      "text": "you be a productive employee."
    },
    {
      "id": 98,
      "text": "So anytime you have an opportunity to talk about an accomplishment you want to tie"
    },
    {
      "id": 99,
      "text": "immediately back to what attributes about you helps you get that accomplishment because"
    },
    {
      "id": 100,
      "text": "that's going to paint a picture for them of what kind of worker you're going to be."
    },
    {
      "id": 101,
      "text": "What do you think sets you apart from other candidates?"
    },
    {
      "id": 102,
      "text": "This sort of ties into like my strengths."
    },
    {
      "id": 103,
      "text": "I'm incredibly well at communicating with people and just being with people in general."
    },
    {
      "id": 104,
      "text": "I tend to have people gravitate towards me when I go places."
    },
    {
      "id": 105,
      "text": "I'm respectful."
    },
    {
      "id": 106,
      "text": "I am able to put forth any effort to help others including myself but others as well."
    },
    {
      "id": 107,
      "text": "And I'm just very creative as well and I'm always able to bring like a creative aspect"
    },
    {
      "id": 108,
      "text": "into a situation."
    },
    {
      "id": 109,
      "text": "So again, I would encourage you to think about what sets you apart what makes you truly"
    },
    {
      "id": 110,
      "text": "different and oftentimes look at your combination of experiences because most people won't"
    },
    {
      "id": 111,
      "text": "have the exact same background as you."
    },
    {
      "id": 112,
      "text": "So if you piece together the different areas that make you different so might be the combination"
    },
    {
      "id": 113,
      "text": "of event planning plus the theater or something that is a real interesting cross section that"
    },
    {
      "id": 114,
      "text": "then brings a certain caliber to the workplace and kind of figure out what that is."
    },
    {
      "id": 115,
      "text": "And I think the other part of it is anytime you have an opportunity to talk about a story"
    },
    {
      "id": 116,
      "text": "or an example that that could have been another opportunity to to providing an example to support"
    },
    {
      "id": 117,
      "text": "what you're saying when you answer that question."
    },
    {
      "id": 118,
      "text": "Do you have any questions for us?"
    },
    {
      "id": 119,
      "text": "I don't have any questions."
    },
    {
      "id": 120,
      "text": "Thank you."
    },
    {
      "id": 121,
      "text": "We always want to have questions prepared prior to coming into an interview and oftentimes"
    },
    {
      "id": 122,
      "text": "what happens is just through the back and forth of the interview those questions get naturally"
    },
    {
      "id": 123,
      "text": "answered."
    },
    {
      "id": 124,
      "text": "That said, you do want to have some additional questions or have questions that are most"
    },
    {
      "id": 125,
      "text": "likely not going to get answered unless you ask them."
    },
    {
      "id": 126,
      "text": "So the best way to do that is through company research."
    },
    {
      "id": 127,
      "text": "Research that organization, research have they been covered in the news."
    },
    {
      "id": 128,
      "text": "If you ask a question related to PR agency or interview with a PR agency and you saw"
    },
    {
      "id": 129,
      "text": "it in the news that they just had a new client come on, that's a great opportunity to show"
    },
    {
      "id": 130,
      "text": "that you've been really keeping track of them as an organization."
    },
    {
      "id": 131,
      "text": "So I noticed that you are now PR agency for XYZ company."
    },
    {
      "id": 132,
      "text": "Can you tell me a little bit about how that might impact the work of this area that I'm"
    },
    {
      "id": 133,
      "text": "interviewing for?"
    },
    {
      "id": 134,
      "text": "So that's a way to show that you've been engaged and you've been following them and that"
    },
    {
      "id": 135,
      "text": "you're really interested in them as an organization and it also gives you a chance to ask a really"
    },
    {
      "id": 136,
      "text": "good question."
    },
    {
      "id": 137,
      "text": "I would say overall, very good."
    },
    {
      "id": 138,
      "text": "I think your interviewing level is above average of a typical college student."
    },
    {
      "id": 139,
      "text": "I think this feedback is intended to take you to the next level and to be more on a professional,"
    },
    {
      "id": 140,
      "text": "seasoned professional level of interviewing."
    },
    {
      "id": 141,
      "text": "So it's not an organ exam."
    },
    {
      "id": 142,
      "text": "I think a lot of times students think it's just answering the questions and there's a"
    },
    {
      "id": 143,
      "text": "right way to answer, wrong way to answer and it's an ABC."
    },
    {
      "id": 144,
      "text": "It's not that it's really a back and forth conversation and you should be driving the"
    },
    {
      "id": 145,
      "text": "interview as much as them."
    },
    {
      "id": 146,
      "text": "So it's your opportunity to learn about the position, the organization, when you're"
    },
    {
      "id": 147,
      "text": "on an interview, you're trying to figure out whether this organization is a good match"
    },
    {
      "id": 148,
      "text": "for you as much as they're trying to figure out whether you're a good match for them."
    }
  ]
}