{
  "file": "RdSvEYDzzk4.wav",
  "text": " Hello there, my name is Richard McMunn from the Interview Training website, passmaintoview.com and in this tutorial I will teach you how to pass an engineer interview. So if you are applying to be an engineer with any organisation, make sure you stay tuned because I promise to help you pass your interview at the very first attempt. And to achieve that goal, this is what I will cover during this tutorial. Number one, I will give you a list of engineer job interview questions that I strongly recommend you prepare for these questions or coming up all the time during engineer interviews. Number two, I will give you important tips for answering each interview question to get the highest scores possible. I will then give you an example answer to each engineer interview question to help you succeed and then finally I will tell you where you can instantly download a copy of these slides and my full set of 20 engineer interview questions and top scoring answers in a PDF guide. And just for a quickly, if you are new to my channel, please make sure you hit that subscribe button. Literally thousands of you are passing your job interviews, I can only help you if you are subscribed. And when you subscribe, I can help you not just pass every job interview but I can also help you to negotiate a salary and also progress throughout your career. And please give the video a like because that just motivates me to create more content for you. Thank you very much indeed. So the first question I recommend you prepare for is tell me about yourself. So this will be the first engineer interview question you will have to answer. In your response, talk about the skills and qualities you can bring to the role and how you have a track record of achievement in your life. Tip number two, I also recommend practicing your answer to this first question until you know it off by heart. Now this is important because you need to create a positive first impression and demonstrate strong communication skills. Now of course, right at the very start of your engineer interview, you will be the most nervous. But if you give a brilliant response to this question, it not only helps you build a connection with the hiring manager, it also boosts your confidence levels too. So here's my example response to help you pass your interview. Tell me about yourself. Here we go. First of all, thank you for giving me the opportunity to be interviewed for this engineer position with your organization today. My name is Richard and after graduating from University with a degree in engineering. I went on to work at several companies where I was required to solve technical problems, work on complex engineering projects and take ideas from the initial engineering design stage through to completion. I am industrial, a decisive problem solver. I operate with creativity and innovation and possess excellent interpersonal and communication skills that are a benefit to the engineering team I am a part of. I have a track record of achievement as an engineer. In my previous role, I was praised for my knowledge of technical and regulatory documents and my ability to communicate complex engineering ideas and solutions in a simple and easy to understand way to non-technical individuals. If you hire me, I will carry out my duties diligently, demonstrate excellent attention to detail skills and support the senior management team in their engineering goals. That is a brilliant answer to that first engineer interview question. Tell me about yourself. Now, you can either pause this video if you want to and write down the answers as we work through them together or if you wait, I will soon tell you where you can instantly download my full set of 20 engineer interview questions and top scoring answers including the ones we are covering today during this tutorial. Here is the next question. Why do you want to be an engineer? Now, this next interview question is assessing your motivations for working as an engineer. The interviewer wants to hear how passionate you are about your career choice and also what drives you to succeed. Tip number two, talk about how you get to work on difficult challenges as an engineer and also make improvements to people's lives. Here's my example answer to help you. Why do you want to be an engineer? I want to be an engineer because it is a job that I'm very passionate about. I am naturally a curious and inquisitive person who enjoys difficult challenges and I enjoy working alongside other technically minded individuals who are working towards a common goal or objective. I also want to be an engineer because I get the opportunity to improve people's lives. I can innovate and I enjoy the elevated trust that comes with the position. Finally, I want to be an engineer because of the increased earning potential. Now, whilst financial gain is not a major motivator for me, I do want to job that enables me to provide a stable life for my family and where I get rewarded fairly for the hard work I undertake. That is another brilliant answer and it will demonstrate passion and motivation for your career choice as an engineer and it also helps you to put across really strong communication skills and you need those as an engineer. Now, don't go anywhere because I still have more questions and answers to give you but when you're ready, you can click that link that has appeared in the top right hand corner of the video, head straight through to my website, past my interview.com and you can instantly download a copy of these slides in the answers in addition to my 20 engineering interview questions and top scoring answers in a PDF guide. But here's an next question for you. Describe a time you demonstrated leadership skills at work. So engineers, as you know, are leaders. A name a step up, take the lead and speak out when things can be improved. Tip number two, give a specific situation where you took the lead or even spoke out to ensure an engineering project was completed to a high standard. So here's my own example answer to assist you. Describe a time you demonstrated leadership skills at work. Here we go. I was in a team meeting with a group of engineers and stakeholders discussing an engineering project we were responsible for. Now several engineers from a different department suggested we could cut corners and save money during the project by using a non-standard production part. I immediately intervened and explained the dangers this idea posed. I explained that we had a contractual obligation to deliver the engineering project as per the initial brief and using the non-standard part would go against the contract. I also explained there were serious safety concerns about the part because he had not undergone rigorous testing and on that basis I would not support the idea. Everyone else in the meeting then agreed we should not explore the idea further. And I was pleased I took the lead and intervened for the project safety. That's a really good answer. It's a clever answer because as you know as engineers you need to be safe. It's a top priority and you are demonstrating that in your answer and you are also demonstrating you have the confidence to take the lead and speak out when something is not right. It's a really good answer and that question comes up all the time during engineer interviews. So here's the next question. What are your strengths and weaknesses? This is a difficult one. Tip number one give several strengths that demonstrate your competence as an engineer. I'm also your ability to add value to their organization. Tip number two, only give one weakness but make sure the weakness is not a match for anything that is listed on the job description. So here's my top scoring answer to help you partial interview. What are your strengths and weaknesses? My strengths include my up-to-date technical and compliance knowledge that's relevant to my area of engineering. I am passionate about research, maintaining competence and learning what is relevant in this industry so my skills are always useful to my employer. Other strengths include my communication skills, my ability to explain technical ideas and concepts to everyone regardless of their level of knowledge and my critical thinking skills which enable me to solve difficult problems and challenges. I am also not afraid to speak up if I think something can be done in an improved or more efficient way. My enthusiasm, drive and positivity have always been welcomed in every engineering team I have been a part of. In terms of my weakness I sometimes find it hard letting go of engineering projects I am working on. I keep checking things before signing them off and whilst this is good for the safety of a project I need to learn to let the project go once complete and then move on to the next one. However I am mindful of my weakness and I am taking steps to improve in this area. So that's a really good answer to that common engineer interview question. What are your strengths and weaknesses? Let's now move on to the next question. By the way I really do hope you are enjoying this tutorial. Don't forget to subscribe and please do give the video a like. Thank you so much. How would you respond if a superior kept asking you to redo your work as an engineer? This isn't another common question that comes up during engineering interviews tip number one. So this question is being asked to assess your temperament? How do you respond are you defensive? Do you refuse to do it? Are you argumentative or are you a team player? So in your answer demonstrate your ability to remain calm, ask relevant questions and do all you can to deliver the engineering work requested. Here's my example answer to help you. How would you respond if a superior kept asking you to redo your work as an engineer? Here we go. I would ask my superior questions to determine the engineering work they wanted from me and exactly how it should be delivered. Now the more questions I ask, the more information it gives me which in turn helps me deliver everything to exacting standards. Now if ever I am asked to redo my work. I am positive, supportive and remember that I am here to carry out my tasks as an engineer based on the organization's goals because I'm a team player. Having to redo my work is not a problem providing what I am being asked to do is safe, compliant and achievable. That's a really good mature answer and it shows that you are a collaborator, your team player who puts the needs of the organization first. Here's an question. Why should we hire you as an engineer? Now this is one of the most common engineer interview questions that needs a confident and positive answer. Don't be afraid to sell yourself. You know, big yourself up, talk about your achievements in your answer. Remember, they will ask this question to all engineers and they will pick the candidate who can give them the most value in the position. So when you're answered, talk about your track record of success, your problem solving capabilities and your ability to adapt to the changing needs of an engineering project. Here we go. Why should we hire you as an engineer? You should hire me because I am a highly skilled and experienced engineer with a strong track record of success. In my current role, I have been entrusted with challenging engineering projects and I have consistently delivered high quality work on time and within budget. My qualifications have given me a solid foundation in the principles and theories of engineering. In addition, I have gained valuable hands-on experience through internships and projects and I'm always looking for ways to continue learning and growing as an engineer. I am a strong problem solver with excellent attention to detail and the ability to work effectively in a team. I am confident that my technical expertise and ability to adapt to changing needs and requirements would make me a valuable asset to your company. I am excited about this role and I hope I get to contribute to the success of your company. That's a great answer. I have a really strong answer that will put you ahead of the competition at your engineer interview. The next thing to do is to make sure you click that link right now in the top right hand corner of the video, head straight through to my website, passmaintoview.com and you can instantly download these slides and an additional 20 engineering interview questions and top scoring answers in a PDF guide. Fantastic resource. Make sure you head through to that website because there are also some additional tips on there that will help you be the standout candidate at your engineer interview. Also, please make sure you subscribe. Literally thousands of you are passing your job interviews as I said at the start of this tutorial. If you have any questions, put them in the comment section below the video. I will be more than happy to answer them. I personally answer all questions myself every day. Don't forget to give the video a like. That does motivate me to create more content. I'm also connected with me on LinkedIn. I've put my LinkedIn link in the description below the video. It's always a pleasure to connect with like minded professionals such as yourself. Thank you so much for watching and I wish you all the best for passing your engineer interview. Have a fantastic day. Thank you guys.",
  "segments": [
    {
      "id": 0,
      "text": "Hello there, my name is Richard McMunn from the Interview Training website,"
    },
    {
      "id": 1,
      "text": "passmaintoview.com and in this tutorial I will teach you how to pass an engineer interview."
    },
    {
      "id": 2,
      "text": "So if you are applying to be an engineer with any organisation, make sure you stay tuned"
    },
    {
      "id": 3,
      "text": "because I promise to help you pass your interview at the very first attempt."
    },
    {
      "id": 4,
      "text": "And to achieve that goal, this is what I will cover during this tutorial."
    },
    {
      "id": 5,
      "text": "Number one, I will give you a list of engineer job interview questions that I strongly"
    },
    {
      "id": 6,
      "text": "recommend you prepare for these questions or coming up all the time during engineer interviews."
    },
    {
      "id": 7,
      "text": "Number two, I will give you important tips for answering each interview question to get the highest"
    },
    {
      "id": 8,
      "text": "scores possible. I will then give you an example answer to each engineer interview question"
    },
    {
      "id": 9,
      "text": "to help you succeed and then finally I will tell you where you can instantly download a copy of"
    },
    {
      "id": 10,
      "text": "these slides and my full set of 20 engineer interview questions and top scoring answers in"
    },
    {
      "id": 11,
      "text": "a PDF guide. And just for a quickly, if you are new to my channel, please make sure you hit"
    },
    {
      "id": 12,
      "text": "that subscribe button. Literally thousands of you are passing your job interviews, I can only"
    },
    {
      "id": 13,
      "text": "help you if you are subscribed. And when you subscribe, I can help you not just pass every job"
    },
    {
      "id": 14,
      "text": "interview but I can also help you to negotiate a salary and also progress throughout your career."
    },
    {
      "id": 15,
      "text": "And please give the video a like because that just motivates me to create more content for you."
    },
    {
      "id": 16,
      "text": "Thank you very much indeed. So the first question I recommend you prepare for is tell me about yourself."
    },
    {
      "id": 17,
      "text": "So this will be the first engineer interview question you will have to answer. In your response,"
    },
    {
      "id": 18,
      "text": "talk about the skills and qualities you can bring to the role and how you have a track record of"
    },
    {
      "id": 19,
      "text": "achievement in your life. Tip number two, I also recommend practicing your answer to this first"
    },
    {
      "id": 20,
      "text": "question until you know it off by heart. Now this is important because you need to create a positive"
    },
    {
      "id": 21,
      "text": "first impression and demonstrate strong communication skills. Now of course, right at the very"
    },
    {
      "id": 22,
      "text": "start of your engineer interview, you will be the most nervous. But if you give a brilliant response to"
    },
    {
      "id": 23,
      "text": "this question, it not only helps you build a connection with the hiring manager, it also boosts"
    },
    {
      "id": 24,
      "text": "your confidence levels too. So here's my example response to help you pass your interview."
    },
    {
      "id": 25,
      "text": "Tell me about yourself. Here we go. First of all, thank you for giving me the opportunity to be"
    },
    {
      "id": 26,
      "text": "interviewed for this engineer position with your organization today. My name is Richard and after"
    },
    {
      "id": 27,
      "text": "graduating from University with a degree in engineering. I went on to work at several companies where"
    },
    {
      "id": 28,
      "text": "I was required to solve technical problems, work on complex engineering projects and take ideas"
    },
    {
      "id": 29,
      "text": "from the initial engineering design stage through to completion. I am industrial, a decisive"
    },
    {
      "id": 30,
      "text": "problem solver. I operate with creativity and innovation and possess excellent interpersonal"
    },
    {
      "id": 31,
      "text": "and communication skills that are a benefit to the engineering team I am a part of. I have a"
    },
    {
      "id": 32,
      "text": "track record of achievement as an engineer. In my previous role, I was praised for my knowledge of"
    },
    {
      "id": 33,
      "text": "technical and regulatory documents and my ability to communicate complex engineering ideas and"
    },
    {
      "id": 34,
      "text": "solutions in a simple and easy to understand way to non-technical individuals. If you hire me,"
    },
    {
      "id": 35,
      "text": "I will carry out my duties diligently, demonstrate excellent attention to detail skills and support"
    },
    {
      "id": 36,
      "text": "the senior management team in their engineering goals. That is a brilliant answer to that first"
    },
    {
      "id": 37,
      "text": "engineer interview question. Tell me about yourself. Now, you can either pause this video if you"
    },
    {
      "id": 38,
      "text": "want to and write down the answers as we work through them together or if you wait, I will soon"
    },
    {
      "id": 39,
      "text": "tell you where you can instantly download my full set of 20 engineer interview questions and"
    },
    {
      "id": 40,
      "text": "top scoring answers including the ones we are covering today during this tutorial. Here is"
    },
    {
      "id": 41,
      "text": "the next question. Why do you want to be an engineer? Now, this next interview question is assessing"
    },
    {
      "id": 42,
      "text": "your motivations for working as an engineer. The interviewer wants to hear how passionate you are"
    },
    {
      "id": 43,
      "text": "about your career choice and also what drives you to succeed. Tip number two, talk about how you"
    },
    {
      "id": 44,
      "text": "get to work on difficult challenges as an engineer and also make improvements to people's lives."
    },
    {
      "id": 45,
      "text": "Here's my example answer to help you. Why do you want to be an engineer? I want to be an engineer"
    },
    {
      "id": 46,
      "text": "because it is a job that I'm very passionate about. I am naturally a curious and inquisitive person"
    },
    {
      "id": 47,
      "text": "who enjoys difficult challenges and I enjoy working alongside other technically minded individuals"
    },
    {
      "id": 48,
      "text": "who are working towards a common goal or objective. I also want to be an engineer because"
    },
    {
      "id": 49,
      "text": "I get the opportunity to improve people's lives. I can innovate and I enjoy the elevated trust"
    },
    {
      "id": 50,
      "text": "that comes with the position. Finally, I want to be an engineer because of the increased earning"
    },
    {
      "id": 51,
      "text": "potential. Now, whilst financial gain is not a major motivator for me, I do want to job that"
    },
    {
      "id": 52,
      "text": "enables me to provide a stable life for my family and where I get rewarded fairly for the hard work"
    },
    {
      "id": 53,
      "text": "I undertake. That is another brilliant answer and it will demonstrate passion and motivation"
    },
    {
      "id": 54,
      "text": "for your career choice as an engineer and it also helps you to put across really strong"
    },
    {
      "id": 55,
      "text": "communication skills and you need those as an engineer. Now, don't go anywhere because I still have"
    },
    {
      "id": 56,
      "text": "more questions and answers to give you but when you're ready, you can click that link that has"
    },
    {
      "id": 57,
      "text": "appeared in the top right hand corner of the video, head straight through to my website,"
    },
    {
      "id": 58,
      "text": "past my interview.com and you can instantly download a copy of these slides in the answers in"
    },
    {
      "id": 59,
      "text": "addition to my 20 engineering interview questions and top scoring answers in a PDF guide."
    },
    {
      "id": 60,
      "text": "But here's an next question for you. Describe a time you demonstrated leadership skills at work."
    },
    {
      "id": 61,
      "text": "So engineers, as you know, are leaders. A name a step up, take the lead and speak out when things"
    },
    {
      "id": 62,
      "text": "can be improved. Tip number two, give a specific situation where you took the lead or even"
    },
    {
      "id": 63,
      "text": "spoke out to ensure an engineering project was completed to a high standard. So here's my own"
    },
    {
      "id": 64,
      "text": "example answer to assist you. Describe a time you demonstrated leadership skills at work. Here we go."
    },
    {
      "id": 65,
      "text": "I was in a team meeting with a group of engineers and stakeholders discussing an engineering"
    },
    {
      "id": 66,
      "text": "project we were responsible for. Now several engineers from a different department suggested we"
    },
    {
      "id": 67,
      "text": "could cut corners and save money during the project by using a non-standard production part."
    },
    {
      "id": 68,
      "text": "I immediately intervened and explained the dangers this idea posed. I explained that we had a"
    },
    {
      "id": 69,
      "text": "contractual obligation to deliver the engineering project as per the initial brief and using the"
    },
    {
      "id": 70,
      "text": "non-standard part would go against the contract. I also explained there were serious safety concerns"
    },
    {
      "id": 71,
      "text": "about the part because he had not undergone rigorous testing and on that basis I would not"
    },
    {
      "id": 72,
      "text": "support the idea. Everyone else in the meeting then agreed we should not explore the idea further."
    },
    {
      "id": 73,
      "text": "And I was pleased I took the lead and intervened for the project safety. That's a really good answer."
    },
    {
      "id": 74,
      "text": "It's a clever answer because as you know as engineers you need to be safe. It's a top priority"
    },
    {
      "id": 75,
      "text": "and you are demonstrating that in your answer and you are also demonstrating you have the confidence"
    },
    {
      "id": 76,
      "text": "to take the lead and speak out when something is not right. It's a really good answer and that"
    },
    {
      "id": 77,
      "text": "question comes up all the time during engineer interviews. So here's the next question. What"
    },
    {
      "id": 78,
      "text": "are your strengths and weaknesses? This is a difficult one. Tip number one give several strengths"
    },
    {
      "id": 79,
      "text": "that demonstrate your competence as an engineer. I'm also your ability to add value to their"
    },
    {
      "id": 80,
      "text": "organization. Tip number two, only give one weakness but make sure the weakness is not a match for"
    },
    {
      "id": 81,
      "text": "anything that is listed on the job description. So here's my top scoring answer to help you"
    },
    {
      "id": 82,
      "text": "partial interview. What are your strengths and weaknesses? My strengths include my up-to-date"
    },
    {
      "id": 83,
      "text": "technical and compliance knowledge that's relevant to my area of engineering. I am passionate"
    },
    {
      "id": 84,
      "text": "about research, maintaining competence and learning what is relevant in this industry so my skills"
    },
    {
      "id": 85,
      "text": "are always useful to my employer. Other strengths include my communication skills, my ability to"
    },
    {
      "id": 86,
      "text": "explain technical ideas and concepts to everyone regardless of their level of knowledge and my"
    },
    {
      "id": 87,
      "text": "critical thinking skills which enable me to solve difficult problems and challenges. I am also"
    },
    {
      "id": 88,
      "text": "not afraid to speak up if I think something can be done in an improved or more efficient way."
    },
    {
      "id": 89,
      "text": "My enthusiasm, drive and positivity have always been welcomed in every engineering team I have"
    },
    {
      "id": 90,
      "text": "been a part of. In terms of my weakness I sometimes find it hard letting go of engineering projects"
    },
    {
      "id": 91,
      "text": "I am working on. I keep checking things before signing them off and whilst this is good for the"
    },
    {
      "id": 92,
      "text": "safety of a project I need to learn to let the project go once complete and then move on to the next one."
    },
    {
      "id": 93,
      "text": "However I am mindful of my weakness and I am taking steps to improve in this area. So that's a"
    },
    {
      "id": 94,
      "text": "really good answer to that common engineer interview question. What are your strengths and weaknesses?"
    },
    {
      "id": 95,
      "text": "Let's now move on to the next question. By the way I really do hope you are enjoying this tutorial."
    },
    {
      "id": 96,
      "text": "Don't forget to subscribe and please do give the video a like. Thank you so much."
    },
    {
      "id": 97,
      "text": "How would you respond if a superior kept asking you to redo your work as an engineer? This isn't"
    },
    {
      "id": 98,
      "text": "another common question that comes up during engineering interviews tip number one. So this question"
    },
    {
      "id": 99,
      "text": "is being asked to assess your temperament? How do you respond are you defensive? Do you refuse to"
    },
    {
      "id": 100,
      "text": "do it? Are you argumentative or are you a team player? So in your answer demonstrate your ability"
    },
    {
      "id": 101,
      "text": "to remain calm, ask relevant questions and do all you can to deliver the engineering work requested."
    },
    {
      "id": 102,
      "text": "Here's my example answer to help you. How would you respond if a superior kept asking you"
    },
    {
      "id": 103,
      "text": "to redo your work as an engineer? Here we go. I would ask my superior questions to determine the"
    },
    {
      "id": 104,
      "text": "engineering work they wanted from me and exactly how it should be delivered. Now the more questions"
    },
    {
      "id": 105,
      "text": "I ask, the more information it gives me which in turn helps me deliver everything to exacting standards."
    },
    {
      "id": 106,
      "text": "Now if ever I am asked to redo my work. I am positive, supportive and remember that I am here to"
    },
    {
      "id": 107,
      "text": "carry out my tasks as an engineer based on the organization's goals because I'm a team player."
    },
    {
      "id": 108,
      "text": "Having to redo my work is not a problem providing what I am being asked to do is safe,"
    },
    {
      "id": 109,
      "text": "compliant and achievable. That's a really good mature answer and it shows that you are a"
    },
    {
      "id": 110,
      "text": "collaborator, your team player who puts the needs of the organization first. Here's an"
    },
    {
      "id": 111,
      "text": "question. Why should we hire you as an engineer? Now this is one of the most common"
    },
    {
      "id": 112,
      "text": "engineer interview questions that needs a confident and positive answer. Don't be afraid to sell"
    },
    {
      "id": 113,
      "text": "yourself. You know, big yourself up, talk about your achievements in your answer. Remember,"
    },
    {
      "id": 114,
      "text": "they will ask this question to all engineers and they will pick the candidate who can give them"
    },
    {
      "id": 115,
      "text": "the most value in the position. So when you're answered, talk about your track record of success,"
    },
    {
      "id": 116,
      "text": "your problem solving capabilities and your ability to adapt to the changing needs of an"
    },
    {
      "id": 117,
      "text": "engineering project. Here we go. Why should we hire you as an engineer? You should hire me because I am"
    },
    {
      "id": 118,
      "text": "a highly skilled and experienced engineer with a strong track record of success. In my current role,"
    },
    {
      "id": 119,
      "text": "I have been entrusted with challenging engineering projects and I have consistently delivered"
    },
    {
      "id": 120,
      "text": "high quality work on time and within budget. My qualifications have given me a solid foundation"
    },
    {
      "id": 121,
      "text": "in the principles and theories of engineering. In addition, I have gained valuable hands-on"
    },
    {
      "id": 122,
      "text": "experience through internships and projects and I'm always looking for ways to continue learning"
    },
    {
      "id": 123,
      "text": "and growing as an engineer. I am a strong problem solver with excellent attention to detail"
    },
    {
      "id": 124,
      "text": "and the ability to work effectively in a team. I am confident that my technical expertise and"
    },
    {
      "id": 125,
      "text": "ability to adapt to changing needs and requirements would make me a valuable asset to your company."
    },
    {
      "id": 126,
      "text": "I am excited about this role and I hope I get to contribute to the success of your company. That's"
    },
    {
      "id": 127,
      "text": "a great answer. I have a really strong answer that will put you ahead of the competition at your"
    },
    {
      "id": 128,
      "text": "engineer interview. The next thing to do is to make sure you click that link right now in the top"
    },
    {
      "id": 129,
      "text": "right hand corner of the video, head straight through to my website, passmaintoview.com and you can"
    },
    {
      "id": 130,
      "text": "instantly download these slides and an additional 20 engineering interview questions and top scoring"
    },
    {
      "id": 131,
      "text": "answers in a PDF guide. Fantastic resource. Make sure you head through to that website"
    },
    {
      "id": 132,
      "text": "because there are also some additional tips on there that will help you be the standout"
    },
    {
      "id": 133,
      "text": "candidate at your engineer interview. Also, please make sure you subscribe. Literally thousands of"
    },
    {
      "id": 134,
      "text": "you are passing your job interviews as I said at the start of this tutorial. If you have any"
    },
    {
      "id": 135,
      "text": "questions, put them in the comment section below the video. I will be more than happy to answer"
    },
    {
      "id": 136,
      "text": "them. I personally answer all questions myself every day. Don't forget to give the video a like."
    },
    {
      "id": 137,
      "text": "That does motivate me to create more content. I'm also connected with me on LinkedIn. I've put my"
    },
    {
      "id": 138,
      "text": "LinkedIn link in the description below the video. It's always a pleasure to connect with like"
    },
    {
      "id": 139,
      "text": "minded professionals such as yourself. Thank you so much for watching and I wish you all the best"
    },
    {
      "id": 140,
      "text": "for passing your engineer interview. Have a fantastic day. Thank you guys."
    }
  ]
}