{
  "file": "S0Z1lq-wElU.wav",
  "text": " Hi there, my name is Richard McMunn from the interview training website, passmaintoview.com and in this tutorial I'm going to give you 7 Amazon interview tips. So if you have a job interview coming up with Amazon for any role whatsoever, make sure you stay tuned because I will help you to be the standout candidate. And just very quickly if you are new to the channel, make sure you hit that subscribe button because I can then keep you updated with the latest Amazon interview tips and techniques. Make sure you give the video I like because that tells me you far these tutorials useful and also make sure you tell me in the comments section below the video. The name of the job you are applying for at Amazon and I can then give you some more interview questions to prepare for. Let's jump straight into the presentation. Amazon interview tip number one is to make sure you learn the 16 Amazon leadership principles they are crucial to your success. So I genuinely believe that Amazon is one of the greatest companies in the world and I believe that because of the people they hire. They hire talented individuals. Now their employees are forward thinking they are positive, they are adaptable to change and they are progressive in their approach to providing outstanding customer service. Now to ensure their staff have the skills needed to perform to optimum levels, Amazon has a set of 16 leadership principles. So the 16 Amazon leadership principles underpin everything Amazon does in terms of the work they carry out their business planning, whether they are discussing new products and service ideas and also more importantly how they treat their customers. So the 16 leadership principles are customer obsession, ownership, invent and simplify our rights a lot, learn and be curious, hire and develop the best people, insist on the highest standards, think big, bias for action, forality, earn trust, dive deep, have backbone, disagree and commit. Deliver results, strive to be the best employer and also success and scale bring broad responsibility. So I strongly advise you read and learn the 16 Amazon leadership principles before you attend your interview. If you don't, I think you'll find it very hard to pass your interview. Now one of Amazon's leadership principles is that of strive to be the Earth's best employer. So Amazon is likely to ask you interview questions based on some of the leadership principles. So strive to be the Earth's best employer means, among other things, making sure that you do all you can at work to create a safer, more diverse and more productive working environment. So an example, interview question based on the leadership principle of strive to be the Earth's best employer could be, tell me about a time when you helped to improve safety at work. So if you are able to answer this question and I was correctly, you are part of why they're to having the necessary skills, the qualities and the experience needed to be an exceptional Amazon employee. Let me give you an example answer to that Amazon leadership principles interview question. So the interview question again is, tell me about a time when you helped to improve safety at work. Here's my example response. A situation occurred recently at work where by I noticed a colleague of mine carrying an extremely heavy item of equipment without using the correct manual handling techniques. I was genuinely concerned for their safety as an injury could put them out of action for many months and it would also cost the company money due to being sure staff. I saw it as my task to speak to my work colleague about this safety issue and to also make sure everyone in the team was aware of the correct manual handling safety procedures to follow. So I spoke to my work colleague in private to explain the danger they were putting themselves in and to ask whether or not they had received the correct training when they joined the company. Now they informed me they had received the training but they had since forgotten what it entailed. So I decided to speak to my supervisor to ask if we could all have some refresher training to remind us of the correct manual handling techniques to use as this would help prevent injuries moving Now the end result was that my supervisor agreed it was a great idea and we've been seven days we had all received an hour long training session which was going to be repeated every six months. So you will see there that I have provided a specific example of a situation I was in where I previously demonstrated the leadership principle strive to be the best employer. So very soon I will give you another example answer to a different Amazon leadership principle but first of all let me give you Amazon interview tip number two. Amazon interview tip number two is to make sure you use the start technique when answering the leadership principle interview questions. So you will have noticed in the previous answer that I just gave you I used what is called the start technique to structure your response. It's a brilliant format to use during your Amazon interview. It's important because it enables you to provide specific evidence of where you are matching the leadership principle. So the start technique stands for situation task action and result. You start off your response to the interview question by explaining the situation you were faced with. You then move on and tell the interviewer the task that need you doing and you will then go into detail and explain the action that you took. This is where it's important that you tell the interview exactly what you did and the reasons why you did it and you then finish off with the results following your actions and it's really important to make sure the results are positive. So Amazon interview tip number two is to always make sure you use the start technique situation task action result when responding to the Amazon leadership principles interview questions. Amazon interview tip number three is to be prepared for probing questions. What's probing question? Well all Amazon hiring managers are very, very good at their jobs. They are trained to ask the right questions and to delve a bit deeper into your responses to ask to take your intentions and the skills and qualities you have that will enable you to be a high performing Amazon employee. So probing questions will always come after you have given a response to an interview question. Examples of probing questions include why did you approach things that way? Would you do anything different next time and also what did you learn from the situation? So to explain how I would answer probing questions I will give you another example response to an Amazon leadership principles interview question. So the next sample interview question is based on the leadership principle success and scale bring broad responsibility and the question is tell me about a time when you were faced with a moral dilemma at work. Let's take a look at my answer. A situation occurred whereby I was in a team meeting discussing a client project. All the other team members wanted to cut corners during the project delivery phase to save money but I disagreed with this approach. I felt it was my task to challenge my coworkers and to explain that whilst the client would not be aware that we had cut corners morally it was wrong. I immediately spoke and explained in a professional manner that I was not comfortable with this approach as the client had put their trust in us to deliver things to a very high standard. If we wanted to save money then we should discuss this with the client in an open and transparent manner. Now although my coworkers disagree with my viewpoint they all agreed not to cut corners and to stick with the initial project action plan to ensure everything was done to a high standard. So that's a really good response to that Amazon leadership principles interview questions but what about the probing questions? Let's take a look at them. So once I've given my answer to that interview question the Amazon hiring manager may ask me several probing questions an example probing question to that response might be in hindsight should you have not gone with the overall team majority to save the company money and I would respond by saying no I would do exactly the same thing again if this situation arose because the reputation of the companies on the line and I believe trust is vital when delivering projects for customers and clients. Another example of a probing question to that interview response could be should you have not informed the company owner in this instance to make them aware that the other team members were prepared to cut corners and potentially jeopardise the business's reputation and I would say to that probing question yes thinking back that's exactly what I should have done and it was a mistake not to although I made my views clear to the team at the time I should have made the company owner aware so he could ensure the same situation never happened again it's really important to admit if you've done something wrong when responding to the Amazon interview questions. Amazon interview tip number four is really important if you want to pass your Amazon interview and that is to make sure you have more than one example on the ready for each of the 16 leadership principles because by doing so you will be showing the hiring manager you have a diverse set of skills, a broad depth of knowledge and also more importantly transferable experiences that are a match for the job description. Now of course creating several responses to all 16 leadership principles is a difficult task so to help you I have created a brilliant Amazon interview questions and answers PDF guide that I think you're going to want to get access to. Now when you're ready click that link in the top right and corner of the video you can head through to my website pastmaintevute.com and you can download lots of sample responses to all 16 Amazon leadership principles. Amazon interview tip number five is to make sure you give a unique standout answer to the interview question why Amazon why do you want to work for Amazon so during your Amazon interview the hiring manager is going to ask you that question why do you want to work for Amazon so here's what I would say in response to this interview question I want to work for Amazon for several reasons because you are a forward thinking organization that strives to continually improve and grow this is a place where I feel I will be constantly pushed and challenged where I will get to work alongside other like minded professionals and where I will be able to work at the cutting edge of technology and customer focused advancements. I also want to work for Amazon because having studied the 16 leadership principles they certainly resonate with me from a personal and professional perspective. Finally I want to work for Amazon because I will feel a great sense of pride working for a company that is socially responsible the ones to always improve and that wants to be the best it can possibly be that's a brilliant answer to that tough Amazon interview question why Amazon Amazon interview tip number six is to make sure you have specific examples ready of where you have taken risks at work where you have succeeded and also where you have failed so taking risks Amazon has been so successful because it takes calculated risks that are in the best interests of its customers and its business overall so my advice before you go along to your interview is to think of a previous situation you've worked in where you took a risk that paid off. What about being successful? Well, my advice is to think of more than one occasion where you succeeded at work maybe you won an important sales contract for your employer maybe you succeeded by helping your employer save money maybe you've previously come up with a new conventional product idea for your company or maybe you worked as part of a team on a very important company project that succeeded against the odds and finally what about failure? Don't be afraid to show in your Amazon interview that you have made mistakes and failed in the past. Remember we all fail but it is what we learn from that process and what we do next that is most important. My advice is to think of a situation you've previously been in where you did make a mistake and you failed but you learned from it and there was a positive outcome. Amazon interview tip number seven is to make sure you are customer obsessed throughout the interview. Now remember Amazon has been so successful because it is one of the very few businesses in the world that has focused entirely on the customer they always provide brilliant customer service. Now I can almost guarantee that you will have to answer several interview questions based on your ability to put the customer first in everything you do at work. So for more example answers based on the Amazon leadership principle customer obsession make sure you click the link at the top of this video right now it will take you through to another important video right here on YouTube where I give you some brilliant example responses to tough Amazon interview questions. So I hope you've enjoyed that don't forget to click the link in the top right hand corner of the video if you want to download lots of example responses to Amazon interview questions don't forget to hit the subscribe button lots of you are passing your joint interviews I can only help you if you are subscribed please also make sure you give the video a like because that motivates me to create more videos for you and you can also connect with me on LinkedIn. I've put my LinkedIn link in the description below the video so it's great to connect with like-minded professionals such as yourself thank you so much for watching and I wish you all the best for passing your Amazon interview have a brilliant day.",
  "segments": [
    {
      "id": 0,
      "text": "Hi there, my name is Richard McMunn from the interview training website, passmaintoview.com"
    },
    {
      "id": 1,
      "text": "and in this tutorial I'm going to give you 7 Amazon interview tips. So if you have a"
    },
    {
      "id": 2,
      "text": "job interview coming up with Amazon for any role whatsoever, make sure you stay tuned because I"
    },
    {
      "id": 3,
      "text": "will help you to be the standout candidate. And just very quickly if you are new to the channel,"
    },
    {
      "id": 4,
      "text": "make sure you hit that subscribe button because I can then keep you updated with the latest"
    },
    {
      "id": 5,
      "text": "Amazon interview tips and techniques. Make sure you give the video I like because that tells me"
    },
    {
      "id": 6,
      "text": "you far these tutorials useful and also make sure you tell me in the comments section below the video."
    },
    {
      "id": 7,
      "text": "The name of the job you are applying for at Amazon and I can then give you some more interview"
    },
    {
      "id": 8,
      "text": "questions to prepare for. Let's jump straight into the presentation. Amazon interview tip number one"
    },
    {
      "id": 9,
      "text": "is to make sure you learn the 16 Amazon leadership principles they are crucial to your success."
    },
    {
      "id": 10,
      "text": "So I genuinely believe that Amazon is one of the greatest companies in the world and I believe"
    },
    {
      "id": 11,
      "text": "that because of the people they hire. They hire talented individuals. Now their employees are"
    },
    {
      "id": 12,
      "text": "forward thinking they are positive, they are adaptable to change and they are progressive in their"
    },
    {
      "id": 13,
      "text": "approach to providing outstanding customer service. Now to ensure their staff have the skills needed"
    },
    {
      "id": 14,
      "text": "to perform to optimum levels, Amazon has a set of 16 leadership principles. So the 16"
    },
    {
      "id": 15,
      "text": "Amazon leadership principles underpin everything Amazon does in terms of the work they carry out"
    },
    {
      "id": 16,
      "text": "their business planning, whether they are discussing new products and service ideas and also more"
    },
    {
      "id": 17,
      "text": "importantly how they treat their customers. So the 16 leadership principles are customer"
    },
    {
      "id": 18,
      "text": "obsession, ownership, invent and simplify our rights a lot, learn and be curious,"
    },
    {
      "id": 19,
      "text": "hire and develop the best people, insist on the highest standards, think big, bias for action,"
    },
    {
      "id": 20,
      "text": "forality, earn trust, dive deep, have backbone, disagree and commit. Deliver results,"
    },
    {
      "id": 21,
      "text": "strive to be the best employer and also success and scale bring broad responsibility."
    },
    {
      "id": 22,
      "text": "So I strongly advise you read and learn the 16 Amazon leadership principles before you attend"
    },
    {
      "id": 23,
      "text": "your interview. If you don't, I think you'll find it very hard to pass your interview."
    },
    {
      "id": 24,
      "text": "Now one of Amazon's leadership principles is that of strive to be the Earth's best employer."
    },
    {
      "id": 25,
      "text": "So Amazon is likely to ask you interview questions based on some of the leadership principles."
    },
    {
      "id": 26,
      "text": "So strive to be the Earth's best employer means, among other things, making sure that you do all"
    },
    {
      "id": 27,
      "text": "you can at work to create a safer, more diverse and more productive working environment."
    },
    {
      "id": 28,
      "text": "So an example, interview question based on the leadership principle of strive to be the"
    },
    {
      "id": 29,
      "text": "Earth's best employer could be, tell me about a time when you helped to improve safety at work."
    },
    {
      "id": 30,
      "text": "So if you are able to answer this question and I was correctly, you are part of why they're"
    },
    {
      "id": 31,
      "text": "to having the necessary skills, the qualities and the experience needed to be an exceptional"
    },
    {
      "id": 32,
      "text": "Amazon employee. Let me give you an example answer to that Amazon leadership principles interview"
    },
    {
      "id": 33,
      "text": "question. So the interview question again is, tell me about a time when you helped to improve"
    },
    {
      "id": 34,
      "text": "safety at work. Here's my example response. A situation occurred recently at work where by"
    },
    {
      "id": 35,
      "text": "I noticed a colleague of mine carrying an extremely heavy item of equipment without using the"
    },
    {
      "id": 36,
      "text": "correct manual handling techniques. I was genuinely concerned for their safety as an injury could"
    },
    {
      "id": 37,
      "text": "put them out of action for many months and it would also cost the company money due to being sure"
    },
    {
      "id": 38,
      "text": "staff. I saw it as my task to speak to my work colleague about this safety issue and to also make"
    },
    {
      "id": 39,
      "text": "sure everyone in the team was aware of the correct manual handling safety procedures to follow."
    },
    {
      "id": 40,
      "text": "So I spoke to my work colleague in private to explain the danger they were putting themselves in"
    },
    {
      "id": 41,
      "text": "and to ask whether or not they had received the correct training when they joined the company."
    },
    {
      "id": 42,
      "text": "Now they informed me they had received the training but they had since forgotten what it entailed."
    },
    {
      "id": 43,
      "text": "So I decided to speak to my supervisor to ask if we could all have some refresher training"
    },
    {
      "id": 44,
      "text": "to remind us of the correct manual handling techniques to use as this would help prevent injuries moving"
    },
    {
      "id": 45,
      "text": "Now the end result was that my supervisor agreed it was a great idea and we've been seven days"
    },
    {
      "id": 46,
      "text": "we had all received an hour long training session which was going to be repeated every six months."
    },
    {
      "id": 47,
      "text": "So you will see there that I have provided a specific example of a situation I was in where I"
    },
    {
      "id": 48,
      "text": "previously demonstrated the leadership principle strive to be the best employer. So very soon I will"
    },
    {
      "id": 49,
      "text": "give you another example answer to a different Amazon leadership principle but first of all let me"
    },
    {
      "id": 50,
      "text": "give you Amazon interview tip number two. Amazon interview tip number two is to make sure you use the"
    },
    {
      "id": 51,
      "text": "start technique when answering the leadership principle interview questions. So you will have noticed"
    },
    {
      "id": 52,
      "text": "in the previous answer that I just gave you I used what is called the start technique to structure"
    },
    {
      "id": 53,
      "text": "your response. It's a brilliant format to use during your Amazon interview. It's important"
    },
    {
      "id": 54,
      "text": "because it enables you to provide specific evidence of where you are matching the leadership principle."
    },
    {
      "id": 55,
      "text": "So the start technique stands for situation task action and result. You start off your response to"
    },
    {
      "id": 56,
      "text": "the interview question by explaining the situation you were faced with. You then move on and tell the"
    },
    {
      "id": 57,
      "text": "interviewer the task that need you doing and you will then go into detail and explain the action"
    },
    {
      "id": 58,
      "text": "that you took. This is where it's important that you tell the interview exactly what you did and"
    },
    {
      "id": 59,
      "text": "the reasons why you did it and you then finish off with the results following your actions and it's"
    },
    {
      "id": 60,
      "text": "really important to make sure the results are positive. So Amazon interview tip number two is to always"
    },
    {
      "id": 61,
      "text": "make sure you use the start technique situation task action result when responding to the Amazon"
    },
    {
      "id": 62,
      "text": "leadership principles interview questions. Amazon interview tip number three is to be prepared for"
    },
    {
      "id": 63,
      "text": "probing questions. What's probing question? Well all Amazon hiring managers are very, very good at"
    },
    {
      "id": 64,
      "text": "their jobs. They are trained to ask the right questions and to delve a bit deeper into your responses"
    },
    {
      "id": 65,
      "text": "to ask to take your intentions and the skills and qualities you have that will enable you to be a"
    },
    {
      "id": 66,
      "text": "high performing Amazon employee. So probing questions will always come after you have given a response"
    },
    {
      "id": 67,
      "text": "to an interview question. Examples of probing questions include why did you approach things that way?"
    },
    {
      "id": 68,
      "text": "Would you do anything different next time and also what did you learn from the situation? So to"
    },
    {
      "id": 69,
      "text": "explain how I would answer probing questions I will give you another example response to an Amazon"
    },
    {
      "id": 70,
      "text": "leadership principles interview question. So the next sample interview question is based on the"
    },
    {
      "id": 71,
      "text": "leadership principle success and scale bring broad responsibility and the question is tell me about"
    },
    {
      "id": 72,
      "text": "a time when you were faced with a moral dilemma at work. Let's take a look at my answer."
    },
    {
      "id": 73,
      "text": "A situation occurred whereby I was in a team meeting discussing a client project. All the other"
    },
    {
      "id": 74,
      "text": "team members wanted to cut corners during the project delivery phase to save money but I disagreed"
    },
    {
      "id": 75,
      "text": "with this approach. I felt it was my task to challenge my coworkers and to explain that whilst"
    },
    {
      "id": 76,
      "text": "the client would not be aware that we had cut corners morally it was wrong. I immediately spoke"
    },
    {
      "id": 77,
      "text": "and explained in a professional manner that I was not comfortable with this approach as the"
    },
    {
      "id": 78,
      "text": "client had put their trust in us to deliver things to a very high standard. If we wanted to save money"
    },
    {
      "id": 79,
      "text": "then we should discuss this with the client in an open and transparent manner. Now although my"
    },
    {
      "id": 80,
      "text": "coworkers disagree with my viewpoint they all agreed not to cut corners and to stick with the"
    },
    {
      "id": 81,
      "text": "initial project action plan to ensure everything was done to a high standard. So that's a really"
    },
    {
      "id": 82,
      "text": "good response to that Amazon leadership principles interview questions but what about the"
    },
    {
      "id": 83,
      "text": "probing questions? Let's take a look at them. So once I've given my answer to that interview question"
    },
    {
      "id": 84,
      "text": "the Amazon hiring manager may ask me several probing questions an example probing question"
    },
    {
      "id": 85,
      "text": "to that response might be in hindsight should you have not gone with the overall team majority"
    },
    {
      "id": 86,
      "text": "to save the company money and I would respond by saying no I would do exactly the same thing again"
    },
    {
      "id": 87,
      "text": "if this situation arose because the reputation of the companies on the line and I believe trust"
    },
    {
      "id": 88,
      "text": "is vital when delivering projects for customers and clients. Another example of a probing"
    },
    {
      "id": 89,
      "text": "question to that interview response could be should you have not informed the company owner"
    },
    {
      "id": 90,
      "text": "in this instance to make them aware that the other team members were prepared to cut corners"
    },
    {
      "id": 91,
      "text": "and potentially jeopardise the business's reputation and I would say to that probing question yes"
    },
    {
      "id": 92,
      "text": "thinking back that's exactly what I should have done and it was a mistake not to although I made"
    },
    {
      "id": 93,
      "text": "my views clear to the team at the time I should have made the company owner aware so he could"
    },
    {
      "id": 94,
      "text": "ensure the same situation never happened again it's really important to admit if you've done"
    },
    {
      "id": 95,
      "text": "something wrong when responding to the Amazon interview questions. Amazon interview tip number four"
    },
    {
      "id": 96,
      "text": "is really important if you want to pass your Amazon interview and that is to make sure you have more"
    },
    {
      "id": 97,
      "text": "than one example on the ready for each of the 16 leadership principles because by doing so you will"
    },
    {
      "id": 98,
      "text": "be showing the hiring manager you have a diverse set of skills, a broad depth of knowledge and also"
    },
    {
      "id": 99,
      "text": "more importantly transferable experiences that are a match for the job description. Now of course"
    },
    {
      "id": 100,
      "text": "creating several responses to all 16 leadership principles is a difficult task so to help you I have"
    },
    {
      "id": 101,
      "text": "created a brilliant Amazon interview questions and answers PDF guide that I think you're going to"
    },
    {
      "id": 102,
      "text": "want to get access to. Now when you're ready click that link in the top right and corner of the video"
    },
    {
      "id": 103,
      "text": "you can head through to my website pastmaintevute.com and you can download lots of sample responses"
    },
    {
      "id": 104,
      "text": "to all 16 Amazon leadership principles. Amazon interview tip number five is to make sure you give a"
    },
    {
      "id": 105,
      "text": "unique standout answer to the interview question why Amazon why do you want to work for Amazon so"
    },
    {
      "id": 106,
      "text": "during your Amazon interview the hiring manager is going to ask you that question why do you want"
    },
    {
      "id": 107,
      "text": "to work for Amazon so here's what I would say in response to this interview question I want to work"
    },
    {
      "id": 108,
      "text": "for Amazon for several reasons because you are a forward thinking organization that strives to continually"
    },
    {
      "id": 109,
      "text": "improve and grow this is a place where I feel I will be constantly pushed and challenged where"
    },
    {
      "id": 110,
      "text": "I will get to work alongside other like minded professionals and where I will be able to work at the"
    },
    {
      "id": 111,
      "text": "cutting edge of technology and customer focused advancements. I also want to work for Amazon"
    },
    {
      "id": 112,
      "text": "because having studied the 16 leadership principles they certainly resonate with me from a"
    },
    {
      "id": 113,
      "text": "personal and professional perspective. Finally I want to work for Amazon because I will feel a"
    },
    {
      "id": 114,
      "text": "great sense of pride working for a company that is socially responsible the ones to always improve"
    },
    {
      "id": 115,
      "text": "and that wants to be the best it can possibly be that's a brilliant answer to that tough Amazon"
    },
    {
      "id": 116,
      "text": "interview question why Amazon Amazon interview tip number six is to make sure you have specific"
    },
    {
      "id": 117,
      "text": "examples ready of where you have taken risks at work where you have succeeded and also where you"
    },
    {
      "id": 118,
      "text": "have failed so taking risks Amazon has been so successful because it takes calculated risks that are"
    },
    {
      "id": 119,
      "text": "in the best interests of its customers and its business overall so my advice before you go along"
    },
    {
      "id": 120,
      "text": "to your interview is to think of a previous situation you've worked in where you took a risk"
    },
    {
      "id": 121,
      "text": "that paid off. What about being successful? Well, my advice is to think of more than one occasion"
    },
    {
      "id": 122,
      "text": "where you succeeded at work maybe you won an important sales contract for your employer maybe you"
    },
    {
      "id": 123,
      "text": "succeeded by helping your employer save money maybe you've previously come up with a new"
    },
    {
      "id": 124,
      "text": "conventional product idea for your company or maybe you worked as part of a team on a very"
    },
    {
      "id": 125,
      "text": "important company project that succeeded against the odds and finally what about failure? Don't"
    },
    {
      "id": 126,
      "text": "be afraid to show in your Amazon interview that you have made mistakes and failed in the past."
    },
    {
      "id": 127,
      "text": "Remember we all fail but it is what we learn from that process and what we do next that is most"
    },
    {
      "id": 128,
      "text": "important. My advice is to think of a situation you've previously been in where you did make a"
    },
    {
      "id": 129,
      "text": "mistake and you failed but you learned from it and there was a positive outcome. Amazon interview"
    },
    {
      "id": 130,
      "text": "tip number seven is to make sure you are customer obsessed throughout the interview. Now remember"
    },
    {
      "id": 131,
      "text": "Amazon has been so successful because it is one of the very few businesses in the world that has"
    },
    {
      "id": 132,
      "text": "focused entirely on the customer they always provide brilliant customer service. Now I can almost guarantee"
    },
    {
      "id": 133,
      "text": "that you will have to answer several interview questions based on your ability to put the"
    },
    {
      "id": 134,
      "text": "customer first in everything you do at work. So for more example answers based on the Amazon"
    },
    {
      "id": 135,
      "text": "leadership principle customer obsession make sure you click the link at the top of this video right"
    },
    {
      "id": 136,
      "text": "now it will take you through to another important video right here on YouTube where I give you"
    },
    {
      "id": 137,
      "text": "some brilliant example responses to tough Amazon interview questions. So I hope you've enjoyed that"
    },
    {
      "id": 138,
      "text": "don't forget to click the link in the top right hand corner of the video if you want to download"
    },
    {
      "id": 139,
      "text": "lots of example responses to Amazon interview questions don't forget to hit the subscribe button"
    },
    {
      "id": 140,
      "text": "lots of you are passing your joint interviews I can only help you if you are subscribed please also"
    },
    {
      "id": 141,
      "text": "make sure you give the video a like because that motivates me to create more videos for you and you"
    },
    {
      "id": 142,
      "text": "can also connect with me on LinkedIn. I've put my LinkedIn link in the description below the video"
    },
    {
      "id": 143,
      "text": "so it's great to connect with like-minded professionals such as yourself thank you so much for"
    },
    {
      "id": 144,
      "text": "watching and I wish you all the best for passing your Amazon interview have a brilliant day."
    }
  ]
}