{
  "file": "tMh0vrQcbmI.wav",
  "text": " Hello, there my name is Richard McMunn from the Interview Training website, passmindofu.com and in this tutorial, I will teach you how to answer behavioral interview questions. So if you have a job interview coming up soon for any role or company, please make sure you stay tuned, because I promise to help you be the standout candidates. And to achieve that goal, this is what I will cover during this tutorial. I will tell you the seven most common behavioral interview questions for all job interviews. These questions come up all the time. It is important you have a top scoring answer prepared for all of these questions. Number two, I will tell you the best structure to use when answering any type of behavioral interview question. This structure is not only easy to remember, but it will guarantee you get the highest scores possible. Number three, I will then give you a brilliant top scoring example answer to all seven common behavioral interview questions. And then finally number four, I will tell you where you can instantly download these slides. And also my full set of 27 behavioral interview questions and top scoring answers in a PDF guide. And just very quickly, if you are new to this channel, please make sure you hit that subscribe button. Literally thousands of you are passing your job interviews. I can only help you if you are subscribed. And please give the video a like. That really does motivate me to create more content for you. And it tells me that you find these tutorials useful. Thank you very much for your support. Okay, so why are you being asked behavioral interview questions? Well, behavioral interview questions often start with, tell me about a time when you delivered excellent customer service. Tell me about a time when you worked under pressure. Tell me about a time when you worked in a team. So you are being asked these questions too assess your suitability for the role you have applied for. Now, if you can give the interviewer previous examples of where you have demonstrated key workplace skills, you are far more likely to get hired. And that is the purpose of this tutorial. To give you example previous situations that you might have been in where you demonstrate the key workplace skills. That's very important if you are going to pass your interview. So let me tell you how to structure your answers to behavioral interview questions. This is really easy to remember. So this structure is called the star technique. Star stands for situation task action result. So if the interviewer asks you any type of behavioral interview question, you will use a star technique to structure your answer. Let's assume the question is tell me about a time when you worked in a team. So you would start off your answer and you would tell the interviewer the situation you were in. You would then move on and briefly outline the task that needed doing. You then move on and give in depth details about the action you took to complete the task before finishing off and telling the interviewer the result following your actions. So always use a star technique when responding to behavioral interview questions. Okay, so let me now give you seven brilliant answers to the most common behavioral interview questions. Here we go. So the first question is tell me about a time when you worked in a team. Let me give you my example answer that uses that star technique of situation task action and result. Here we go. Tell me about a time when you worked in a team. I was working in a previous role when two team members went off sick at short notice. It was our task as the remaining team members to take on the additional duties of our sick co-workers to deliver the company's objectives and goals on time. We got together assessed the duties of our sick co-workers and allocated tasks based on our strengths. We agreed to support each other and if anyone was struggling with their additional duties, we would step into help. Now at one point a co-worker was unsure how to complete one of their tasks. So I finished my own work and went over to help. By working together and supporting each other as a team, we were able to get all tasks and duties finished on time despite being two team members short. So that's a really good example answer. The use is a star technique that demonstrates when you have previously worked in a team. Let me now give you the second behavioral interview question and top scoring example answer. So that question is tell me about a time when you had a conflict at work. Now the majority of people respond by saying, I've never had a conflict with anyone at work. That is not the way to answer this behavioral interview question. Let me give you my example response. Tell me about a time when you had a conflict at work here we go. I was working in a previous role when I noticed a co-worker was consistently late for team meetings. Each time he was late he gave a different excuse. His lack of punctuality was starting to affect the team, so I saw it as my responsibility to talk to him about it. I spoke to him in private and explained how I was concerned about his time keeping. He initially became defensive and told me to mind my own business. I remained calm and explained how each time he was late for team meetings it put back the progress of our team. I then asked if there was anything I could do to help him arrive on time. Just by speaking to my co-worker and offering to help him made him realise how important it was to be punctual. Moving forward he was never late again. I was pleased I intervened in a calm and pragmatic manner. That's a really good example answer and it shows that you can deal with conflict in a competent professional and calm manner. Don't go anywhere because I still have five more behavioral questions and answers to give you. But when you're ready, click that link in the top right hand corner of the video. Head straight through to my website, passmaintv.com and you can instantly download these slides and also my full set of 27. Tell me about a time, behave, interview questions and top scoring examplances. It's a fantastic resource and it's going to help you pass your interview at the first attempt. Here's question number three. Tell me about your time you worked under pressure. Again, this question comes up all the time during job interviews. Here's my example answer that uses a star technique of situation task action and result. Tell me about your time you worked under pressure. My manager asked for a volunteer to complete the work of a coworker who had recently left the company. A replacement team member had yet to be found, so they needed someone to do their work in the interim. I saw this as an opportunity to diversify my skills, so I volunteered. It was my task to learn my former coworkers duties quickly and complete their work and my own on time. I studied their job description and ticked off the work I could quickly complete. Now for the tasks I was unsure of, I read the company operating procedures and used online training tutorials. Now once confident, I prioritized all my tasks based on the company's needs. Red tasks were urgent and came first, Amber tasks second and green tasks could be completed when I had more time available. Now by using a systematic approach to learning and completing all tasks, I could do the work of two people which helped the company in its time of need. That's another really good thorough answer to that common behavioral interview question. Tell me about your time you worked under pressure. And what I really like about that answer is you are explaining how you prioritize your work using a traffic light system of red, amber and green tasks. Behavioral interview question number four is, tell me about a time you disagreed with your boss. Now again, a lot of people respond by saying, I've never disagreed with my boss. That's not the way to answer this question. Let me give you my example response that uses that brilliant easy to remember structure called star situation task action result. Tell me about a time you disagreed with your boss. In my previous role, my manager was conducting my annual performance review. He said he was very impressed with my overall performance, but wanted me to spend less time talking to customers on the telephone. I disagreed with this and it was my task to explain to him why in a professional and respectful manner. I explained that I had worked hard to build long-term relationships with customers, so they became long-term advocates of the business. I cited several examples where customers had spent considerable sums of money with the company and left positive online reviews after I had spent time helping them on the telephone. After listening to my thoughts, he agreed that the length of time I was cultivating relationships on the telephone with customers was, in fact, beneficial. That's a really good example answer. So you are not being defensive, you are disagreeing with your boss in a calm and respectful manner, but you are explaining why. And that reason is to the benefit of the company. Here's an next question. Question number five. Tell me about a time you made a mistake. Again, this is a really difficult behavioral interview question to answer. Most people say I've never made a mistake. Don't say that. We all make mistakes, but it is how you respond to the mistake and learn from it that is being assessed here. Here's my example answer that uses a start technique. Tell me about a time you made a mistake. When I started working my previous role, my supervisor asked me to write a blog for our website. It was my task to write a compelling blog about a new company product. Now, unfortunately, because I was busy with other important tasks, I failed to thoroughly check the finished blog. When I submitted it to my supervisor, she highlighted several grammar mistakes. I was very disappointed because I'd let myself, my team and my supervisor down. After apologizing, I rewrote the blog and ran a thorough spell and grammar check before resubmitting my work for approval. Now, I learned a lot from that mistake, and I now always check everything thoroughly to make sure it is perfect. That's another really good example answer. And that mistake is not too bad, but you recognize you made a mistake. You are apologizing, you put things right, and also you learn from it. Behavioral interview question number six. Tell me about a time you provided excellent customer service. Again, this comes up all the time during job interviews. Now, some of you might be saying, but Richard, I'd never been in these situations before. Well, if this type of question comes up and you've never been in the situation, give them an example of when you were on the receiving end of excellent customer service. Because that shows strong observational skills. You can give an example of when you witness somebody else doing the situation that is being assessed. Let me give you my example answer. Tell me about a time you provided excellent customer service. I was helping a customer in a previous role choose a product suitable for their needs. Now, my task was to ask them questions to determine precisely what they wanted and help them choose a product within their budget. I welcome them to the store and our several questions to establish their desired product and budget. Now, the customer expressed an interest in one of our more expensive products. But I explained that I felt this was different from what they needed and a slightly cheaper product would be more beneficial. They thanked me for my honesty in helping them decide on a more affordable alternative, and they left a brilliant review of our company online. So, brilliant answer to that common behavioral interview question. Tell me about a time you provided excellent customer service. Here's the next one. Tell me about a time you went above and beyond what was expected. Wow, this is a tricky one. Here's my example answer that uses a start technique. Tell me about a time you went above and beyond what was expected. It was late on a Friday afternoon when the company website went down. This was a significant problem because an online sale was due to commence at 9 a.m. the following morning. Now, my manager asked for a volunteer to stay behind late that evening to help resolve the issue. I volunteered to help. It was my task to help my manager troubleshoot the problem and get the website back up and running again quickly. Now, I started by researching the issue online. I could not find an obvious cause of the problem. So, I then went to the website upwork.com and hired a web developer to assess the issue for us. He informed me the problem was down to the size of our server. It wasn't sufficient to handle the upsurge in traffic. The website was experiencing. So, I asked my manager for permission to upgrade the server. As soon as a new server was live, the website started functioning again and we were able to have a successful online sale. So, that's a brilliant response because it shows you are prepared to help out the company. You go above and beyond. You try and resolve the issue yourself. You can't. But you then use your initiative and you go on a website called Outwork.com which is somewhere you can hire contractors and developers. And you hire a suitably qualified web developer who then resolves the issue for you. It's a really good example answer. Now, the next thing to do. If you want to pass your interview, at the first attempt, he's click that link in the top right hand corner of the video. Head straight through to my website. PassmainTV.com and you can instantly download a copy of these slides. Are my full set of 27? Tell me about a time behavioral interview questions on top scoring exam palanters. It's a fantastic resource. Make sure you check that out. Thank you so much for watching. Please don't forget to subscribe to the channel. As I said at the start, literally thousands of you are passing your job interviews. If you are subscribed, I can help you to pass every job interview you attend. Negotiate a salary and progress throughout your career. Don't forget to give the video a like. It's a small ask, but it really does motivate me to create more content for you. Thank you. Oh, and don't forget to connect with me on LinkedIn. I've put my LinkedIn link in the description below the video. It is always an honor and a pleasure to connect with like-minded professionals such as yourself. Thank you so much for watching and always you all the best. For passing your job interview, have a great day.",
  "segments": [
    {
      "id": 0,
      "text": "Hello, there my name is Richard McMunn from the Interview Training website, passmindofu.com and in this tutorial,"
    },
    {
      "id": 1,
      "text": "I will teach you how to answer behavioral interview questions."
    },
    {
      "id": 2,
      "text": "So if you have a job interview coming up soon for any role or company, please make sure you stay tuned,"
    },
    {
      "id": 3,
      "text": "because I promise to help you be the standout candidates."
    },
    {
      "id": 4,
      "text": "And to achieve that goal, this is what I will cover during this tutorial."
    },
    {
      "id": 5,
      "text": "I will tell you the seven most common behavioral interview questions for all job interviews."
    },
    {
      "id": 6,
      "text": "These questions come up all the time."
    },
    {
      "id": 7,
      "text": "It is important you have a top scoring answer prepared for all of these questions."
    },
    {
      "id": 8,
      "text": "Number two, I will tell you the best structure to use when answering any type of behavioral interview question."
    },
    {
      "id": 9,
      "text": "This structure is not only easy to remember, but it will guarantee you get the highest scores possible."
    },
    {
      "id": 10,
      "text": "Number three, I will then give you a brilliant top scoring example answer to all seven common behavioral interview questions."
    },
    {
      "id": 11,
      "text": "And then finally number four, I will tell you where you can instantly download these slides."
    },
    {
      "id": 12,
      "text": "And also my full set of 27 behavioral interview questions and top scoring answers in a PDF guide."
    },
    {
      "id": 13,
      "text": "And just very quickly, if you are new to this channel, please make sure you hit that subscribe button."
    },
    {
      "id": 14,
      "text": "Literally thousands of you are passing your job interviews."
    },
    {
      "id": 15,
      "text": "I can only help you if you are subscribed."
    },
    {
      "id": 16,
      "text": "And please give the video a like."
    },
    {
      "id": 17,
      "text": "That really does motivate me to create more content for you."
    },
    {
      "id": 18,
      "text": "And it tells me that you find these tutorials useful."
    },
    {
      "id": 19,
      "text": "Thank you very much for your support."
    },
    {
      "id": 20,
      "text": "Okay, so why are you being asked behavioral interview questions?"
    },
    {
      "id": 21,
      "text": "Well, behavioral interview questions often start with, tell me about a time when you delivered excellent customer service."
    },
    {
      "id": 22,
      "text": "Tell me about a time when you worked under pressure."
    },
    {
      "id": 23,
      "text": "Tell me about a time when you worked in a team."
    },
    {
      "id": 24,
      "text": "So you are being asked these questions too assess your suitability for the role you have applied for."
    },
    {
      "id": 25,
      "text": "Now, if you can give the interviewer previous examples of where you have demonstrated key workplace skills, you are far more likely to get hired."
    },
    {
      "id": 26,
      "text": "And that is the purpose of this tutorial."
    },
    {
      "id": 27,
      "text": "To give you example previous situations that you might have been in where you demonstrate the key workplace skills."
    },
    {
      "id": 28,
      "text": "That's very important if you are going to pass your interview."
    },
    {
      "id": 29,
      "text": "So let me tell you how to structure your answers to behavioral interview questions."
    },
    {
      "id": 30,
      "text": "This is really easy to remember."
    },
    {
      "id": 31,
      "text": "So this structure is called the star technique."
    },
    {
      "id": 32,
      "text": "Star stands for situation task action result."
    },
    {
      "id": 33,
      "text": "So if the interviewer asks you any type of behavioral interview question, you will use a star technique to structure your answer."
    },
    {
      "id": 34,
      "text": "Let's assume the question is tell me about a time when you worked in a team."
    },
    {
      "id": 35,
      "text": "So you would start off your answer and you would tell the interviewer the situation you were in."
    },
    {
      "id": 36,
      "text": "You would then move on and briefly outline the task that needed doing."
    },
    {
      "id": 37,
      "text": "You then move on and give in depth details about the action you took to complete the task before finishing off and telling the interviewer the result following your actions."
    },
    {
      "id": 38,
      "text": "So always use a star technique when responding to behavioral interview questions."
    },
    {
      "id": 39,
      "text": "Okay, so let me now give you seven brilliant answers to the most common behavioral interview questions."
    },
    {
      "id": 40,
      "text": "Here we go."
    },
    {
      "id": 41,
      "text": "So the first question is tell me about a time when you worked in a team."
    },
    {
      "id": 42,
      "text": "Let me give you my example answer that uses that star technique of situation task action and result."
    },
    {
      "id": 43,
      "text": "Here we go."
    },
    {
      "id": 44,
      "text": "Tell me about a time when you worked in a team."
    },
    {
      "id": 45,
      "text": "I was working in a previous role when two team members went off sick at short notice."
    },
    {
      "id": 46,
      "text": "It was our task as the remaining team members to take on the additional duties of our sick co-workers to deliver the company's objectives and goals on time."
    },
    {
      "id": 47,
      "text": "We got together assessed the duties of our sick co-workers and allocated tasks based on our strengths."
    },
    {
      "id": 48,
      "text": "We agreed to support each other and if anyone was struggling with their additional duties, we would step into help."
    },
    {
      "id": 49,
      "text": "Now at one point a co-worker was unsure how to complete one of their tasks."
    },
    {
      "id": 50,
      "text": "So I finished my own work and went over to help."
    },
    {
      "id": 51,
      "text": "By working together and supporting each other as a team, we were able to get all tasks and duties finished on time despite being two team members short."
    },
    {
      "id": 52,
      "text": "So that's a really good example answer."
    },
    {
      "id": 53,
      "text": "The use is a star technique that demonstrates when you have previously worked in a team."
    },
    {
      "id": 54,
      "text": "Let me now give you the second behavioral interview question and top scoring example answer."
    },
    {
      "id": 55,
      "text": "So that question is tell me about a time when you had a conflict at work."
    },
    {
      "id": 56,
      "text": "Now the majority of people respond by saying, I've never had a conflict with anyone at work."
    },
    {
      "id": 57,
      "text": "That is not the way to answer this behavioral interview question."
    },
    {
      "id": 58,
      "text": "Let me give you my example response."
    },
    {
      "id": 59,
      "text": "Tell me about a time when you had a conflict at work here we go."
    },
    {
      "id": 60,
      "text": "I was working in a previous role when I noticed a co-worker was consistently late for team meetings."
    },
    {
      "id": 61,
      "text": "Each time he was late he gave a different excuse."
    },
    {
      "id": 62,
      "text": "His lack of punctuality was starting to affect the team, so I saw it as my responsibility to talk to him about it."
    },
    {
      "id": 63,
      "text": "I spoke to him in private and explained how I was concerned about his time keeping."
    },
    {
      "id": 64,
      "text": "He initially became defensive and told me to mind my own business."
    },
    {
      "id": 65,
      "text": "I remained calm and explained how each time he was late for team meetings it put back the progress of our team."
    },
    {
      "id": 66,
      "text": "I then asked if there was anything I could do to help him arrive on time."
    },
    {
      "id": 67,
      "text": "Just by speaking to my co-worker and offering to help him made him realise how important it was to be punctual."
    },
    {
      "id": 68,
      "text": "Moving forward he was never late again."
    },
    {
      "id": 69,
      "text": "I was pleased I intervened in a calm and pragmatic manner."
    },
    {
      "id": 70,
      "text": "That's a really good example answer and it shows that you can deal with conflict in a competent professional and calm manner."
    },
    {
      "id": 71,
      "text": "Don't go anywhere because I still have five more behavioral questions and answers to give you."
    },
    {
      "id": 72,
      "text": "But when you're ready, click that link in the top right hand corner of the video."
    },
    {
      "id": 73,
      "text": "Head straight through to my website, passmaintv.com and you can instantly download these slides and also my full set of 27."
    },
    {
      "id": 74,
      "text": "Tell me about a time, behave, interview questions and top scoring examplances."
    },
    {
      "id": 75,
      "text": "It's a fantastic resource and it's going to help you pass your interview at the first attempt."
    },
    {
      "id": 76,
      "text": "Here's question number three."
    },
    {
      "id": 77,
      "text": "Tell me about your time you worked under pressure."
    },
    {
      "id": 78,
      "text": "Again, this question comes up all the time during job interviews."
    },
    {
      "id": 79,
      "text": "Here's my example answer that uses a star technique of situation task action and result."
    },
    {
      "id": 80,
      "text": "Tell me about your time you worked under pressure."
    },
    {
      "id": 81,
      "text": "My manager asked for a volunteer to complete the work of a coworker who had recently left the company."
    },
    {
      "id": 82,
      "text": "A replacement team member had yet to be found, so they needed someone to do their work in the interim."
    },
    {
      "id": 83,
      "text": "I saw this as an opportunity to diversify my skills, so I volunteered."
    },
    {
      "id": 84,
      "text": "It was my task to learn my former coworkers duties quickly and complete their work and my own on time."
    },
    {
      "id": 85,
      "text": "I studied their job description and ticked off the work I could quickly complete."
    },
    {
      "id": 86,
      "text": "Now for the tasks I was unsure of, I read the company operating procedures and used online training tutorials."
    },
    {
      "id": 87,
      "text": "Now once confident, I prioritized all my tasks based on the company's needs."
    },
    {
      "id": 88,
      "text": "Red tasks were urgent and came first, Amber tasks second and green tasks could be completed when I had more time available."
    },
    {
      "id": 89,
      "text": "Now by using a systematic approach to learning and completing all tasks, I could do the work of two people which helped the company in its time of need."
    },
    {
      "id": 90,
      "text": "That's another really good thorough answer to that common behavioral interview question."
    },
    {
      "id": 91,
      "text": "Tell me about your time you worked under pressure."
    },
    {
      "id": 92,
      "text": "And what I really like about that answer is you are explaining how you prioritize your work using a traffic light system of red, amber and green tasks."
    },
    {
      "id": 93,
      "text": "Behavioral interview question number four is, tell me about a time you disagreed with your boss."
    },
    {
      "id": 94,
      "text": "Now again, a lot of people respond by saying, I've never disagreed with my boss."
    },
    {
      "id": 95,
      "text": "That's not the way to answer this question."
    },
    {
      "id": 96,
      "text": "Let me give you my example response that uses that brilliant easy to remember structure called star situation task action result."
    },
    {
      "id": 97,
      "text": "Tell me about a time you disagreed with your boss."
    },
    {
      "id": 98,
      "text": "In my previous role, my manager was conducting my annual performance review."
    },
    {
      "id": 99,
      "text": "He said he was very impressed with my overall performance, but wanted me to spend less time talking to customers on the telephone."
    },
    {
      "id": 100,
      "text": "I disagreed with this and it was my task to explain to him why in a professional and respectful manner."
    },
    {
      "id": 101,
      "text": "I explained that I had worked hard to build long-term relationships with customers, so they became long-term advocates of the business."
    },
    {
      "id": 102,
      "text": "I cited several examples where customers had spent considerable sums of money with the company and left positive online reviews after I had spent time helping them on the telephone."
    },
    {
      "id": 103,
      "text": "After listening to my thoughts, he agreed that the length of time I was cultivating relationships on the telephone with customers was, in fact, beneficial."
    },
    {
      "id": 104,
      "text": "That's a really good example answer."
    },
    {
      "id": 105,
      "text": "So you are not being defensive, you are disagreeing with your boss in a calm and respectful manner, but you are explaining why."
    },
    {
      "id": 106,
      "text": "And that reason is to the benefit of the company."
    },
    {
      "id": 107,
      "text": "Here's an next question. Question number five."
    },
    {
      "id": 108,
      "text": "Tell me about a time you made a mistake. Again, this is a really difficult behavioral interview question to answer."
    },
    {
      "id": 109,
      "text": "Most people say I've never made a mistake. Don't say that. We all make mistakes, but it is how you respond to the mistake and learn from it that is being assessed here."
    },
    {
      "id": 110,
      "text": "Here's my example answer that uses a start technique."
    },
    {
      "id": 111,
      "text": "Tell me about a time you made a mistake."
    },
    {
      "id": 112,
      "text": "When I started working my previous role, my supervisor asked me to write a blog for our website."
    },
    {
      "id": 113,
      "text": "It was my task to write a compelling blog about a new company product."
    },
    {
      "id": 114,
      "text": "Now, unfortunately, because I was busy with other important tasks, I failed to thoroughly check the finished blog."
    },
    {
      "id": 115,
      "text": "When I submitted it to my supervisor, she highlighted several grammar mistakes."
    },
    {
      "id": 116,
      "text": "I was very disappointed because I'd let myself, my team and my supervisor down."
    },
    {
      "id": 117,
      "text": "After apologizing, I rewrote the blog and ran a thorough spell and grammar check before resubmitting my work for approval."
    },
    {
      "id": 118,
      "text": "Now, I learned a lot from that mistake, and I now always check everything thoroughly to make sure it is perfect."
    },
    {
      "id": 119,
      "text": "That's another really good example answer."
    },
    {
      "id": 120,
      "text": "And that mistake is not too bad, but you recognize you made a mistake."
    },
    {
      "id": 121,
      "text": "You are apologizing, you put things right, and also you learn from it."
    },
    {
      "id": 122,
      "text": "Behavioral interview question number six."
    },
    {
      "id": 123,
      "text": "Tell me about a time you provided excellent customer service."
    },
    {
      "id": 124,
      "text": "Again, this comes up all the time during job interviews."
    },
    {
      "id": 125,
      "text": "Now, some of you might be saying, but Richard, I'd never been in these situations before."
    },
    {
      "id": 126,
      "text": "Well, if this type of question comes up and you've never been in the situation, give them an example of when you were on the receiving end of excellent customer service."
    },
    {
      "id": 127,
      "text": "Because that shows strong observational skills."
    },
    {
      "id": 128,
      "text": "You can give an example of when you witness somebody else doing the situation that is being assessed."
    },
    {
      "id": 129,
      "text": "Let me give you my example answer."
    },
    {
      "id": 130,
      "text": "Tell me about a time you provided excellent customer service."
    },
    {
      "id": 131,
      "text": "I was helping a customer in a previous role choose a product suitable for their needs."
    },
    {
      "id": 132,
      "text": "Now, my task was to ask them questions to determine precisely what they wanted and help them choose a product within their budget."
    },
    {
      "id": 133,
      "text": "I welcome them to the store and our several questions to establish their desired product and budget."
    },
    {
      "id": 134,
      "text": "Now, the customer expressed an interest in one of our more expensive products."
    },
    {
      "id": 135,
      "text": "But I explained that I felt this was different from what they needed and a slightly cheaper product would be more beneficial."
    },
    {
      "id": 136,
      "text": "They thanked me for my honesty in helping them decide on a more affordable alternative, and they left a brilliant review of our company online."
    },
    {
      "id": 137,
      "text": "So, brilliant answer to that common behavioral interview question."
    },
    {
      "id": 138,
      "text": "Tell me about a time you provided excellent customer service."
    },
    {
      "id": 139,
      "text": "Here's the next one."
    },
    {
      "id": 140,
      "text": "Tell me about a time you went above and beyond what was expected."
    },
    {
      "id": 141,
      "text": "Wow, this is a tricky one."
    },
    {
      "id": 142,
      "text": "Here's my example answer that uses a start technique."
    },
    {
      "id": 143,
      "text": "Tell me about a time you went above and beyond what was expected."
    },
    {
      "id": 144,
      "text": "It was late on a Friday afternoon when the company website went down."
    },
    {
      "id": 145,
      "text": "This was a significant problem because an online sale was due to commence at 9 a.m. the following morning."
    },
    {
      "id": 146,
      "text": "Now, my manager asked for a volunteer to stay behind late that evening to help resolve the issue."
    },
    {
      "id": 147,
      "text": "I volunteered to help."
    },
    {
      "id": 148,
      "text": "It was my task to help my manager troubleshoot the problem and get the website back up and running again quickly."
    },
    {
      "id": 149,
      "text": "Now, I started by researching the issue online."
    },
    {
      "id": 150,
      "text": "I could not find an obvious cause of the problem."
    },
    {
      "id": 151,
      "text": "So, I then went to the website upwork.com and hired a web developer to assess the issue for us."
    },
    {
      "id": 152,
      "text": "He informed me the problem was down to the size of our server."
    },
    {
      "id": 153,
      "text": "It wasn't sufficient to handle the upsurge in traffic."
    },
    {
      "id": 154,
      "text": "The website was experiencing."
    },
    {
      "id": 155,
      "text": "So, I asked my manager for permission to upgrade the server."
    },
    {
      "id": 156,
      "text": "As soon as a new server was live, the website started functioning again and we were able to have a successful online sale."
    },
    {
      "id": 157,
      "text": "So, that's a brilliant response because it shows you are prepared to help out the company."
    },
    {
      "id": 158,
      "text": "You go above and beyond."
    },
    {
      "id": 159,
      "text": "You try and resolve the issue yourself."
    },
    {
      "id": 160,
      "text": "You can't."
    },
    {
      "id": 161,
      "text": "But you then use your initiative and you go on a website called Outwork.com which is somewhere you can hire contractors and developers."
    },
    {
      "id": 162,
      "text": "And you hire a suitably qualified web developer who then resolves the issue for you."
    },
    {
      "id": 163,
      "text": "It's a really good example answer."
    },
    {
      "id": 164,
      "text": "Now, the next thing to do."
    },
    {
      "id": 165,
      "text": "If you want to pass your interview, at the first attempt,"
    },
    {
      "id": 166,
      "text": "he's click that link in the top right hand corner of the video."
    },
    {
      "id": 167,
      "text": "Head straight through to my website."
    },
    {
      "id": 168,
      "text": "PassmainTV.com and you can instantly download a copy of these slides."
    },
    {
      "id": 169,
      "text": "Are my full set of 27?"
    },
    {
      "id": 170,
      "text": "Tell me about a time behavioral interview questions on top scoring exam palanters."
    },
    {
      "id": 171,
      "text": "It's a fantastic resource."
    },
    {
      "id": 172,
      "text": "Make sure you check that out."
    },
    {
      "id": 173,
      "text": "Thank you so much for watching."
    },
    {
      "id": 174,
      "text": "Please don't forget to subscribe to the channel."
    },
    {
      "id": 175,
      "text": "As I said at the start, literally thousands of you are passing your job interviews."
    },
    {
      "id": 176,
      "text": "If you are subscribed, I can help you to pass every job interview you attend."
    },
    {
      "id": 177,
      "text": "Negotiate a salary and progress throughout your career."
    },
    {
      "id": 178,
      "text": "Don't forget to give the video a like."
    },
    {
      "id": 179,
      "text": "It's a small ask, but it really does motivate me to create more content for you."
    },
    {
      "id": 180,
      "text": "Thank you."
    },
    {
      "id": 181,
      "text": "Oh, and don't forget to connect with me on LinkedIn."
    },
    {
      "id": 182,
      "text": "I've put my LinkedIn link in the description below the video."
    },
    {
      "id": 183,
      "text": "It is always an honor and a pleasure to connect with like-minded professionals such as yourself."
    },
    {
      "id": 184,
      "text": "Thank you so much for watching and always you all the best."
    },
    {
      "id": 185,
      "text": "For passing your job interview, have a great day."
    }
  ]
}