{
  "file": "UdJIyqyJ84I.wav",
  "text": " In this next powerful job interview training tutorial, I will give you brilliant answers to difficult behavioral interview questions. Now behavioral interview questions are used to assess how you acted in specific situations, situations such as working under pressure, and working in the 18. Your answers to behavioral interview questions will be the difference between a pass or a fail. Therefore, if you have an interview coming up soon for any role or company, stay tuned because a promise to help you be the standout candidate. And just for a quickly, if you are on you to my channel, please make sure you hit that subscribe button. I am here to help you, not just pass every job interview you ever attend. I can also help you progress throughout your career and negotiate to salary. I can only do that if you are subscribed and please give the video a like because that really does motivate me to create more content for you. Thank you very much indeed. Okay, let's jump straight into the tutorial. Okay, so let's start working through some of the hardest behavioral interview questions to answer. I will tell you what the behavioral interview question is before giving you a top scoring example answer. I will then also tell you where you can download the responses. Let's go. Behavioral interview question number one. Tell me about a time when you had to make a difficult decision. Here's a brilliant answer. In my previous job, my supervisor was on annual leave. A supplier kept letting us down, which resulted in customer complaints. I had to decide what to do about the situation in the absence of my supervisor. I weighed up the pros and cons of keeping the current supplier and decided to see can you one because I felt it was in the best interests of the company. Before informing the supplier we no longer needed them, I sought an alternative. I researched online, found several potential suppliers, checked their reviews and company history and discussed terms with them. Now, once I had found a new supplier, I let the old one go. Customer service standards then quickly improved, are my supervisor thanked to me for making the right decision when she returned from her holiday. Behavioral interview question number two. Tell me about a time when you anticipated a problem before it arose. How did you deal with the situation? This is a really difficult one to answer correctly. Here's a super answer. In my previous role, we were working towards a black Friday sale event. The team I was a part of had been preparing hard for the sale. We had several promotions planned, had contacted all previous customers to give them discount codes to use on the day of the sale, and we had employed an online marketing agency to run adverts for us across social media. In the build-up to the sale, I had concerns that the website server would not be able to handle the surge in traffic. If the website crashed during the sale, all our hard effort would go to waste, and the company would lose money. I carried out some research online and confirmed the company server would not be sufficient. I informed my manager about my research and he thanked me for my proactive thinking before commissioning an external IT company to upgrade the server in time for the sale. Behavioral interview question number three, tell me about a time when you went above and beyond what was required at work. Here we go. My manager came into the office one day and said another department within the organization needed someone to help out for a few weeks to cover a staff shortage. I decided to volunteer because it was an excellent opportunity for me to develop new skills and learn more about the company. The next day I started working my new team and obtained a brief from my manager. I was tasked with dealing with customer queries on the telephone and by email something I hadn't done before. It was a great experience because it taught me the importance of consistently providing excellent customer service and I better understood how the company functioned and what I could do to assist its growth. Behavioral interview question number four is, tell me about a time when you helped to improve a process at work. This is another really difficult one but here's an outstanding answer. I had concerns in my previous job that we needed a feedback facility to enable customers to make recommendations on how we could improve. Because I understood how crucial excellent service was to the businesses success, I found a feedback form online that could be easily installed on our website, allowing customers to complete it once they had made a purchase. The form gate customers the opportunity to rate their shopping experience and provide written feedback on how they felt we could improve. Once the form had been installed, we started receiving valuable feedback that enabled us to increase customer service standards. This in turn helped to increase sales and customer retention. Behavioral interview question number five is, tell me about a time when you disagreed with a coworker. This is another tough one but here's my outstanding answer. I was tasked with working on a client-based project in a previous role with another team member. We were responsible for working together to finish everything within four weeks for the client. At the start of the project, we disagreed on an appropriate plan of action and method of working. This was because we both had different working backgrounds and experiences. I listened to my work colleagues suggested approach to completing the project and I considered the best way forward that when ensure the needs of the project came first. I agreed to compromise on several areas of the project but stood my ground in the areas where I had substantial experience and expertise. After in-depth discussions, under few heated debates, we agreed on a great plan of action to ensure the project was completed on time and to the necessary standard. OK, so there's five brilliant answers to some of the hardest behavioral interview questions. Now, if you want to download those exact answers plus, my full set of 100 brilliant answers to difficult interview questions, click that link right now in the top right-hand corner of the video. Head straight through to my website, passmaintvu.com and you can download 100 outstanding top scoring answers to the most difficult interview questions. It comes as a PDF guide which means you can have it in your inbox within two minutes from now and it's going to put you ahead of the competition at your next interview. Also, please make sure you hit that subscribe button. Literally thousands of you are passing your job interviews at the very first attempt. I can only help you if you are subscribed. Please give the video a like, give it a thumbs up because that really does motivate me to create more content for you. Thank you very much indeed. And don't forget to connect with me on LinkedIn. I have put my LinkedIn link in the description below the video. It's always a pleasure and an honour to connect with like-minded professionals such as yourself. Thank you so much for watching and I wish you all the very best in your pursuit to passing your interview have a great day.",
  "segments": [
    {
      "id": 0,
      "text": "In this next powerful job interview training tutorial, I will give you brilliant answers to difficult behavioral interview questions."
    },
    {
      "id": 1,
      "text": "Now behavioral interview questions are used to assess how you acted in specific situations, situations such as working under pressure,"
    },
    {
      "id": 2,
      "text": "and working in the 18. Your answers to behavioral interview questions will be the difference between a pass or a fail."
    },
    {
      "id": 3,
      "text": "Therefore, if you have an interview coming up soon for any role or company, stay tuned because a promise to help you be the standout candidate."
    },
    {
      "id": 4,
      "text": "And just for a quickly, if you are on you to my channel, please make sure you hit that subscribe button."
    },
    {
      "id": 5,
      "text": "I am here to help you, not just pass every job interview you ever attend. I can also help you progress throughout your career and negotiate to salary."
    },
    {
      "id": 6,
      "text": "I can only do that if you are subscribed and please give the video a like because that really does motivate me to create more content for you."
    },
    {
      "id": 7,
      "text": "Thank you very much indeed. Okay, let's jump straight into the tutorial."
    },
    {
      "id": 8,
      "text": "Okay, so let's start working through some of the hardest behavioral interview questions to answer."
    },
    {
      "id": 9,
      "text": "I will tell you what the behavioral interview question is before giving you a top scoring example answer."
    },
    {
      "id": 10,
      "text": "I will then also tell you where you can download the responses. Let's go."
    },
    {
      "id": 11,
      "text": "Behavioral interview question number one. Tell me about a time when you had to make a difficult decision. Here's a brilliant answer."
    },
    {
      "id": 12,
      "text": "In my previous job, my supervisor was on annual leave. A supplier kept letting us down, which resulted in customer complaints."
    },
    {
      "id": 13,
      "text": "I had to decide what to do about the situation in the absence of my supervisor."
    },
    {
      "id": 14,
      "text": "I weighed up the pros and cons of keeping the current supplier and decided to see can you one because I felt it was in the best interests of the company."
    },
    {
      "id": 15,
      "text": "Before informing the supplier we no longer needed them, I sought an alternative."
    },
    {
      "id": 16,
      "text": "I researched online, found several potential suppliers, checked their reviews and company history and discussed terms with them."
    },
    {
      "id": 17,
      "text": "Now, once I had found a new supplier, I let the old one go."
    },
    {
      "id": 18,
      "text": "Customer service standards then quickly improved, are my supervisor thanked to me for making the right decision when she returned from her holiday."
    },
    {
      "id": 19,
      "text": "Behavioral interview question number two. Tell me about a time when you anticipated a problem before it arose. How did you deal with the situation?"
    },
    {
      "id": 20,
      "text": "This is a really difficult one to answer correctly. Here's a super answer."
    },
    {
      "id": 21,
      "text": "In my previous role, we were working towards a black Friday sale event. The team I was a part of had been preparing hard for the sale."
    },
    {
      "id": 22,
      "text": "We had several promotions planned, had contacted all previous customers to give them discount codes to use on the day of the sale, and we had employed an online marketing agency to run adverts for us across social media."
    },
    {
      "id": 23,
      "text": "In the build-up to the sale, I had concerns that the website server would not be able to handle the surge in traffic."
    },
    {
      "id": 24,
      "text": "If the website crashed during the sale, all our hard effort would go to waste, and the company would lose money."
    },
    {
      "id": 25,
      "text": "I carried out some research online and confirmed the company server would not be sufficient."
    },
    {
      "id": 26,
      "text": "I informed my manager about my research and he thanked me for my proactive thinking before commissioning an external IT company to upgrade the server in time for the sale."
    },
    {
      "id": 27,
      "text": "Behavioral interview question number three, tell me about a time when you went above and beyond what was required at work. Here we go."
    },
    {
      "id": 28,
      "text": "My manager came into the office one day and said another department within the organization needed someone to help out for a few weeks to cover a staff shortage."
    },
    {
      "id": 29,
      "text": "I decided to volunteer because it was an excellent opportunity for me to develop new skills and learn more about the company."
    },
    {
      "id": 30,
      "text": "The next day I started working my new team and obtained a brief from my manager."
    },
    {
      "id": 31,
      "text": "I was tasked with dealing with customer queries on the telephone and by email something I hadn't done before."
    },
    {
      "id": 32,
      "text": "It was a great experience because it taught me the importance of consistently providing excellent customer service and I better understood how the company functioned and what I could do to assist its growth."
    },
    {
      "id": 33,
      "text": "Behavioral interview question number four is, tell me about a time when you helped to improve a process at work."
    },
    {
      "id": 34,
      "text": "This is another really difficult one but here's an outstanding answer."
    },
    {
      "id": 35,
      "text": "I had concerns in my previous job that we needed a feedback facility to enable customers to make recommendations on how we could improve."
    },
    {
      "id": 36,
      "text": "Because I understood how crucial excellent service was to the businesses success, I found a feedback form online that could be easily installed on our website, allowing customers to complete it once they had made a purchase."
    },
    {
      "id": 37,
      "text": "The form gate customers the opportunity to rate their shopping experience and provide written feedback on how they felt we could improve."
    },
    {
      "id": 38,
      "text": "Once the form had been installed, we started receiving valuable feedback that enabled us to increase customer service standards."
    },
    {
      "id": 39,
      "text": "This in turn helped to increase sales and customer retention."
    },
    {
      "id": 40,
      "text": "Behavioral interview question number five is, tell me about a time when you disagreed with a coworker."
    },
    {
      "id": 41,
      "text": "This is another tough one but here's my outstanding answer."
    },
    {
      "id": 42,
      "text": "I was tasked with working on a client-based project in a previous role with another team member."
    },
    {
      "id": 43,
      "text": "We were responsible for working together to finish everything within four weeks for the client."
    },
    {
      "id": 44,
      "text": "At the start of the project, we disagreed on an appropriate plan of action and method of working."
    },
    {
      "id": 45,
      "text": "This was because we both had different working backgrounds and experiences."
    },
    {
      "id": 46,
      "text": "I listened to my work colleagues suggested approach to completing the project and I considered the best way forward that when ensure the needs of the project came first."
    },
    {
      "id": 47,
      "text": "I agreed to compromise on several areas of the project but stood my ground in the areas where I had substantial experience and expertise."
    },
    {
      "id": 48,
      "text": "After in-depth discussions, under few heated debates, we agreed on a great plan of action to ensure the project was completed on time and to the necessary standard."
    },
    {
      "id": 49,
      "text": "OK, so there's five brilliant answers to some of the hardest behavioral interview questions."
    },
    {
      "id": 50,
      "text": "Now, if you want to download those exact answers plus, my full set of 100 brilliant answers to difficult interview questions,"
    },
    {
      "id": 51,
      "text": "click that link right now in the top right-hand corner of the video."
    },
    {
      "id": 52,
      "text": "Head straight through to my website, passmaintvu.com and you can download 100 outstanding top scoring answers to the most difficult interview questions."
    },
    {
      "id": 53,
      "text": "It comes as a PDF guide which means you can have it in your inbox within two minutes from now and it's going to put you ahead of the competition at your next interview."
    },
    {
      "id": 54,
      "text": "Also, please make sure you hit that subscribe button. Literally thousands of you are passing your job interviews at the very first attempt."
    },
    {
      "id": 55,
      "text": "I can only help you if you are subscribed. Please give the video a like, give it a thumbs up because that really does motivate me to create more content for you. Thank you very much indeed."
    },
    {
      "id": 56,
      "text": "And don't forget to connect with me on LinkedIn. I have put my LinkedIn link in the description below the video."
    },
    {
      "id": 57,
      "text": "It's always a pleasure and an honour to connect with like-minded professionals such as yourself. Thank you so much for watching and I wish you all the very best in your pursuit to passing your interview have a great day."
    }
  ]
}