{
  "file": "UHlrSdM_vY4.wav",
  "text": " In this video, I will teach you how to use a star method when answering behavioral interview questions. The star method is recognized by all hiring managers as the perfect way to respond to difficult interview questions such as, Tell me about the time when you worked on a team and tell me about the time when you dealt with a challenging situation. Therefore, if you have a job interview coming up soon for any role or company, stay tuned because I promise to help you pass at the first attempt. And just very quickly, if you are new to my channel, please make sure you hit that subscribe button right now. Thousands of you are passing your interviews at the first attempt. I can only help you if you are subscribed and please give the video a like. Hit that like button right now because that really does motivate me to create more content for you. Thank you very much indeed. Okay, let's jump straight into the presentation. Okay, to help you pass your job interview at the first attempt, I will cover the following three things in this video number one. I will teach you what the star method is and why it is so important when answering behavioral interview questions. Number two, I will then give you top scoring answers to difficult behavioral interview questions that use that star method. And then finally, number three, I will tell you where you can instantly download my full set of star method answers to the most common behavioral interview questions. Okay, let's get started with the star method and why you need to use it at every job interview you attend. Please take notes. So the star method is an easy to remember structure for answering behavioral interview questions. Behavioral interview questions assess how you have dealt with situations you are likely encounter in your job. Now, when you use the star method in your job interview, it will ensure your answer score highly. Okay, star stands for situation task action and result. Here's how to structure your answers using the star method when responding to behavioral interview questions. So you start your answer and tell the hiring manager the situation you were faced with. Next, you briefly outline the task that need you doing. Then you will give in-depth details about the action you took to achieve the task and then finally you finish off your answer with the result following your actions. Okay, now that we know what the star method is, let me give you top scoring answers to the most common behavioral interview questions before telling you where you can download them. Here we go. Behavioral interview question number one is, tell me about a time when you worked on a team. Here's my star method answer. In my last job, I was tasked with working on a team that had to seek ways to improve customer service standards. It was our task to get together as a team, brainstorm ideas and present a list of viable ideas that would improve customer satisfaction and increase revenue. We arranged a team meeting where we each put forward innovative ideas. My suggestions included creating a customer feedback form, asking for reviews post purchase and using an automated website chatbot that could instantly answer customers inquiries. Other people in the team suggested special discounts for loyal customers and a reward scheme. During the meeting, we listened to each other, used everyone's strengths and focused on our end goal. At the end of the meeting, we had a fantastic list of eight viable ideas which we delivered to our manager. She thought they were all great ideas and after implementing them, customer service improved and sales increased by 20%. The behavioral interview question number two is, tell me about a time when you had a disagreement with your boss. Here's my star method answer. In my previous job, my manager gave a safety related task to a new team member that I thought went against company policy. This was a challenging situation because I respected my boss and wouldn't normally disagree with him. However, I thought it was important to speak out for safety reasons. It was my task to express my concerns with my boss in a calm and professional manner to achieve the correct outcome. I met my boss in private and explained why I felt allocating the task that a new team member was dangerous. I stated that the company had strict safety policies we should follow and if the task wasn't completed safely, our position could be compromised. I also offered an alternative solution because I'd received training in how to carry out the task safely and competently. I suggested I complete the task while the new team member observed. I also suggested we arrange safety training for the new team member which would empower them to complete all tasks moving forward. After listening to my suggestion, my manager agreed it was the correct course of action to take. Behavioral interview question number three is, tell me about a time when you dealt with a difficult situation. Here's my star method answer. In my previous job, I encountered a challenging situation with my coworker on how to approach a time-at-centitive task. We were responsible for identifying emerging trends and opportunities in our industry to support the company's growth strategy. This disagreement had the potential to affect the completion of the task within the given time frame. The responsibility fell on me to quickly resolve the issue and find a mutually beneficial way to proceed with the task. To address this situation, I initiated a productive conversation with my coworker. I began by actively listening to their proposed approach. I also articulated my own ideas and emphasised the importance of the tasks in the goal. My ideas included assessing the market leaders in the industry to see what they were doing to thrive and also using Google Trends to see what people were searching for. My colleague wanted to focus solely on feedback from previous customers. I agreed to use a combination of our best ideas as opposed to focusing on one thing we were able to complete the task and present our findings to our manager. Behavioral interview question number four is, tell me about a time when you successfully accomplished a task that was entirely new to you. Here is my star method answer. I managed to ask for a volunteer to cover the work of someone in a different department while they were off sick. I had never done their work before but was eager to help the company so I volunteered. It was my task to learn their role quickly to ensure consistency and productivity were maintained. I started by reading their job description and highlighting the tasks I was unsure about. I then studied training manuals and asked other people in the department for tips on task completion before creating a step by step checklist of what I need to do in order to complete my duties. Now although the learning curve was steep by maintaining focus double checking my work and asking for advice when needed I successfully completed their work on time and to a very high standard. Okay so there you have it fantastic answers to the most common behavioral interview questions that you use the star method. Now if you want to download the answers and accelerate your learning even further make sure you click that link right now in the top right hand corner of the video. Head straight through to my website passmaintoview.com and you can download my ultimate job interview preparation pack. This is a formidable resource that will put you ahead of the competition at every job interview you ever attend. When you download my ultimate job interview preparation pack you get the following items in PDF format. You will get the 17 best questions to ask in an interview. Now at the end of your job interview I recommend you are three questions or you have to do is choose three questions from the 17. You will also get my body language technique trading. I will teach you how to create a positive impression at your job interview. You also get and this is brilliant my 30 60 and 90 day plans for job interviews you will get my top 25 best words to say in your job interview you will get an interview closing statement. I will tell you what to say at the end of your interview to impress the hiring manager you also get ready-made CV and resume templates plus those answers I just gave you plus an additional 50 brilliant responses to difficult interview questions. Make sure you get these resources by clicking that link right now also. Please make sure you hit that subscribe button. I am very passionate about helping you pass your interviews and progress throughout your career. I can only do those things if you are subscribed. Please hit the like button that really does motivate me to create more videos for you. And don't forget to connect with me on LinkedIn. I have put my LinkedIn link in the description below the video. It's always an honor and a pleasure to connect with like minded professionals such as yourself. Thank you for watching and I wish you all the best for passing your job interview. Have a great day.",
  "segments": [
    {
      "id": 0,
      "text": "In this video, I will teach you how to use a star method when answering behavioral interview questions."
    },
    {
      "id": 1,
      "text": "The star method is recognized by all hiring managers as the perfect way to respond to difficult interview questions such as,"
    },
    {
      "id": 2,
      "text": "Tell me about the time when you worked on a team and tell me about the time when you dealt with a challenging situation."
    },
    {
      "id": 3,
      "text": "Therefore, if you have a job interview coming up soon for any role or company, stay tuned because I promise to help you pass at the first attempt."
    },
    {
      "id": 4,
      "text": "And just very quickly, if you are new to my channel, please make sure you hit that subscribe button right now."
    },
    {
      "id": 5,
      "text": "Thousands of you are passing your interviews at the first attempt."
    },
    {
      "id": 6,
      "text": "I can only help you if you are subscribed and please give the video a like."
    },
    {
      "id": 7,
      "text": "Hit that like button right now because that really does motivate me to create more content for you."
    },
    {
      "id": 8,
      "text": "Thank you very much indeed."
    },
    {
      "id": 9,
      "text": "Okay, let's jump straight into the presentation."
    },
    {
      "id": 10,
      "text": "Okay, to help you pass your job interview at the first attempt, I will cover the following three things in this video number one."
    },
    {
      "id": 11,
      "text": "I will teach you what the star method is and why it is so important when answering behavioral interview questions."
    },
    {
      "id": 12,
      "text": "Number two, I will then give you top scoring answers to difficult behavioral interview questions that use that star method."
    },
    {
      "id": 13,
      "text": "And then finally, number three, I will tell you where you can instantly download my full set of star method answers to the most common behavioral interview questions."
    },
    {
      "id": 14,
      "text": "Okay, let's get started with the star method and why you need to use it at every job interview you attend."
    },
    {
      "id": 15,
      "text": "Please take notes."
    },
    {
      "id": 16,
      "text": "So the star method is an easy to remember structure for answering behavioral interview questions."
    },
    {
      "id": 17,
      "text": "Behavioral interview questions assess how you have dealt with situations you are likely encounter in your job."
    },
    {
      "id": 18,
      "text": "Now, when you use the star method in your job interview, it will ensure your answer score highly."
    },
    {
      "id": 19,
      "text": "Okay, star stands for situation task action and result."
    },
    {
      "id": 20,
      "text": "Here's how to structure your answers using the star method when responding to behavioral interview questions."
    },
    {
      "id": 21,
      "text": "So you start your answer and tell the hiring manager the situation you were faced with."
    },
    {
      "id": 22,
      "text": "Next, you briefly outline the task that need you doing."
    },
    {
      "id": 23,
      "text": "Then you will give in-depth details about the action you took to achieve the task and then finally you finish off your answer with the result following your actions."
    },
    {
      "id": 24,
      "text": "Okay, now that we know what the star method is, let me give you top scoring answers to the most common behavioral interview questions before telling you where you can download them."
    },
    {
      "id": 25,
      "text": "Here we go."
    },
    {
      "id": 26,
      "text": "Behavioral interview question number one is, tell me about a time when you worked on a team."
    },
    {
      "id": 27,
      "text": "Here's my star method answer."
    },
    {
      "id": 28,
      "text": "In my last job, I was tasked with working on a team that had to seek ways to improve customer service standards."
    },
    {
      "id": 29,
      "text": "It was our task to get together as a team, brainstorm ideas and present a list of viable ideas that would improve customer satisfaction and"
    },
    {
      "id": 30,
      "text": "increase revenue."
    },
    {
      "id": 31,
      "text": "We arranged a team meeting where we each put forward innovative ideas."
    },
    {
      "id": 32,
      "text": "My suggestions included creating a customer feedback form, asking for reviews post purchase and using an automated website chatbot that could instantly answer customers inquiries."
    },
    {
      "id": 33,
      "text": "Other people in the team suggested special discounts for loyal customers and a reward scheme."
    },
    {
      "id": 34,
      "text": "During the meeting, we listened to each other, used everyone's strengths and focused on our end goal."
    },
    {
      "id": 35,
      "text": "At the end of the meeting, we had a fantastic list of eight viable ideas which we delivered to our manager."
    },
    {
      "id": 36,
      "text": "She thought they were all great ideas and after implementing them, customer service improved and sales increased by 20%."
    },
    {
      "id": 37,
      "text": "The behavioral interview question number two is, tell me about a time when you had a disagreement with your boss."
    },
    {
      "id": 38,
      "text": "Here's my star method answer."
    },
    {
      "id": 39,
      "text": "In my previous job, my manager gave a safety related task to a new team member that I thought went against company policy."
    },
    {
      "id": 40,
      "text": "This was a challenging situation because I respected my boss and wouldn't normally disagree with him."
    },
    {
      "id": 41,
      "text": "However, I thought it was important to speak out for safety reasons."
    },
    {
      "id": 42,
      "text": "It was my task to express my concerns with my boss in a calm and professional manner to achieve the correct outcome."
    },
    {
      "id": 43,
      "text": "I met my boss in private and explained why I felt allocating the task that a new team member was dangerous."
    },
    {
      "id": 44,
      "text": "I stated that the company had strict safety policies we should follow and if the task wasn't completed safely, our position could be compromised."
    },
    {
      "id": 45,
      "text": "I also offered an alternative solution because I'd received training in how to carry out the task safely and competently."
    },
    {
      "id": 46,
      "text": "I suggested I complete the task while the new team member observed."
    },
    {
      "id": 47,
      "text": "I also suggested we arrange safety training for the new team member which would empower them to complete all tasks moving forward."
    },
    {
      "id": 48,
      "text": "After listening to my suggestion, my manager agreed it was the correct course of action to take."
    },
    {
      "id": 49,
      "text": "Behavioral interview question number three is, tell me about a time when you dealt with a difficult situation."
    },
    {
      "id": 50,
      "text": "Here's my star method answer."
    },
    {
      "id": 51,
      "text": "In my previous job, I encountered a challenging situation with my coworker on how to approach a time-at-centitive task."
    },
    {
      "id": 52,
      "text": "We were responsible for identifying emerging trends and opportunities in our industry to support the company's growth strategy."
    },
    {
      "id": 53,
      "text": "This disagreement had the potential to affect the completion of the task within the given time frame."
    },
    {
      "id": 54,
      "text": "The responsibility fell on me to quickly resolve the issue and find a mutually beneficial way to proceed with the task."
    },
    {
      "id": 55,
      "text": "To address this situation, I initiated a productive conversation with my coworker."
    },
    {
      "id": 56,
      "text": "I began by actively listening to their proposed approach."
    },
    {
      "id": 57,
      "text": "I also articulated my own ideas and emphasised the importance of the tasks in the goal."
    },
    {
      "id": 58,
      "text": "My ideas included assessing the market leaders in the industry to see what they were doing to thrive and also using Google Trends to see what people were searching for."
    },
    {
      "id": 59,
      "text": "My colleague wanted to focus solely on feedback from previous customers."
    },
    {
      "id": 60,
      "text": "I agreed to use a combination of our best ideas as opposed to focusing on one thing we were able to complete the task and present our findings to our manager."
    },
    {
      "id": 61,
      "text": "Behavioral interview question number four is, tell me about a time when you successfully accomplished a task that was entirely new to you."
    },
    {
      "id": 62,
      "text": "Here is my star method answer."
    },
    {
      "id": 63,
      "text": "I managed to ask for a volunteer to cover the work of someone in a different department while they were off sick."
    },
    {
      "id": 64,
      "text": "I had never done their work before but was eager to help the company so I volunteered."
    },
    {
      "id": 65,
      "text": "It was my task to learn their role quickly to ensure consistency and productivity were maintained."
    },
    {
      "id": 66,
      "text": "I started by reading their job description and highlighting the tasks I was unsure about."
    },
    {
      "id": 67,
      "text": "I then studied training manuals and asked other people in the department for tips on task completion before creating a step by step checklist of what I need to do in order to complete my duties."
    },
    {
      "id": 68,
      "text": "Now although the learning curve was steep by maintaining focus double checking my work and asking for advice when needed I successfully completed their work on time and to a very high standard."
    },
    {
      "id": 69,
      "text": "Okay so there you have it fantastic answers to the most common behavioral interview questions that you use the star method."
    },
    {
      "id": 70,
      "text": "Now if you want to download the answers and accelerate your learning even further make sure you click that link right now in the top right hand corner of the video."
    },
    {
      "id": 71,
      "text": "Head straight through to my website passmaintoview.com and you can download my ultimate job interview preparation pack."
    },
    {
      "id": 72,
      "text": "This is a formidable resource that will put you ahead of the competition at every job interview you ever attend."
    },
    {
      "id": 73,
      "text": "When you download my ultimate job interview preparation pack you get the following items in PDF format."
    },
    {
      "id": 74,
      "text": "You will get the 17 best questions to ask in an interview. Now at the end of your job interview I recommend you are three questions or you have to do is choose three questions from the 17."
    },
    {
      "id": 75,
      "text": "You will also get my body language technique trading. I will teach you how to create a positive impression at your job interview."
    },
    {
      "id": 76,
      "text": "You also get and this is brilliant my 30 60 and 90 day plans for job interviews you will get my top 25 best words to say in your job interview you will get an interview closing statement."
    },
    {
      "id": 77,
      "text": "I will tell you what to say at the end of your interview to impress the hiring manager you also get ready-made CV and resume templates plus those answers I just gave you plus an additional 50 brilliant responses to difficult interview questions."
    },
    {
      "id": 78,
      "text": "Make sure you get these resources by clicking that link right now also."
    },
    {
      "id": 79,
      "text": "Please make sure you hit that subscribe button. I am very passionate about helping you pass your interviews and progress throughout your career. I can only do those things if you are subscribed. Please hit the like button that really does motivate me to create more videos for you."
    },
    {
      "id": 80,
      "text": "And don't forget to connect with me on LinkedIn. I have put my LinkedIn link in the description below the video. It's always an honor and a pleasure to connect with like minded professionals such as yourself."
    },
    {
      "id": 81,
      "text": "Thank you for watching and I wish you all the best for passing your job interview. Have a great day."
    }
  ]
}