{
  "file": "v9GcqXuRc-A.wav",
  "text": " Hello there, my name is Richard McMunn from the Interview Training website, pass my interview.com, and in this training video, I will teach you how to pass an Amazon area manager interview. If you are applying to become an area manager with Amazon, make sure you watch this video from start to finish because the tips, questions and sample answers I am about to give you, will help you pass your interview at the first attempt. And to achieve that goal, I will cover the following four things in this training video number one. I will tell you which questions are asked the most during Amazon area manager interviews. Number two, I will then give you two very important tips for giving a top scoring answer to each of those Amazon area manager interview questions. Number three, I will then give you a brilliant example answer to each interview question to help you pass your interview and then finally number four, I will tell you where you can instantly download my 24 brilliant answers to difficult Amazon area manager interview questions. And just very quickly, if you are new to my YouTube channel, please make sure you hit that subscribe button. Thousands of you are passing your job interviews at the first attempt. I can only help you if you are subscribed and please hit the like button because that really does energize and motivate me to create more great content for you. Thank you very much indeed. Okay, let's get started with the first question. I recommend you prepare for and that is tell me about yourself. Let me give you two important tips for giving a brilliant response before I give you my top scoring example answer. Tip number one, now Amazon area managers must be excellent communicators and have confidence in their abilities. So please make sure you practice your answer several times before your interview. If you practice your response, it will help get your interview off to a positive start. And tip number two, good things to include in your answer are the skills and qualities you have that match the area manager job description, accomplishments from previous positions you have held and also references to the 16 Amazon leadership principles. Now if you want to share your interview, I strongly recommend you read and learn the 16 Amazon leadership principles before your interview. So here is my top scoring example answer to help you. Tell me about yourself. Here we go. Thank you for this opportunity to become an area manager with Amazon. Before I applied, I studied the job description to ensure I have the skills, leadership qualities and experience to meet the roles demands. I am a strong communicator, can motivate people to achieve important deadlines and will take the lead during challenges to ensure Amazon's commercial and strategic goals are achieved. I am a high achiever. In my last job, I was prayed for completing all projects on time and suggesting ideas to help streamline processes and systems to improve efficiency. I have taken a keen interest in Amazon's leadership principles and will ensure these are the foundation of all my decisions in this role. My relevant experience in people management, building relationships with stakeholders and using data to make informed decisions will ensure I am a productive and effective area manager for Amazon. And I look forward to sharing additional details regarding my suitability for this position in the interview. So that is a really good example answer to that first Amazon area manager interview question tell me about yourself. Now you can either pause the video if you want to and write down the questions, tips and answers as we work through them together or if you wait, I will soon tell you where you can instantly download my full set of 24 brilliant exam palancers to difficult Amazon area manager interview questions. Now here is the next question that I strongly recommend you prepare for. My Amazon or they might say why do you want to work for Amazon. Here's two really important tips. Tip number one. So this next common interview question is assessing your motivations for wanting to work for this brilliant organization. My opinion is that Amazon is the greatest organization in the world. That is why area manager positions are sought after. Make sure you give a genuine response to this question. So you must demonstrate a genuine desire for wanting to work at Amazon in your answer. But how do you do that? Well good things to include in your response are, Amazon's impressive track record of success, then this means you will be working for a higher achieving organization. Amazon's 16 leadership principles and how these will be the foundation of your work as an area manager and the fact that Amazon is a company that takes calculated risks. Now in my opinion the best organizations in the world take calculated risks to be successful. And that is one of the appealing reasons why I would want to work for Amazon. So here is a brilliant top scoring example answer to help you. Why Amazon? I want to work for Amazon because of its track record of success, leadership principles and calculated risk taking. Amazon's impressive track record and growth trajectory give me the confidence. I will be working for a senior management team that will support me to achieve great things in my work. I believe in Amazon's 16 leadership principles. They will make my work more enjoyable while giving me structure and the set of standards for myself are my team to adhere to. Finally, organizations like Amazon can only succeed by taking calculated risks. Because Amazon invests in new ideas, embraces opportunities and puts its customers at the core of its work, I am confident this is a place I can build along and successful career. So that is another brilliant confident answer that will help you pass your Amazon area manager interview. Now don't go anywhere because I still have many more tips, questions and sample answers to give you. But when you're ready, you can click the link in the top right-hand corner of the video, head straight through to my website, pass my interview.com, and instantly download my 24 brilliant answers to difficult Amazon area manager interview questions. But here is the next question that I strongly recommend you prepare for. That question is, tell me about a time you improved a process or made a customer focused decision. Tip number one. Now the majority of your Amazon area manager interview will be focused on answering behavioral interview questions that are centered on the 16 leadership principles. Tip number two, now when answering these challenging behavioral interview questions, I strongly recommend you use the star method. Let me quickly explain what the star method is before I give you my brilliant example answer. The star method stands for situation, task, action and result. So you begin your answer and you outline the situation you were faced with. Next, you will give brief details about the task that needed your attention. You will then give in-depth details about the action you took to complete the task before finally finishing your answer with the results following your actions and you should always make sure the results are positive. So let's now move on and have a look at a brilliant example answer to this question that uses the star method, situation, task, action and result. Tell me about a time you improved a process or made a customer focused decision. In my last job, I closely monitored customer reviews, a noticed several negative comments citing a delay in order delivery. My task was to investigate this problem to ensure customer service standards did not deteriorate further. I contacted the customers who had left negative comments to first apologize and ask them questions about their experience with the company. They all informed me they had placed orders through our website, but there had been an unacceptable delay in receiving their orders. After investigating the problem further, I established that one of the company's suppliers was experiencing supply chain issues resulting in delivery delays. I decided to quickly source an alternative supplier who could offer improved terms for the company. After deciding to switch suppliers, excellent service standards resumed and all orders were delivered promptly. So that is another really good answer that uses that star method of situation, task, action and result. The next question I recommend you prepare for in advance of your Amazon area manager interview is what's your leadership style? Tip number one. Now as an Amazon area manager, you will be a leader who must direct control and motivate a team of people. So be sure to know what your leadership style is before your interview and tip number two, there are several leadership styles including Democratic or to-cratic where you tell people what you want doing and by when. Lacer Fair Leadership which is a relaxed leadership style, I personally do not think Lacer Fair is a good leadership style for working at Amazon. A transformational leadership style where you and your team embrace change and also a coaching style of leadership. So here is my example answer. This is exactly how I would answer this difficult but common Amazon interview question. What's your leadership style? My leadership style is a combination of or to-cratic transformational and coaching. When my team and I are up against tight deadlines, I will be or to-cratic and provide clear and confident instructions on what needs doing and by when. I am a transformational leader who believes in the importance of change. I will encourage my team to embrace change positively and explain its benefits and finally I am a leader who provides regular training and coaching to ensure my team members reach their full potential. So you can see how these answers will help you prepare fully for your Amazon area manager interview that is a really good confident answer. Here is the next question. Describe a situation when you had to act quickly under pressure. Tip number one. Now this next difficult Amazon area manager interview question is assessing the leadership principles of bias for action and ownership. And tip number two, I recommend you give a specific situation in which you took decisive action to achieve a positive outcome despite being under pressure. Again, make sure you use the star method situation, task action and result to structure your answer. So here is another brilliant top scoring example answer to help you pass your interview. Describe a situation when you had to act quickly under pressure. Here we go. In my last job and important client contacted me to say they were not renewing their contract with they had received a better offer from one of our direct competitors. My task was to act quickly to determine the best offer we could make to the client to retain their business. I asked the client to meet me that day to which they agreed. On the way to the meeting, I assessed the terms of their current contract and created a list of questions I wanted to ask them. And anticipating what their answers might be, I drafted two improved contract offers that I felt were in the best interests of the client and my employer. During the meeting, I asked the client questions about their needs and listened carefully to their answers. At the end of the meeting, I presented the client with a new and improved contract offer that met their needs. After considering the new contract offer, they contacted me to say they would accept it which was a great result for the company. So that is a really good example situation where you are under pressure and you have to act quickly. You have prepared alternative contract offers and you have drafted up a set of questions you will ask the client at the meeting. So you are taking decisive action to retain the client's business. Here is the next question. This is another behavioral interview question. Tell me about a time when you found a simple solution to a complex problem. This question comes up all the time during Amazon area manager interviews. Tip number one. So as an area manager for Amazon, you will have to overcome challenging situations on a regular basis. So this next behavioral question assesses your ability to act quickly to create solutions that ensure Amazon's operations can continue successfully. And tip number two, give a specific situation where you assess the situation that was causing problems for your employer before creating a simple solution. Here is another brilliant example answer. Again, the use is the star method. Situation, task action and result. Tell me about a time when you found a simple solution to a complex problem. Here we go. In my previous job, we had an ongoing problem with communication. Updates on projects and task delegation were becoming increasingly difficult as the company expanded. I decided to find a simple solution to this issue. After researching online for the best workplace communication and productivity tools, I put together a short presentation on a tool called Evernote. Evernote would empower managers and team members to keep everyone updated on task and project progression. After watching my presentation, my manager agreed to its implementation and within several weeks Evernote became a fundamental part of our workplace productivity scheduling and task management. So that is another great answer that shows you take decisive action to find a simple solution to a difficult problem. It's a really good example answer. Okay, now the next thing to do to accelerate your learning even further and make sure you are fully prepared for your Amazon area manager interview is click the link in the top right-hand corner of the video. Head straight through to my website, passmaintoview.com where you can instantly download these slides plus my full set of 24 brilliant answers to Amazon area manager interview questions. This guide comes as a PDF document which means you can have everything in your inbox within two minutes from now. Make sure you go through to that website, passmaintoview by clicking that link because on the page, I have also given you three questions. I recommend you ask at the end of your area manager interview. Also, please make sure you hit that subscribe button, give the video alike and don't forget to connect with me on LinkedIn. I have put my LinkedIn link in the description below the video. It is always an honor and a pleasure to connect with like-minded professional such as yourself. Thank you very much for watching and for supporting my channel. I wish you all the very best for passing your Amazon area manager interview. Have a wonderful day.",
  "segments": [
    {
      "id": 0,
      "text": "Hello there, my name is Richard McMunn from the Interview Training website, pass my interview.com,"
    },
    {
      "id": 1,
      "text": "and in this training video, I will teach you how to pass an Amazon area manager interview."
    },
    {
      "id": 2,
      "text": "If you are applying to become an area manager with Amazon, make sure you watch this video"
    },
    {
      "id": 3,
      "text": "from start to finish because the tips, questions and sample answers I am about to give you,"
    },
    {
      "id": 4,
      "text": "will help you pass your interview at the first attempt."
    },
    {
      "id": 5,
      "text": "And to achieve that goal, I will cover the following four things in this training video"
    },
    {
      "id": 6,
      "text": "number one."
    },
    {
      "id": 7,
      "text": "I will tell you which questions are asked the most during Amazon area manager interviews."
    },
    {
      "id": 8,
      "text": "Number two, I will then give you two very important tips for giving a top scoring"
    },
    {
      "id": 9,
      "text": "answer to each of those Amazon area manager interview questions."
    },
    {
      "id": 10,
      "text": "Number three, I will then give you a brilliant example answer to each interview question"
    },
    {
      "id": 11,
      "text": "to help you pass your interview and then finally number four, I will tell you where you"
    },
    {
      "id": 12,
      "text": "can instantly download my 24 brilliant answers to difficult Amazon area manager interview"
    },
    {
      "id": 13,
      "text": "questions."
    },
    {
      "id": 14,
      "text": "And just very quickly, if you are new to my YouTube channel, please make sure you hit that"
    },
    {
      "id": 15,
      "text": "subscribe button."
    },
    {
      "id": 16,
      "text": "Thousands of you are passing your job interviews at the first attempt."
    },
    {
      "id": 17,
      "text": "I can only help you if you are subscribed and please hit the like button because that"
    },
    {
      "id": 18,
      "text": "really does energize and motivate me to create more great content for you."
    },
    {
      "id": 19,
      "text": "Thank you very much indeed."
    },
    {
      "id": 20,
      "text": "Okay, let's get started with the first question."
    },
    {
      "id": 21,
      "text": "I recommend you prepare for and that is tell me about yourself."
    },
    {
      "id": 22,
      "text": "Let me give you two important tips for giving a brilliant response before I give you"
    },
    {
      "id": 23,
      "text": "my top scoring example answer."
    },
    {
      "id": 24,
      "text": "Tip number one, now Amazon area managers must be excellent communicators and have confidence"
    },
    {
      "id": 25,
      "text": "in their abilities."
    },
    {
      "id": 26,
      "text": "So please make sure you practice your answer several times before your interview."
    },
    {
      "id": 27,
      "text": "If you practice your response, it will help get your interview off to a positive start."
    },
    {
      "id": 28,
      "text": "And tip number two, good things to include in your answer are the skills and qualities"
    },
    {
      "id": 29,
      "text": "you have that match the area manager job description, accomplishments from previous positions"
    },
    {
      "id": 30,
      "text": "you have held and also references to the 16 Amazon leadership principles."
    },
    {
      "id": 31,
      "text": "Now if you want to share your interview, I strongly recommend you read and learn the 16"
    },
    {
      "id": 32,
      "text": "Amazon leadership principles before your interview."
    },
    {
      "id": 33,
      "text": "So here is my top scoring example answer to help you."
    },
    {
      "id": 34,
      "text": "Tell me about yourself."
    },
    {
      "id": 35,
      "text": "Here we go."
    },
    {
      "id": 36,
      "text": "Thank you for this opportunity to become an area manager with Amazon."
    },
    {
      "id": 37,
      "text": "Before I applied, I studied the job description to ensure I have the skills, leadership"
    },
    {
      "id": 38,
      "text": "qualities and experience to meet the roles demands."
    },
    {
      "id": 39,
      "text": "I am a strong communicator, can motivate people to achieve important deadlines and will"
    },
    {
      "id": 40,
      "text": "take the lead during challenges to ensure Amazon's commercial and strategic goals are achieved."
    },
    {
      "id": 41,
      "text": "I am a high achiever."
    },
    {
      "id": 42,
      "text": "In my last job, I was prayed for completing all projects on time and suggesting ideas to help"
    },
    {
      "id": 43,
      "text": "streamline processes and systems to improve efficiency."
    },
    {
      "id": 44,
      "text": "I have taken a keen interest in Amazon's leadership principles and will ensure these are"
    },
    {
      "id": 45,
      "text": "the foundation of all my decisions in this role."
    },
    {
      "id": 46,
      "text": "My relevant experience in people management, building relationships with stakeholders and using"
    },
    {
      "id": 47,
      "text": "data to make informed decisions will ensure I am a productive and effective area manager"
    },
    {
      "id": 48,
      "text": "for Amazon."
    },
    {
      "id": 49,
      "text": "And I look forward to sharing additional details regarding my suitability for this position"
    },
    {
      "id": 50,
      "text": "in the interview."
    },
    {
      "id": 51,
      "text": "So that is a really good example answer to that first Amazon area manager interview question"
    },
    {
      "id": 52,
      "text": "tell me about yourself."
    },
    {
      "id": 53,
      "text": "Now you can either pause the video if you want to and write down the questions, tips and"
    },
    {
      "id": 54,
      "text": "answers as we work through them together or if you wait, I will soon tell you where you"
    },
    {
      "id": 55,
      "text": "can instantly download my full set of 24 brilliant exam palancers to difficult Amazon area"
    },
    {
      "id": 56,
      "text": "manager interview questions."
    },
    {
      "id": 57,
      "text": "Now here is the next question that I strongly recommend you prepare for."
    },
    {
      "id": 58,
      "text": "My Amazon or they might say why do you want to work for Amazon."
    },
    {
      "id": 59,
      "text": "Here's two really important tips."
    },
    {
      "id": 60,
      "text": "Tip number one."
    },
    {
      "id": 61,
      "text": "So this next common interview question is assessing your motivations for wanting to work"
    },
    {
      "id": 62,
      "text": "for this brilliant organization."
    },
    {
      "id": 63,
      "text": "My opinion is that Amazon is the greatest organization in the world."
    },
    {
      "id": 64,
      "text": "That is why area manager positions are sought after."
    },
    {
      "id": 65,
      "text": "Make sure you give a genuine response to this question."
    },
    {
      "id": 66,
      "text": "So you must demonstrate a genuine desire for wanting to work at Amazon in your answer."
    },
    {
      "id": 67,
      "text": "But how do you do that?"
    },
    {
      "id": 68,
      "text": "Well good things to include in your response are, Amazon's impressive track record of success,"
    },
    {
      "id": 69,
      "text": "then this means you will be working for a higher achieving organization."
    },
    {
      "id": 70,
      "text": "Amazon's 16 leadership principles and how these will be the foundation of your work as an area"
    },
    {
      "id": 71,
      "text": "manager and the fact that Amazon is a company that takes calculated risks."
    },
    {
      "id": 72,
      "text": "Now in my opinion the best organizations in the world take calculated risks to be successful."
    },
    {
      "id": 73,
      "text": "And that is one of the appealing reasons why I would want to work for Amazon."
    },
    {
      "id": 74,
      "text": "So here is a brilliant top scoring example answer to help you."
    },
    {
      "id": 75,
      "text": "Why Amazon?"
    },
    {
      "id": 76,
      "text": "I want to work for Amazon because of its track record of success,"
    },
    {
      "id": 77,
      "text": "leadership principles and calculated risk taking."
    },
    {
      "id": 78,
      "text": "Amazon's impressive track record and growth trajectory give me the confidence."
    },
    {
      "id": 79,
      "text": "I will be working for a senior management team that will support me to achieve great things in my work."
    },
    {
      "id": 80,
      "text": "I believe in Amazon's 16 leadership principles."
    },
    {
      "id": 81,
      "text": "They will make my work more enjoyable while giving me structure and the set of standards for myself are my team to adhere to."
    },
    {
      "id": 82,
      "text": "Finally, organizations like Amazon can only succeed by taking calculated risks."
    },
    {
      "id": 83,
      "text": "Because Amazon invests in new ideas, embraces opportunities and puts its customers at the core of its work,"
    },
    {
      "id": 84,
      "text": "I am confident this is a place I can build along and successful career."
    },
    {
      "id": 85,
      "text": "So that is another brilliant confident answer that will help you pass your Amazon area manager interview."
    },
    {
      "id": 86,
      "text": "Now don't go anywhere because I still have many more tips, questions and sample answers to give you."
    },
    {
      "id": 87,
      "text": "But when you're ready, you can click the link in the top right-hand corner of the video,"
    },
    {
      "id": 88,
      "text": "head straight through to my website, pass my interview.com,"
    },
    {
      "id": 89,
      "text": "and instantly download my 24 brilliant answers to difficult Amazon area manager interview questions."
    },
    {
      "id": 90,
      "text": "But here is the next question that I strongly recommend you prepare for."
    },
    {
      "id": 91,
      "text": "That question is, tell me about a time you improved a process or made a customer focused decision."
    },
    {
      "id": 92,
      "text": "Tip number one."
    },
    {
      "id": 93,
      "text": "Now the majority of your Amazon area manager interview will be focused on answering behavioral"
    },
    {
      "id": 94,
      "text": "interview questions that are centered on the 16 leadership principles."
    },
    {
      "id": 95,
      "text": "Tip number two, now when answering these challenging behavioral interview questions,"
    },
    {
      "id": 96,
      "text": "I strongly recommend you use the star method."
    },
    {
      "id": 97,
      "text": "Let me quickly explain what the star method is before I give you my brilliant example answer."
    },
    {
      "id": 98,
      "text": "The star method stands for situation, task, action and result."
    },
    {
      "id": 99,
      "text": "So you begin your answer and you outline the situation you were faced with."
    },
    {
      "id": 100,
      "text": "Next, you will give brief details about the task that needed your attention."
    },
    {
      "id": 101,
      "text": "You will then give in-depth details about the action you took to complete the task before"
    },
    {
      "id": 102,
      "text": "finally finishing your answer with the results following your actions and you should always"
    },
    {
      "id": 103,
      "text": "make sure the results are positive. So let's now move on and have a look at a brilliant example"
    },
    {
      "id": 104,
      "text": "answer to this question that uses the star method, situation, task, action and result."
    },
    {
      "id": 105,
      "text": "Tell me about a time you improved a process or made a customer focused decision."
    },
    {
      "id": 106,
      "text": "In my last job, I closely monitored customer reviews,"
    },
    {
      "id": 107,
      "text": "a noticed several negative comments citing a delay in order delivery."
    },
    {
      "id": 108,
      "text": "My task was to investigate this problem to ensure customer service standards did not deteriorate"
    },
    {
      "id": 109,
      "text": "further. I contacted the customers who had left negative comments to first apologize"
    },
    {
      "id": 110,
      "text": "and ask them questions about their experience with the company."
    },
    {
      "id": 111,
      "text": "They all informed me they had placed orders through our website,"
    },
    {
      "id": 112,
      "text": "but there had been an unacceptable delay in receiving their orders."
    },
    {
      "id": 113,
      "text": "After investigating the problem further, I established that one of the company's"
    },
    {
      "id": 114,
      "text": "suppliers was experiencing supply chain issues resulting in delivery delays."
    },
    {
      "id": 115,
      "text": "I decided to quickly source an alternative supplier who could offer improved terms for the company."
    },
    {
      "id": 116,
      "text": "After deciding to switch suppliers, excellent service standards resumed and all orders were delivered"
    },
    {
      "id": 117,
      "text": "promptly. So that is another really good answer that uses that star method of situation, task,"
    },
    {
      "id": 118,
      "text": "action and result. The next question I recommend you prepare for in advance of your Amazon"
    },
    {
      "id": 119,
      "text": "area manager interview is what's your leadership style? Tip number one. Now as an Amazon area manager,"
    },
    {
      "id": 120,
      "text": "you will be a leader who must direct control and motivate a team of people. So be sure to know"
    },
    {
      "id": 121,
      "text": "what your leadership style is before your interview and tip number two, there are several leadership"
    },
    {
      "id": 122,
      "text": "styles including Democratic or to-cratic where you tell people what you want doing and by when."
    },
    {
      "id": 123,
      "text": "Lacer Fair Leadership which is a relaxed leadership style, I personally do not think"
    },
    {
      "id": 124,
      "text": "Lacer Fair is a good leadership style for working at Amazon. A transformational leadership style"
    },
    {
      "id": 125,
      "text": "where you and your team embrace change and also a coaching style of leadership. So here is my"
    },
    {
      "id": 126,
      "text": "example answer. This is exactly how I would answer this difficult but common Amazon interview question."
    },
    {
      "id": 127,
      "text": "What's your leadership style? My leadership style is a combination of"
    },
    {
      "id": 128,
      "text": "or to-cratic transformational and coaching. When my team and I are up against tight deadlines,"
    },
    {
      "id": 129,
      "text": "I will be or to-cratic and provide clear and confident instructions on what needs doing and"
    },
    {
      "id": 130,
      "text": "by when. I am a transformational leader who believes in the importance of change. I will encourage"
    },
    {
      "id": 131,
      "text": "my team to embrace change positively and explain its benefits and finally I am a leader who"
    },
    {
      "id": 132,
      "text": "provides regular training and coaching to ensure my team members reach their full potential."
    },
    {
      "id": 133,
      "text": "So you can see how these answers will help you prepare fully for your Amazon area manager"
    },
    {
      "id": 134,
      "text": "interview that is a really good confident answer. Here is the next question."
    },
    {
      "id": 135,
      "text": "Describe a situation when you had to act quickly under pressure. Tip number one. Now this next"
    },
    {
      "id": 136,
      "text": "difficult Amazon area manager interview question is assessing the leadership principles of"
    },
    {
      "id": 137,
      "text": "bias for action and ownership. And tip number two, I recommend you give a specific situation"
    },
    {
      "id": 138,
      "text": "in which you took decisive action to achieve a positive outcome despite being under pressure."
    },
    {
      "id": 139,
      "text": "Again, make sure you use the star method situation, task action and result to structure your answer."
    },
    {
      "id": 140,
      "text": "So here is another brilliant top scoring example answer to help you pass your interview."
    },
    {
      "id": 141,
      "text": "Describe a situation when you had to act quickly under pressure. Here we go."
    },
    {
      "id": 142,
      "text": "In my last job and important client contacted me to say they were not renewing their contract with"
    },
    {
      "id": 143,
      "text": "they had received a better offer from one of our direct competitors. My task was to act quickly"
    },
    {
      "id": 144,
      "text": "to determine the best offer we could make to the client to retain their business."
    },
    {
      "id": 145,
      "text": "I asked the client to meet me that day to which they agreed. On the way to the meeting,"
    },
    {
      "id": 146,
      "text": "I assessed the terms of their current contract and created a list of questions I wanted to ask them."
    },
    {
      "id": 147,
      "text": "And anticipating what their answers might be, I drafted two improved contract offers that I felt"
    },
    {
      "id": 148,
      "text": "were in the best interests of the client and my employer. During the meeting, I asked the client"
    },
    {
      "id": 149,
      "text": "questions about their needs and listened carefully to their answers. At the end of the meeting,"
    },
    {
      "id": 150,
      "text": "I presented the client with a new and improved contract offer that met their needs. After considering"
    },
    {
      "id": 151,
      "text": "the new contract offer, they contacted me to say they would accept it which was a great result for"
    },
    {
      "id": 152,
      "text": "the company. So that is a really good example situation where you are under pressure and you have"
    },
    {
      "id": 153,
      "text": "to act quickly. You have prepared alternative contract offers and you have drafted up a set of"
    },
    {
      "id": 154,
      "text": "questions you will ask the client at the meeting. So you are taking decisive action to retain"
    },
    {
      "id": 155,
      "text": "the client's business. Here is the next question. This is another behavioral interview question."
    },
    {
      "id": 156,
      "text": "Tell me about a time when you found a simple solution to a complex problem. This question comes"
    },
    {
      "id": 157,
      "text": "up all the time during Amazon area manager interviews. Tip number one. So as an area manager for Amazon,"
    },
    {
      "id": 158,
      "text": "you will have to overcome challenging situations on a regular basis. So this next behavioral"
    },
    {
      "id": 159,
      "text": "question assesses your ability to act quickly to create solutions that ensure"
    },
    {
      "id": 160,
      "text": "Amazon's operations can continue successfully. And tip number two, give a specific situation where"
    },
    {
      "id": 161,
      "text": "you assess the situation that was causing problems for your employer before creating a simple solution."
    },
    {
      "id": 162,
      "text": "Here is another brilliant example answer. Again, the use is the star method. Situation,"
    },
    {
      "id": 163,
      "text": "task action and result. Tell me about a time when you found a simple solution to a complex"
    },
    {
      "id": 164,
      "text": "problem. Here we go. In my previous job, we had an ongoing problem with communication."
    },
    {
      "id": 165,
      "text": "Updates on projects and task delegation were becoming increasingly difficult as the company expanded."
    },
    {
      "id": 166,
      "text": "I decided to find a simple solution to this issue. After researching online for the best"
    },
    {
      "id": 167,
      "text": "workplace communication and productivity tools, I put together a short presentation on a tool called"
    },
    {
      "id": 168,
      "text": "Evernote. Evernote would empower managers and team members to keep everyone updated on task"
    },
    {
      "id": 169,
      "text": "and project progression. After watching my presentation, my manager agreed to its implementation"
    },
    {
      "id": 170,
      "text": "and within several weeks Evernote became a fundamental part of our workplace productivity scheduling"
    },
    {
      "id": 171,
      "text": "and task management. So that is another great answer that shows you take decisive action"
    },
    {
      "id": 172,
      "text": "to find a simple solution to a difficult problem. It's a really good example answer."
    },
    {
      "id": 173,
      "text": "Okay, now the next thing to do to accelerate your learning even further and make sure you are fully"
    },
    {
      "id": 174,
      "text": "prepared for your Amazon area manager interview is click the link in the top right-hand corner of the"
    },
    {
      "id": 175,
      "text": "video. Head straight through to my website, passmaintoview.com where you can instantly download"
    },
    {
      "id": 176,
      "text": "these slides plus my full set of 24 brilliant answers to Amazon area manager interview questions."
    },
    {
      "id": 177,
      "text": "This guide comes as a PDF document which means you can have everything in your inbox within"
    },
    {
      "id": 178,
      "text": "two minutes from now. Make sure you go through to that website, passmaintoview by clicking that"
    },
    {
      "id": 179,
      "text": "link because on the page, I have also given you three questions. I recommend you ask at the end of"
    },
    {
      "id": 180,
      "text": "your area manager interview. Also, please make sure you hit that subscribe button, give the video"
    },
    {
      "id": 181,
      "text": "alike and don't forget to connect with me on LinkedIn. I have put my LinkedIn link in the"
    },
    {
      "id": 182,
      "text": "description below the video. It is always an honor and a pleasure to connect with like-minded"
    },
    {
      "id": 183,
      "text": "professional such as yourself. Thank you very much for watching and for supporting my channel."
    },
    {
      "id": 184,
      "text": "I wish you all the very best for passing your Amazon area manager interview. Have a wonderful day."
    }
  ]
}