{
  "file": "X7FSCOmJtBg.wav",
  "text": " Tell me about time when you made a mistake. I don't make mistakes, so that situation would never happen. That is the worst possible answer to the interview question. Tell me about a time when you made a mistake and don't use this answer either to be honest working for my previous employer was a mistake. There was a toxic environment in the office and I couldn't wait to leave. So there's two really bad answers to that difficult behavioral interview question. Tell me about a time when you made a mistake. But how do you answer it without failing your job interview? Well, if you have an interview coming up soon for any role-all company, please make sure you stay tuned because I promise to help you be the standout candidates. And just for equally, if you're on you to the channel, please make sure you hit that subscribe button. I can then help you not just pass every job interview you ever attend. I can help you tune negotiate to salary and progress throughout your career. And please give the video a like because that tells me you find these tutorials useful. Thank you very much. Let's jump straight into the presentation. So to help you pass your job interview, I will cover the following three things during this tutorial. Number one, I will explain why the interviewer is asking you the behavioral interview question. Tell me about a time when you made a mistake. Now, if you understand why the question is being asked, it enables you to give the perfect answer. Number two, I will then tell you how to structure your answer to this interview question to get the highest scores possible. And then finally, number three, I will give you a brilliant example answer in a live interview. To the question, tell me about a time when you made a mistake that is guaranteed to impress the hiring manager. So why is the interviewer asking you the question, tell me about a time when you made a mistake. Well, they are asking you this question for two reasons. Reason number one is because they want to assess whether you are honest about any mistakes you have made. If you say that you have never made a mistake in your life, you are not being honest. We all make mistakes, but it is how you respond to the mistakes you make that is important. And reason number two, why they are asking you the question, tell me about a time when you made a mistake. It's because they want to hear that you took ownership of your mistake. You are apologise to for it if necessary and you then took positive steps to learn from the experience. So let me now tell you how to structure your answer to the interview question. Tell me about a time when you made a mistake and I will then give you a brilliant example answer in a live interview. So I strongly recommend you structure your answer to this and any other behavioral interview question by using the star technique. The star technique stands for situation, task, action and result. So first you start off your answer and you tell the interview at the situation you were faced with. You then briefly outline the task that needed doing. You then move on and give details about the action you took to achieve the task before finally telling the interviewer the results following your actions. So let me now give you a brilliant example answer in a live interview. To the question tell me about a time when you made a mistake. Here we go. Okay Richard, tell me about a time when you made a mistake. When I first started work in my previous role, my manager asked for a volunteer to complete an important time at sensitive task and I agreed to be that person. Now the task involved collecting 12 months worth of company sales figures which my manager needed for an important presentation she was going to give to the senior management team. When I started work on the task, I soon realized I had underestimated how long it was going to take me to complete it. Now because of my mistake, I had to stay behind late after working, chaining and commit extra hours to get the job finished on time. Moving forward, I made sure I never made the same mistake again. I considered carefully each task I was responsible for and I took the time to determine the exact amount of hours and resources it would take me to finish it. So the next thing to do, if you want to accelerate your learning even further and pass your interview, click that link in the top right-hand corner of the video, head through to my website passmaintivue.com and you can download instantly my full set of 27. Tell me about a time, behavioral interview questions and top scoring answers. It's a fantastic resource and it's guaranteed to put you ahead of the competition at your fourth coming interview. Finally, don't forget to hit that subscribe button. I can then help you pass every job interview you ever attend and also progress throughout your career. Please give the video a like and don't forget to connect with me on LinkedIn. I put my LinkedIn link in the description below the video and it is always an honour and a pleasure to connect with like-minded professionals such as yourself. Thank you so much for watching and I wish you all the best. For passing your job interview, have a great day.",
  "segments": [
    {
      "id": 0,
      "text": "Tell me about time when you made a mistake."
    },
    {
      "id": 1,
      "text": "I don't make mistakes, so that situation would never happen."
    },
    {
      "id": 2,
      "text": "That is the worst possible answer to the interview question."
    },
    {
      "id": 3,
      "text": "Tell me about a time when you made a mistake and don't use this answer either"
    },
    {
      "id": 4,
      "text": "to be honest working for my previous employer was a mistake."
    },
    {
      "id": 5,
      "text": "There was a toxic environment in the office and I couldn't wait to leave."
    },
    {
      "id": 6,
      "text": "So there's two really bad answers to that difficult behavioral interview question."
    },
    {
      "id": 7,
      "text": "Tell me about a time when you made a mistake."
    },
    {
      "id": 8,
      "text": "But how do you answer it without failing your job interview?"
    },
    {
      "id": 9,
      "text": "Well, if you have an interview coming up soon for any role-all company,"
    },
    {
      "id": 10,
      "text": "please make sure you stay tuned because I promise to help you be the standout candidates."
    },
    {
      "id": 11,
      "text": "And just for equally, if you're on you to the channel, please make sure you hit that subscribe button."
    },
    {
      "id": 12,
      "text": "I can then help you not just pass every job interview you ever attend."
    },
    {
      "id": 13,
      "text": "I can help you tune negotiate to salary and progress throughout your career."
    },
    {
      "id": 14,
      "text": "And please give the video a like because that tells me you find these tutorials useful."
    },
    {
      "id": 15,
      "text": "Thank you very much."
    },
    {
      "id": 16,
      "text": "Let's jump straight into the presentation."
    },
    {
      "id": 17,
      "text": "So to help you pass your job interview, I will cover the following three things during this tutorial."
    },
    {
      "id": 18,
      "text": "Number one, I will explain why the interviewer is asking you the behavioral interview question."
    },
    {
      "id": 19,
      "text": "Tell me about a time when you made a mistake."
    },
    {
      "id": 20,
      "text": "Now, if you understand why the question is being asked, it enables you to give the perfect answer."
    },
    {
      "id": 21,
      "text": "Number two, I will then tell you how to structure your answer to this interview question"
    },
    {
      "id": 22,
      "text": "to get the highest scores possible."
    },
    {
      "id": 23,
      "text": "And then finally, number three, I will give you a brilliant example answer in a live interview."
    },
    {
      "id": 24,
      "text": "To the question, tell me about a time when you made a mistake that is guaranteed to impress"
    },
    {
      "id": 25,
      "text": "the hiring manager."
    },
    {
      "id": 26,
      "text": "So why is the interviewer asking you the question, tell me about a time when you made a mistake."
    },
    {
      "id": 27,
      "text": "Well, they are asking you this question for two reasons."
    },
    {
      "id": 28,
      "text": "Reason number one is because they want to assess whether you are honest about any mistakes you have made."
    },
    {
      "id": 29,
      "text": "If you say that you have never made a mistake in your life, you are not being honest."
    },
    {
      "id": 30,
      "text": "We all make mistakes, but it is how you respond to the mistakes you make that is important."
    },
    {
      "id": 31,
      "text": "And reason number two, why they are asking you the question, tell me about a time when you made a mistake."
    },
    {
      "id": 32,
      "text": "It's because they want to hear that you took ownership of your mistake."
    },
    {
      "id": 33,
      "text": "You are apologise to for it if necessary and you then took positive steps to learn from the experience."
    },
    {
      "id": 34,
      "text": "So let me now tell you how to structure your answer to the interview question."
    },
    {
      "id": 35,
      "text": "Tell me about a time when you made a mistake and I will then give you a brilliant example answer"
    },
    {
      "id": 36,
      "text": "in a live interview."
    },
    {
      "id": 37,
      "text": "So I strongly recommend you structure your answer to this and any other behavioral interview"
    },
    {
      "id": 38,
      "text": "question by using the star technique."
    },
    {
      "id": 39,
      "text": "The star technique stands for situation, task, action and result."
    },
    {
      "id": 40,
      "text": "So first you start off your answer and you tell the interview at the situation you were faced with."
    },
    {
      "id": 41,
      "text": "You then briefly outline the task that needed doing."
    },
    {
      "id": 42,
      "text": "You then move on and give details about the action you took to achieve the task before finally"
    },
    {
      "id": 43,
      "text": "telling the interviewer the results following your actions."
    },
    {
      "id": 44,
      "text": "So let me now give you a brilliant example answer in a live interview."
    },
    {
      "id": 45,
      "text": "To the question tell me about a time when you made a mistake."
    },
    {
      "id": 46,
      "text": "Here we go."
    },
    {
      "id": 47,
      "text": "Okay Richard, tell me about a time when you made a mistake."
    },
    {
      "id": 48,
      "text": "When I first started work in my previous role, my manager asked for a volunteer to complete"
    },
    {
      "id": 49,
      "text": "an important time at sensitive task and I agreed to be that person."
    },
    {
      "id": 50,
      "text": "Now the task involved collecting 12 months worth of company sales figures which my manager needed"
    },
    {
      "id": 51,
      "text": "for an important presentation she was going to give to the senior management team."
    },
    {
      "id": 52,
      "text": "When I started work on the task, I soon realized I had underestimated how long it was going to"
    },
    {
      "id": 53,
      "text": "take me to complete it."
    },
    {
      "id": 54,
      "text": "Now because of my mistake, I had to stay behind late after working,"
    },
    {
      "id": 55,
      "text": "chaining and commit extra hours to get the job finished on time."
    },
    {
      "id": 56,
      "text": "Moving forward, I made sure I never made the same mistake again."
    },
    {
      "id": 57,
      "text": "I considered carefully each task I was responsible for and I took the time to determine"
    },
    {
      "id": 58,
      "text": "the exact amount of hours and resources it would take me to finish it."
    },
    {
      "id": 59,
      "text": "So the next thing to do, if you want to accelerate your learning even further and pass your"
    },
    {
      "id": 60,
      "text": "interview, click that link in the top right-hand corner of the video, head through to my website"
    },
    {
      "id": 61,
      "text": "passmaintivue.com and you can download instantly my full set of 27."
    },
    {
      "id": 62,
      "text": "Tell me about a time, behavioral interview questions and top scoring answers."
    },
    {
      "id": 63,
      "text": "It's a fantastic resource and it's guaranteed to put you ahead of the competition"
    },
    {
      "id": 64,
      "text": "at your fourth coming interview."
    },
    {
      "id": 65,
      "text": "Finally, don't forget to hit that subscribe button."
    },
    {
      "id": 66,
      "text": "I can then help you pass every job interview you ever attend and also progress"
    },
    {
      "id": 67,
      "text": "throughout your career."
    },
    {
      "id": 68,
      "text": "Please give the video a like and don't forget to connect with me on LinkedIn."
    },
    {
      "id": 69,
      "text": "I put my LinkedIn link in the description below the video and it is always an honour and"
    },
    {
      "id": 70,
      "text": "a pleasure to connect with like-minded professionals such as yourself."
    },
    {
      "id": 71,
      "text": "Thank you so much for watching and I wish you all the best."
    },
    {
      "id": 72,
      "text": "For passing your job interview, have a great day."
    }
  ]
}