{
  "file": "Y1IrwVZO8Bc.wav",
  "text": " Describe a time when you made a mistake. What did you learn from that experience? That's a behavioral interview question. But what's the best way to answer? Welcome to the interview game, by indeed. Where we show you how and how not to answer interview questions. The hiring manager is dialing in. Yes! Hi Bill. I understand you need to hire a new bartender. I sure do. I run a bart downtown and I need someone who's experienced in a real problem solve. Got it. So I'll ask some behavioral based questions. Then I can see how each candidate's past experience relates to the role you're hiring for. Strong answers should follow this star format. Candidates! Are you ready? Yes! Jessica, you're up first. Tell us about a time when you made a mistake and what you learned from it. In my last job, I was responsible for processing returns. One customer ordered the same outfit in a bunch of different sizes. She kept one and returned the rest. But I credited too much money back into her account. My manager was pretty frustrated. The whole situation really turned me off from working in online sales. Which is one of the reasons I want to work here. Thanks Jessica. Next, we have Carlos. Look, I bartended seven years. I really don't make mistakes anymore. I mean, I did way back when I was younger. I've owned up a few cags. I feel for a couple of counterfeit 20s but it's ancient history. Look, if I'm your new bartender, you can be confident that you're going to have a professional back there, someone who's seen it all. Who doesn't make mistakes. Thank you, Carlos. Hi, Sandra. You're up. Well, I went on my first catering jobs. I encorched all the wine before we started serving. But then most people drink fear. Okay. You know, this is an expense in the steak. So before the next party, I asked if I could shout on my boss that she set up. And I made a checklist so I would know what tasks to do in the right order. I still use that task. It probably would have played here. Thank you, Sandra. Jessica shared an honest mistake. But then what? Her answer fell flat because she didn't share what she learned. Carlos named two mistakes. But then he dismissed them. Maybe he could have shared how we mastered correctly tapping a keg or spying a fake 20. That would have been more effective. I thought Sandra's answer was great. She quickly explained the mistake, but spent most of her response talking about the stuff she took to overcome it. She even connect what she learned to this new role. Next up, round two. If you want to take your job search to the next level, click the link below and download the Indeed Mobile app. Tell me about a time you dealt with a difficult or tough situation at work. I think the toughest situation is when you don't know how to do something. See, I'm the type of person who likes to be in control. So I want to make sure that I know how to do every single task. When I first started at my sales job, I had to ask a million questions. For some people, that's hard, but not me. I'm not afraid to ask for help. Carlos, you're up. Just last month, one of my regulars had too much to drink. Now, if I serve in the toxicated patron who gets into an accident, I'm liable. But I had to stop serving him in a way that wouldn't escalate the situation. So I closed his tab. I got him a glass of water. And then I privately told him that he could stick around while he sobered up. Eventually I called a cab. I maintained his dignity. And I kept everyone safe because when you work at a bar, customer safety is a big part of customer service. I like what I'm hearing. Last but not least, Sandra. My first catering boss told me to keep serving drinks no matter how intoxicated someone gets. But I just didn't sit right with me. I once told this woman that she had enough to drink, but she just got her friend and to get her a drink instead. So since then, I figure the mangle to keep the customer happy. I mean, so if someone gets out of hand at your bar, I would ask the balancer to throw them out. There's the balancer, right? Right? That's a problem. I love Jessica's confidence. But she should share a specific example. The star method would help. Sandra shared a specific story, but her action didn't improve the situation. It just didn't seem like she was taking ownership. Carlos's answer had all four elements of the star method. When he said, I maintained his dignity and kept everyone safe, I understood exactly how he made a difficult situation better. It's time for the last round. Final question, we'll start off with Jessica. Explain a time when you had to multitask and how you handled it. So when I'm out with my friends, I'm always the person taking all our drink orders, just like a bartender. I go over everything at everyone once and I repeat it out loud to myself at least three times. When I get to the bar, I order draft beers first, then the mixed drinks. It gets confusing when people change their minds, though. Then you have to fix mistake and still keep track of everything. Okay, very cool. Carlos, you're up. Just last month, I had two of my barbex and a way to call out sick. I was taking orders. I was getting ice, making drinks, stocking. It was impossible. Multitasking, it can be really tough in in those situations. No one wins. Thanks Carlos. Sandra. Well, when you bartend at weddings, everyone wants to get a drink at the same time. During my first few gigs, I came up with three rules, number one. Always finish every order before taking the next one. Number two, to reduce the flow of new orders, I only make eye contact when I'm ready to take new orders. And three. I trust my system. So I'm polite, but firm if I'm getting counted. Since I started putting them into practice, I'm more calm. I make fear mistakes and have more fun catering weddings. Well done. Jessica's answer could have had all the star elements, but her action wasn't clear. And since she didn't share a clear action, she couldn't share its results. Carlos was specific and he did explain how we jumped in to save the day, but did the situation improve? Sandra gave context and clearly explained the challenge. Bill? I think we're ready for your decision. These behavioral questions really help me get a sense of each candidate's past experiences. One contestant, consistently set the scene, told us the challenge, shared what they tried and explained what happened as a result. Sandra is the strongest candidate. That means Sandra moves forward in the interview process. Remember, if you're asked to behave your whole question at your next interview, apply the star method. It helps connect your past experience to the role you're applying for it. To those of you watching at home, don't forget to like and subscribe for more videos like this on our channel.",
  "segments": [
    {
      "id": 0,
      "text": "Describe a time when you made a mistake."
    },
    {
      "id": 1,
      "text": "What did you learn from that experience?"
    },
    {
      "id": 2,
      "text": "That's a behavioral interview question."
    },
    {
      "id": 3,
      "text": "But what's the best way to answer?"
    },
    {
      "id": 4,
      "text": "Welcome to the interview game, by indeed."
    },
    {
      "id": 5,
      "text": "Where we show you how and how not to answer interview questions."
    },
    {
      "id": 6,
      "text": "The hiring manager is dialing in."
    },
    {
      "id": 7,
      "text": "Yes!"
    },
    {
      "id": 8,
      "text": "Hi Bill."
    },
    {
      "id": 9,
      "text": "I understand you need to hire a new bartender."
    },
    {
      "id": 10,
      "text": "I sure do."
    },
    {
      "id": 11,
      "text": "I run a bart downtown and I need someone who's experienced in a real problem solve."
    },
    {
      "id": 12,
      "text": "Got it."
    },
    {
      "id": 13,
      "text": "So I'll ask some behavioral based questions."
    },
    {
      "id": 14,
      "text": "Then I can see how each candidate's past experience relates to the role you're hiring for."
    },
    {
      "id": 15,
      "text": "Strong answers should follow this star format."
    },
    {
      "id": 16,
      "text": "Candidates!"
    },
    {
      "id": 17,
      "text": "Are you ready?"
    },
    {
      "id": 18,
      "text": "Yes!"
    },
    {
      "id": 19,
      "text": "Jessica, you're up first."
    },
    {
      "id": 20,
      "text": "Tell us about a time when you made a mistake and what you learned from it."
    },
    {
      "id": 21,
      "text": "In my last job, I was responsible for processing returns."
    },
    {
      "id": 22,
      "text": "One customer ordered the same outfit in a bunch of different sizes."
    },
    {
      "id": 23,
      "text": "She kept one and returned the rest."
    },
    {
      "id": 24,
      "text": "But I credited too much money back into her account."
    },
    {
      "id": 25,
      "text": "My manager was pretty frustrated."
    },
    {
      "id": 26,
      "text": "The whole situation really turned me off from working in online sales."
    },
    {
      "id": 27,
      "text": "Which is one of the reasons I want to work here."
    },
    {
      "id": 28,
      "text": "Thanks Jessica."
    },
    {
      "id": 29,
      "text": "Next, we have Carlos."
    },
    {
      "id": 30,
      "text": "Look, I bartended seven years."
    },
    {
      "id": 31,
      "text": "I really don't make mistakes anymore."
    },
    {
      "id": 32,
      "text": "I mean, I did way back when I was younger."
    },
    {
      "id": 33,
      "text": "I've owned up a few cags."
    },
    {
      "id": 34,
      "text": "I feel for a couple of counterfeit 20s but it's ancient history."
    },
    {
      "id": 35,
      "text": "Look, if I'm your new bartender, you can be confident that you're going to have a professional"
    },
    {
      "id": 36,
      "text": "back there, someone who's seen it all."
    },
    {
      "id": 37,
      "text": "Who doesn't make mistakes."
    },
    {
      "id": 38,
      "text": "Thank you, Carlos."
    },
    {
      "id": 39,
      "text": "Hi, Sandra."
    },
    {
      "id": 40,
      "text": "You're up."
    },
    {
      "id": 41,
      "text": "Well, I went on my first catering jobs."
    },
    {
      "id": 42,
      "text": "I encorched all the wine before we started serving."
    },
    {
      "id": 43,
      "text": "But then most people drink fear."
    },
    {
      "id": 44,
      "text": "Okay."
    },
    {
      "id": 45,
      "text": "You know, this is an expense in the steak."
    },
    {
      "id": 46,
      "text": "So before the next party, I asked if I could shout on my boss that she set up."
    },
    {
      "id": 47,
      "text": "And I made a checklist so I would know what tasks to do in the right order."
    },
    {
      "id": 48,
      "text": "I still use that task."
    },
    {
      "id": 49,
      "text": "It probably would have played here."
    },
    {
      "id": 50,
      "text": "Thank you, Sandra."
    },
    {
      "id": 51,
      "text": "Jessica shared an honest mistake."
    },
    {
      "id": 52,
      "text": "But then what?"
    },
    {
      "id": 53,
      "text": "Her answer fell flat because she didn't share what she learned."
    },
    {
      "id": 54,
      "text": "Carlos named two mistakes."
    },
    {
      "id": 55,
      "text": "But then he dismissed them."
    },
    {
      "id": 56,
      "text": "Maybe he could have shared how we mastered correctly tapping a keg or spying a fake 20."
    },
    {
      "id": 57,
      "text": "That would have been more effective."
    },
    {
      "id": 58,
      "text": "I thought Sandra's answer was great."
    },
    {
      "id": 59,
      "text": "She quickly explained the mistake, but spent most of her response talking about the"
    },
    {
      "id": 60,
      "text": "stuff she took to overcome it."
    },
    {
      "id": 61,
      "text": "She even connect what she learned to this new role."
    },
    {
      "id": 62,
      "text": "Next up, round two."
    },
    {
      "id": 63,
      "text": "If you want to take your job search to the next level, click the link below and download"
    },
    {
      "id": 64,
      "text": "the Indeed Mobile app."
    },
    {
      "id": 65,
      "text": "Tell me about a time you dealt with a difficult or tough situation at work."
    },
    {
      "id": 66,
      "text": "I think the toughest situation is when you don't know how to do something."
    },
    {
      "id": 67,
      "text": "See, I'm the type of person who likes to be in control."
    },
    {
      "id": 68,
      "text": "So I want to make sure that I know how to do every single task."
    },
    {
      "id": 69,
      "text": "When I first started at my sales job, I had to ask a million questions."
    },
    {
      "id": 70,
      "text": "For some people, that's hard, but not me."
    },
    {
      "id": 71,
      "text": "I'm not afraid to ask for help."
    },
    {
      "id": 72,
      "text": "Carlos, you're up."
    },
    {
      "id": 73,
      "text": "Just last month, one of my regulars had too much to drink."
    },
    {
      "id": 74,
      "text": "Now, if I serve in the toxicated patron who gets into an accident, I'm liable."
    },
    {
      "id": 75,
      "text": "But I had to stop serving him in a way that wouldn't escalate the situation."
    },
    {
      "id": 76,
      "text": "So I closed his tab."
    },
    {
      "id": 77,
      "text": "I got him a glass of water."
    },
    {
      "id": 78,
      "text": "And then I privately told him that he could stick around while he sobered up."
    },
    {
      "id": 79,
      "text": "Eventually I called a cab."
    },
    {
      "id": 80,
      "text": "I maintained his dignity."
    },
    {
      "id": 81,
      "text": "And I kept everyone safe because when you work at a bar, customer safety is a big part"
    },
    {
      "id": 82,
      "text": "of customer service."
    },
    {
      "id": 83,
      "text": "I like what I'm hearing."
    },
    {
      "id": 84,
      "text": "Last but not least, Sandra."
    },
    {
      "id": 85,
      "text": "My first catering boss told me to keep serving drinks no matter how intoxicated someone"
    },
    {
      "id": 86,
      "text": "gets."
    },
    {
      "id": 87,
      "text": "But I just didn't sit right with me."
    },
    {
      "id": 88,
      "text": "I once told this woman that she had enough to drink, but she just got her friend"
    },
    {
      "id": 89,
      "text": "and to get her a drink instead."
    },
    {
      "id": 90,
      "text": "So since then, I figure the mangle to keep the customer happy."
    },
    {
      "id": 91,
      "text": "I mean, so if someone gets out of hand at your bar, I would ask the balancer to throw"
    },
    {
      "id": 92,
      "text": "them out."
    },
    {
      "id": 93,
      "text": "There's the balancer, right?"
    },
    {
      "id": 94,
      "text": "Right?"
    },
    {
      "id": 95,
      "text": "That's a problem."
    },
    {
      "id": 96,
      "text": "I love Jessica's confidence."
    },
    {
      "id": 97,
      "text": "But she should share a specific example."
    },
    {
      "id": 98,
      "text": "The star method would help."
    },
    {
      "id": 99,
      "text": "Sandra shared a specific story, but her action didn't improve the situation."
    },
    {
      "id": 100,
      "text": "It just didn't seem like she was taking ownership."
    },
    {
      "id": 101,
      "text": "Carlos's answer had all four elements of the star method."
    },
    {
      "id": 102,
      "text": "When he said, I maintained his dignity and kept everyone safe, I understood exactly how"
    },
    {
      "id": 103,
      "text": "he made a difficult situation better."
    },
    {
      "id": 104,
      "text": "It's time for the last round."
    },
    {
      "id": 105,
      "text": "Final question, we'll start off with Jessica."
    },
    {
      "id": 106,
      "text": "Explain a time when you had to multitask and how you handled it."
    },
    {
      "id": 107,
      "text": "So when I'm out with my friends, I'm always the person taking all our drink orders,"
    },
    {
      "id": 108,
      "text": "just like a bartender."
    },
    {
      "id": 109,
      "text": "I go over everything at everyone once and I repeat it out loud to myself at least three"
    },
    {
      "id": 110,
      "text": "times."
    },
    {
      "id": 111,
      "text": "When I get to the bar, I order draft beers first, then the mixed drinks."
    },
    {
      "id": 112,
      "text": "It gets confusing when people change their minds, though."
    },
    {
      "id": 113,
      "text": "Then you have to fix mistake and still keep track of everything."
    },
    {
      "id": 114,
      "text": "Okay, very cool."
    },
    {
      "id": 115,
      "text": "Carlos, you're up."
    },
    {
      "id": 116,
      "text": "Just last month, I had two of my barbex and a way to call out sick."
    },
    {
      "id": 117,
      "text": "I was taking orders."
    },
    {
      "id": 118,
      "text": "I was getting ice, making drinks, stocking."
    },
    {
      "id": 119,
      "text": "It was impossible."
    },
    {
      "id": 120,
      "text": "Multitasking, it can be really tough in in those situations."
    },
    {
      "id": 121,
      "text": "No one wins."
    },
    {
      "id": 122,
      "text": "Thanks Carlos."
    },
    {
      "id": 123,
      "text": "Sandra."
    },
    {
      "id": 124,
      "text": "Well, when you bartend at weddings, everyone wants to get a drink at the same time."
    },
    {
      "id": 125,
      "text": "During my first few gigs, I came up with three rules, number one."
    },
    {
      "id": 126,
      "text": "Always finish every order before taking the next one."
    },
    {
      "id": 127,
      "text": "Number two, to reduce the flow of new orders, I only make eye contact when I'm ready"
    },
    {
      "id": 128,
      "text": "to take new orders."
    },
    {
      "id": 129,
      "text": "And three."
    },
    {
      "id": 130,
      "text": "I trust my system."
    },
    {
      "id": 131,
      "text": "So I'm polite, but firm if I'm getting counted."
    },
    {
      "id": 132,
      "text": "Since I started putting them into practice, I'm more calm."
    },
    {
      "id": 133,
      "text": "I make fear mistakes and have more fun catering weddings."
    },
    {
      "id": 134,
      "text": "Well done."
    },
    {
      "id": 135,
      "text": "Jessica's answer could have had all the star elements, but her action wasn't clear."
    },
    {
      "id": 136,
      "text": "And since she didn't share a clear action, she couldn't share its results."
    },
    {
      "id": 137,
      "text": "Carlos was specific and he did explain how we jumped in to save the day, but did the"
    },
    {
      "id": 138,
      "text": "situation improve?"
    },
    {
      "id": 139,
      "text": "Sandra gave context and clearly explained the challenge."
    },
    {
      "id": 140,
      "text": "Bill?"
    },
    {
      "id": 141,
      "text": "I think we're ready for your decision."
    },
    {
      "id": 142,
      "text": "These behavioral questions really help me get a sense of each candidate's past experiences."
    },
    {
      "id": 143,
      "text": "One contestant, consistently set the scene, told us the challenge, shared what they"
    },
    {
      "id": 144,
      "text": "tried and explained what happened as a result."
    },
    {
      "id": 145,
      "text": "Sandra is the strongest candidate."
    },
    {
      "id": 146,
      "text": "That means Sandra moves forward in the interview process."
    },
    {
      "id": 147,
      "text": "Remember, if you're asked to behave your whole question at your next interview, apply the"
    },
    {
      "id": 148,
      "text": "star method."
    },
    {
      "id": 149,
      "text": "It helps connect your past experience to the role you're applying for it."
    },
    {
      "id": 150,
      "text": "To those of you watching at home, don't forget to like and subscribe for more videos like"
    },
    {
      "id": 151,
      "text": "this on our channel."
    }
  ]
}