{
  "file": "zbSiex37Nzo.wav",
  "text": " In this video, I am going to teach you how to pass an Amazon interview. In a second, I will undertake a live Amazon job interview to teach you how to answer the type of questions you will have to answer in your own Amazon interview. Therefore, if you have an Amazon interview coming up soon for any job role, stay tuned because I will help you pass at the first attempt. And just for a quickly, please tell me the name of the Amazon interview you have coming up in the comments section below the video and I will give you some additional tips to help you pass. And make sure you hit that subscribe button and give the video a like because that really does motivate me to create more great content for you. Thank you very much indeed. Okay, here I am in that live Amazon interview about to give some top scoring answers. Once the interview is finished, I will then give you the scripted answers to write down. Here we go. Welcome to NT. Please tell me about yourself. Thank you for this opportunity. I have always been passionate about combining innovation with customer centricity. And that's why I'm excited about the prospect of working for Amazon. My skills, qualities and work ethic are a great match for your leadership principles. In my previous role, I worked on a team that successfully launched the game-changing product by embodying the think big principle. We identified emerging market trends and then created a brilliant product that gave the company an excellent return on their investment. Throughout my career, I've consistently exhibited ownership by taking responsibility for both successes and setbacks. For example, when we lost two team members during a critical deadline project, I stepped up, rallied the team, and redistributed tasks to ensure we delivered the project with uncompromising quality. I'm genuinely excited about the opportunity to contribute to Amazon's relentless pursuit of satisfaction and innovation and believe my commitment to your leadership principles will enable me to thrive in this dynamic environment, and I look forward to sharing further details in the interview as to my suitability for this position. Why do you want to work for Amazon? It is highly valued and building a long-term career at Amazon has always been my number one goal. Amazon has long been the market leader in numerous industries. This tells me Amazon is an organisation that is continually progressing delivers world-class products and services and provides customer service that outperforms its competitors. I will be pushed and challenged in my work at Amazon and my ideas will be valued and listened to. I want to work for Amazon because the leadership principles are a set of values and standards I genuinely believe in, and the inclusive workplace culture means there is opportunity for everyone. Tell me about a tie you demonstrated, one of Amazon's leadership principles at work. The following example is based on the leadership principle of customer obsession. A team member had failed to contact a customer when they had contacted the company to complain about a faulty product. The customer was understandably annoyed and they had left a negative review online. It was my task to turn around their experience, result the complaint fully and retain their customer. I contacted the customer immediately, apologized sincerely, and told them I would feel the same as them if the situation had happened to me. I gave the customer time to speak about their experience. I then explained what I was going to do to put things right after I had asked them questions to gain full clarity of the issue. I told the customer I would contact them within the next 24 hours after I had concluded my investigation. After I had resolved the customers complaint and issued them with a new product, I informed my manager about the situation so they could provide remedial training to the staff member who had let the customer down. Tell me about a tie when you found a simple solution to a challenging problem. In my previous job, we had an ongoing problem with communication. Update some projects and task delegation were becoming increasingly difficult as the company expanded. So I decided to find a simple solution to this difficult problem. After researching online for the best workplace communication and productivity tools, I put together a short presentation on a software tool called Evernote. Evernote would empower managers and team members to keep everyone updated on task and project progression. After watching my presentation, my manager agreed to its implementation. Within several weeks, Evernote became a fundamental part of our workplace productivity, virtual and task management and communication improved significantly as a result. Tell me about a time when you were able to influence change in an organisation by only asking questions. In my last job, I attended a meeting to discuss the environmental impact our company was having. I had several ideas for making improvements. It was my task to influence a positive change by asking three specific questions which I had already prepared. The questions I asked were, have we considered how much waste we were generating? Do we think we could be more environmentally friendly in our office practices and have we ever considered implementing a recycling program? The three questions resulted in a healthy debate. I then presented a recycling idea to my manager and she agreed it was a really positive step forward. After my idea was implemented, we reduced company waste by 75% and everyone in the company adopted a more responsible approach to waste. Why should we hire you to work at Amazon? You should hire me because I am deeply committed to the principle of customer obsession. Throughout my career, I have prioritised customer centricity consistently striving to meet their needs. Additionally, you should hire me because of my unwavering commitment to ownership, which means I take full responsibility for my work and difficult challenges. I will embrace Amazon's culture of innovation and simplification through a proactive approach to my work and actively seek ways to improve processes. My insistence on the highest standards and my ability to think big align perfectly with Amazon's pursuit of excellence. Finally, you should hire me because my deep alignment with Amazon's 16 leadership principles makes me an ideal candidate to contribute to the organisations on going growth and success. OK, in this next section of the training video, I will give you those brilliant top scoring answers to write down to help you prepare for your own Amazon interview. If at any point you want to simply download all of the answers, you can click that link at any time. Here we go. OK, so the first question I was asked during my practice Amazon interview was, tell me about yourself. Here is that brilliant example answer I gave. Tell me about yourself. Thank you for this opportunity. I have always been passionate about combining innovation with customer centricity and that's why I'm excited about the prospect of working for Amazon. My skills, qualities and work ethic are a great match for your leadership principles. In my previous role, I worked on a team that successfully launched a game-changing product by embodying the think big principle. We identified emerging market trends and then created a brilliant product that gave the company an excellent return on their investment. Throughout my career, I've consistently exhibited ownership by taking responsibility for both successes and setbacks. For example, when we lost two team members during a critical deadline project, I stepped up, rallied the team, and redistributed tasks to ensure we delivered the project with uncompromising quality. I'm genuinely excited about the opportunity to contribute to Amazon's relentless pursuit of satisfaction and innovation and believe my commitment to your leadership principles will enable me to thrive in this dynamic environment. I look forward to sharing further details in the interview as to my suitability for this position. That is a brilliant answer that you can use when preparing for your own Amazon interview. Don't forget, at any stage, you can click the link in the top right-hand corner of the video, head straight through to my website, pastmaintevue.com, and download all of the answers. So the second question I was asked at my practice Amazon interview was, why do you want to work for Amazon? Here is that brilliant example answer I gave. Getting hired and building a long-term career at Amazon has always been my number one goal. Amazon has long been the market leader in numerous industries. This tells me Amazon is an organisation that is continually progressing, delivers world-class products and services and provides customer service that outperforms its competitors. I will be pushed and challenged in my work at Amazon and my ideas will be valued and listened to. I want to work for Amazon because the leadership principles are a set of values and standards I genuinely believe in and the inclusive workplace culture means there is opportunity for everyone. I love that answer because you are talking about how great Amazon is in respect of customer service that means it outperforms its competitors and you are also saying at the start that you want to build a long-term career at Amazon. That's a really strong answer. Again you can use it when preparing for your own Amazon interview. The next question was, what is called a behavioral interview question? That question was, tell me about a time you demonstrated one of Amazon's leadership principles at work. Therefore you have to learn and understand Amazon's 16 leadership principles in order to answer this correctly. Now here is that great answer I gave. The following example is based on the leadership principle of customer obsession. The team member had failed to respond to a customer when they had contacted the company to complain about a faulty product. The customer was understandably annoyed and they had left a negative review online. It was my task to turn around their experience, resolve the complaint fully and then retain their custom. I contacted the customer immediately, apologized sincerely and told them I would feel the same as them if the situation had happened to me. I gave the customer time to speak about their experience. Then explained what I was going to do to put things right after I had asked them questions to gain full clarity of the issue. I told the customer I would contact them within the next 24 hours after I had concluded my investigation. After I'd resolved the customers complaint and issued them with a new product, I informed my manager about the situation so they could provide remedial training to the staff member who had let the customer down. That is a really good example answer where I am talking about a specific situation I had previously been in where I demonstrated the leadership principle of customer obsession. Another really good tip for answering the Amazon leadership principles, behavioral questions, is to make sure you use a start technique when responding to those questions. So start stands for situation task action and result. You give details of the situation you were in. You then tell the interviewer the task that needed doing. You then give in depth details about the action you took to achieve the task. And then finally, you tell the interviewer the results following your actions. I'll make sure you use a start technique when answering the Amazon behavioral interview questions. Now the next question I had to answer in my Amazon practice interview was, tell me about a time when you found a simple solution to a challenging problem. Here is that brilliant example answer I gave. In my previous job we had an ongoing problem with communication. I ate some projects and task delegation were becoming increasingly difficult as the company expanded. So I decided to find a simple solution to this difficult problem. After researching online for the best workplace communication and productivity tools, I put together a short presentation on a software tool called Evernote. Evernote would empower managers and team members to keep everyone updated on task and project progression. After watching my presentation, my manager agreed to its implementation. Within several weeks, Evernote became a fundamental part of our workplace productivity schedule and task management and communication improved significantly as a result. So that is another really good answer that's going to help you prepare fully for your Amazon interview. Now the next question is another Amazon behavioral interview question that is focused on how you have previously demonstrated the leadership principles. This question was, tell me about a time when you were able to influence change in an organisation by only asking questions. This is a really difficult one. But here's that brilliant answer I gave. In my last job, I attended a meeting to discuss the environmental impact our company was having. I had several ideas for making improvements. It was my task to influence a positive change by asking three specific questions which I had already prepared. The questions I asked were, have we considered how much waste we were generating? Do we think we could be more environmentally friendly in our office practices and have we ever considered implementing a recycling program? The three questions resulted in a healthy debate. I then presented a recycling idea to my manager and she agreed it was a positive step forward. Now after my idea was implemented, we reduced company waste by 75% and everyone in the company adopted a more responsible approach to waste. That's a great example situation where I was in a team meeting asked three specific situations which then resulted in a healthy conversation and positive changes to the organisation's working practices. Now the next question was, why should we hire you to work at Amazon? Here is that great in-depth answer I gave. You should hire me because I am deeply committed to the principle of customer obsession. Throughout my career, I have prioritised customer centricity consistently striving to meet their needs. Additionally, you should hire me because of my unwavering commitment to ownership, which means I take full responsibility for my work and difficult challenges. I will embrace Amazon's culture of innovation and simplification through a proactive approach to my work and actively seek ways to improve your processes. My insistence on the highest standards and my ability to think big align perfectly with Amazon's pursuit of excellence. Finally, you should hire me because my deep alignment with Amazon's 16 leadership principles makes me an ideal candidate to contribute to the organisation's ongoing growth and success. That's a great answer because it's in-depth. You are also talking about the leadership principles which you are going to have to learn and understand before you attend your Amazon interview. In the description below the video, I have provided you with more links to great training videos right here on YouTube that will help you understand those 16 leadership principles and answer more types of questions that you will encounter during your Amazon interview. So don't forget to check out that links. The next thing to do to accelerate your learning even further is make sure you click that link right now in the top right-hand corner of the video. Head straight through to my website, passwayinterview.com and you can download all of my top 21 brilliant exam palancers to difficult Amazon interview questions. You will get all of the answers I have provided you today in that practice interview and the slides. Plus more, example responses that will help you prepare fully for your Amazon interview. Don't forget, Amazon is probably the greatest organisation in the world. In my opinion, they are one of the best companies to work for. With his worth putting in that extra effort to make sure you pass your interview. Amazon interviews are different from other types of interviews because you have to give in-depth answers to convince them you have what it takes to succeed. So make sure you check out that link in the top right-hand corner of the video. Go through to my website and you can download all of my resources that will help you pass your Amazon interview. Go for get to hit the subscribe button as you can probably tell thousands of people. I mean thousands are passing their interviews and Amazon interviews at the first attempt. I can only help you if you are subscribed. Please hit the like button because that really does motivate me to create more great content for you. And don't forget to connect with me on LinkedIn. I have put my LinkedIn link in the description below the video. It is always a pleasure and an honour to connect with like-minded professionals such as yourself. Thank you so much for watching and for supporting my channel. I wish you all the best, the very best for passing your Amazon interview. Have a wonderful day.",
  "segments": [
    {
      "id": 0,
      "text": "In this video, I am going to teach you how to pass an Amazon interview."
    },
    {
      "id": 1,
      "text": "In a second, I will undertake a live Amazon job interview to teach you how to answer"
    },
    {
      "id": 2,
      "text": "the type of questions you will have to answer in your own Amazon interview."
    },
    {
      "id": 3,
      "text": "Therefore, if you have an Amazon interview coming up soon for any job role, stay tuned"
    },
    {
      "id": 4,
      "text": "because I will help you pass at the first attempt."
    },
    {
      "id": 5,
      "text": "And just for a quickly, please tell me the name of the Amazon interview you have coming"
    },
    {
      "id": 6,
      "text": "up in the comments section below the video and I will give you some additional tips"
    },
    {
      "id": 7,
      "text": "to help you pass."
    },
    {
      "id": 8,
      "text": "And make sure you hit that subscribe button and give the video a like because that"
    },
    {
      "id": 9,
      "text": "really does motivate me to create more great content for you."
    },
    {
      "id": 10,
      "text": "Thank you very much indeed."
    },
    {
      "id": 11,
      "text": "Okay, here I am in that live Amazon interview about to give some top scoring answers."
    },
    {
      "id": 12,
      "text": "Once the interview is finished, I will then give you the scripted answers to write down."
    },
    {
      "id": 13,
      "text": "Here we go."
    },
    {
      "id": 14,
      "text": "Welcome to NT."
    },
    {
      "id": 15,
      "text": "Please tell me about yourself."
    },
    {
      "id": 16,
      "text": "Thank you for this opportunity."
    },
    {
      "id": 17,
      "text": "I have always been passionate about combining innovation with customer centricity."
    },
    {
      "id": 18,
      "text": "And that's why I'm excited about the prospect of working for Amazon."
    },
    {
      "id": 19,
      "text": "My skills, qualities and work ethic are a great match for your leadership principles."
    },
    {
      "id": 20,
      "text": "In my previous role, I worked on a team that successfully launched the game-changing"
    },
    {
      "id": 21,
      "text": "product by embodying the think big principle."
    },
    {
      "id": 22,
      "text": "We identified emerging market trends and then created a brilliant product that gave the"
    },
    {
      "id": 23,
      "text": "company an excellent return on their investment."
    },
    {
      "id": 24,
      "text": "Throughout my career, I've consistently exhibited ownership by taking responsibility for"
    },
    {
      "id": 25,
      "text": "both successes and setbacks."
    },
    {
      "id": 26,
      "text": "For example, when we lost two team members during a critical deadline project, I stepped"
    },
    {
      "id": 27,
      "text": "up, rallied the team, and redistributed tasks to ensure we delivered the project with uncompromising"
    },
    {
      "id": 28,
      "text": "quality."
    },
    {
      "id": 29,
      "text": "I'm genuinely excited about the opportunity to contribute to Amazon's relentless pursuit"
    },
    {
      "id": 30,
      "text": "of satisfaction and innovation and believe my commitment to your leadership principles will"
    },
    {
      "id": 31,
      "text": "enable me to thrive in this dynamic environment, and I look forward to sharing further details"
    },
    {
      "id": 32,
      "text": "in the interview as to my suitability for this position."
    },
    {
      "id": 33,
      "text": "Why do you want to work for Amazon?"
    },
    {
      "id": 34,
      "text": "It is highly valued and building a long-term career at Amazon has always been my number"
    },
    {
      "id": 35,
      "text": "one goal."
    },
    {
      "id": 36,
      "text": "Amazon has long been the market leader in numerous industries."
    },
    {
      "id": 37,
      "text": "This tells me Amazon is an organisation that is continually progressing delivers world-class"
    },
    {
      "id": 38,
      "text": "products and services and provides customer service that outperforms its competitors."
    },
    {
      "id": 39,
      "text": "I will be pushed and challenged in my work at Amazon and my ideas will be valued and"
    },
    {
      "id": 40,
      "text": "listened to."
    },
    {
      "id": 41,
      "text": "I want to work for Amazon because the leadership principles are a set of values and standards"
    },
    {
      "id": 42,
      "text": "I genuinely believe in, and the inclusive workplace culture means there is opportunity for"
    },
    {
      "id": 43,
      "text": "everyone."
    },
    {
      "id": 44,
      "text": "Tell me about a tie you demonstrated, one of Amazon's leadership principles at work."
    },
    {
      "id": 45,
      "text": "The following example is based on the leadership principle of customer obsession."
    },
    {
      "id": 46,
      "text": "A team member had failed to contact a customer when they had contacted the company to complain"
    },
    {
      "id": 47,
      "text": "about a faulty product."
    },
    {
      "id": 48,
      "text": "The customer was understandably annoyed and they had left a negative review online."
    },
    {
      "id": 49,
      "text": "It was my task to turn around their experience, result the complaint fully and retain their"
    },
    {
      "id": 50,
      "text": "customer."
    },
    {
      "id": 51,
      "text": "I contacted the customer immediately, apologized sincerely, and told them I would feel the same"
    },
    {
      "id": 52,
      "text": "as them if the situation had happened to me."
    },
    {
      "id": 53,
      "text": "I gave the customer time to speak about their experience."
    },
    {
      "id": 54,
      "text": "I then explained what I was going to do to put things right after I had asked them questions"
    },
    {
      "id": 55,
      "text": "to gain full clarity of the issue."
    },
    {
      "id": 56,
      "text": "I told the customer I would contact them within the next 24 hours after I had concluded"
    },
    {
      "id": 57,
      "text": "my investigation."
    },
    {
      "id": 58,
      "text": "After I had resolved the customers complaint and issued them with a new product, I informed"
    },
    {
      "id": 59,
      "text": "my manager about the situation so they could provide remedial training to the staff member"
    },
    {
      "id": 60,
      "text": "who had let the customer down."
    },
    {
      "id": 61,
      "text": "Tell me about a tie when you found a simple solution to a challenging problem."
    },
    {
      "id": 62,
      "text": "In my previous job, we had an ongoing problem with communication."
    },
    {
      "id": 63,
      "text": "Update some projects and task delegation were becoming increasingly difficult as the company"
    },
    {
      "id": 64,
      "text": "expanded."
    },
    {
      "id": 65,
      "text": "So I decided to find a simple solution to this difficult problem."
    },
    {
      "id": 66,
      "text": "After researching online for the best workplace communication and productivity tools, I put"
    },
    {
      "id": 67,
      "text": "together a short presentation on a software tool called Evernote."
    },
    {
      "id": 68,
      "text": "Evernote would empower managers and team members to keep everyone updated on task and project"
    },
    {
      "id": 69,
      "text": "progression."
    },
    {
      "id": 70,
      "text": "After watching my presentation, my manager agreed to its implementation."
    },
    {
      "id": 71,
      "text": "Within several weeks, Evernote became a fundamental part of our workplace productivity,"
    },
    {
      "id": 72,
      "text": "virtual and task management and communication improved significantly as a result."
    },
    {
      "id": 73,
      "text": "Tell me about a time when you were able to influence change in an organisation by only"
    },
    {
      "id": 74,
      "text": "asking questions."
    },
    {
      "id": 75,
      "text": "In my last job, I attended a meeting to discuss the environmental impact our company was having."
    },
    {
      "id": 76,
      "text": "I had several ideas for making improvements."
    },
    {
      "id": 77,
      "text": "It was my task to influence a positive change by asking three specific questions which"
    },
    {
      "id": 78,
      "text": "I had already prepared."
    },
    {
      "id": 79,
      "text": "The questions I asked were, have we considered how much waste we were generating?"
    },
    {
      "id": 80,
      "text": "Do we think we could be more environmentally friendly in our office practices and have"
    },
    {
      "id": 81,
      "text": "we ever considered implementing a recycling program?"
    },
    {
      "id": 82,
      "text": "The three questions resulted in a healthy debate."
    },
    {
      "id": 83,
      "text": "I then presented a recycling idea to my manager and she agreed it was a really positive"
    },
    {
      "id": 84,
      "text": "step forward."
    },
    {
      "id": 85,
      "text": "After my idea was implemented, we reduced company waste by 75% and everyone in the company"
    },
    {
      "id": 86,
      "text": "adopted a more responsible approach to waste."
    },
    {
      "id": 87,
      "text": "Why should we hire you to work at Amazon?"
    },
    {
      "id": 88,
      "text": "You should hire me because I am deeply committed to the principle of customer obsession."
    },
    {
      "id": 89,
      "text": "Throughout my career, I have prioritised customer centricity consistently striving"
    },
    {
      "id": 90,
      "text": "to meet their needs."
    },
    {
      "id": 91,
      "text": "Additionally, you should hire me because of my unwavering commitment to ownership, which"
    },
    {
      "id": 92,
      "text": "means I take full responsibility for my work and difficult challenges."
    },
    {
      "id": 93,
      "text": "I will embrace Amazon's culture of innovation and simplification through a proactive"
    },
    {
      "id": 94,
      "text": "approach to my work and actively seek ways to improve processes."
    },
    {
      "id": 95,
      "text": "My insistence on the highest standards and my ability to think big align perfectly with"
    },
    {
      "id": 96,
      "text": "Amazon's pursuit of excellence."
    },
    {
      "id": 97,
      "text": "Finally, you should hire me because my deep alignment with Amazon's 16 leadership principles"
    },
    {
      "id": 98,
      "text": "makes me an ideal candidate to contribute to the organisations on going growth and success."
    },
    {
      "id": 99,
      "text": "OK, in this next section of the training video, I will give you those brilliant top scoring"
    },
    {
      "id": 100,
      "text": "answers to write down to help you prepare for your own Amazon interview."
    },
    {
      "id": 101,
      "text": "If at any point you want to simply download all of the answers, you can click that link"
    },
    {
      "id": 102,
      "text": "at any time."
    },
    {
      "id": 103,
      "text": "Here we go."
    },
    {
      "id": 104,
      "text": "OK, so the first question I was asked during my practice Amazon interview was,"
    },
    {
      "id": 105,
      "text": "tell me about yourself."
    },
    {
      "id": 106,
      "text": "Here is that brilliant example answer I gave."
    },
    {
      "id": 107,
      "text": "Tell me about yourself."
    },
    {
      "id": 108,
      "text": "Thank you for this opportunity."
    },
    {
      "id": 109,
      "text": "I have always been passionate about combining innovation with customer centricity and that's"
    },
    {
      "id": 110,
      "text": "why I'm excited about the prospect of working for Amazon."
    },
    {
      "id": 111,
      "text": "My skills, qualities and work ethic are a great match for your leadership principles."
    },
    {
      "id": 112,
      "text": "In my previous role, I worked on a team that successfully launched a game-changing product"
    },
    {
      "id": 113,
      "text": "by embodying the think big principle."
    },
    {
      "id": 114,
      "text": "We identified emerging market trends and then created a brilliant product that gave the"
    },
    {
      "id": 115,
      "text": "company an excellent return on their investment."
    },
    {
      "id": 116,
      "text": "Throughout my career, I've consistently exhibited ownership by taking responsibility for"
    },
    {
      "id": 117,
      "text": "both successes and setbacks."
    },
    {
      "id": 118,
      "text": "For example, when we lost two team members during a critical deadline project, I stepped"
    },
    {
      "id": 119,
      "text": "up, rallied the team, and redistributed tasks to ensure we delivered the project with uncompromising"
    },
    {
      "id": 120,
      "text": "quality."
    },
    {
      "id": 121,
      "text": "I'm genuinely excited about the opportunity to contribute to Amazon's relentless pursuit"
    },
    {
      "id": 122,
      "text": "of satisfaction and innovation and believe my commitment to your leadership principles"
    },
    {
      "id": 123,
      "text": "will enable me to thrive in this dynamic environment."
    },
    {
      "id": 124,
      "text": "I look forward to sharing further details in the interview as to my suitability for this"
    },
    {
      "id": 125,
      "text": "position."
    },
    {
      "id": 126,
      "text": "That is a brilliant answer that you can use when preparing for your own Amazon interview."
    },
    {
      "id": 127,
      "text": "Don't forget, at any stage, you can click the link in the top right-hand corner of the"
    },
    {
      "id": 128,
      "text": "video, head straight through to my website, pastmaintevue.com, and download all of the"
    },
    {
      "id": 129,
      "text": "answers."
    },
    {
      "id": 130,
      "text": "So the second question I was asked at my practice Amazon interview was, why do you want"
    },
    {
      "id": 131,
      "text": "to work for Amazon?"
    },
    {
      "id": 132,
      "text": "Here is that brilliant example answer I gave."
    },
    {
      "id": 133,
      "text": "Getting hired and building a long-term career at Amazon has always been my number one"
    },
    {
      "id": 134,
      "text": "goal."
    },
    {
      "id": 135,
      "text": "Amazon has long been the market leader in numerous industries."
    },
    {
      "id": 136,
      "text": "This tells me Amazon is an organisation that is continually progressing, delivers"
    },
    {
      "id": 137,
      "text": "world-class products and services and provides customer service that outperforms its competitors."
    },
    {
      "id": 138,
      "text": "I will be pushed and challenged in my work at Amazon and my ideas will be valued and listened"
    },
    {
      "id": 139,
      "text": "to."
    },
    {
      "id": 140,
      "text": "I want to work for Amazon because the leadership principles are a set of values and standards"
    },
    {
      "id": 141,
      "text": "I genuinely believe in and the inclusive workplace culture means there is opportunity for everyone."
    },
    {
      "id": 142,
      "text": "I love that answer because you are talking about how great Amazon is in respect of customer"
    },
    {
      "id": 143,
      "text": "service that means it outperforms its competitors and you are also saying at the start"
    },
    {
      "id": 144,
      "text": "that you want to build a long-term career at Amazon."
    },
    {
      "id": 145,
      "text": "That's a really strong answer."
    },
    {
      "id": 146,
      "text": "Again you can use it when preparing for your own Amazon interview."
    },
    {
      "id": 147,
      "text": "The next question was, what is called a behavioral interview question?"
    },
    {
      "id": 148,
      "text": "That question was, tell me about a time you demonstrated one of Amazon's leadership"
    },
    {
      "id": 149,
      "text": "principles at work."
    },
    {
      "id": 150,
      "text": "Therefore you have to learn and understand Amazon's 16 leadership principles in order"
    },
    {
      "id": 151,
      "text": "to answer this correctly."
    },
    {
      "id": 152,
      "text": "Now here is that great answer I gave."
    },
    {
      "id": 153,
      "text": "The following example is based on the leadership principle of customer obsession."
    },
    {
      "id": 154,
      "text": "The team member had failed to respond to a customer when they had contacted the company"
    },
    {
      "id": 155,
      "text": "to complain about a faulty product."
    },
    {
      "id": 156,
      "text": "The customer was understandably annoyed and they had left a negative review online."
    },
    {
      "id": 157,
      "text": "It was my task to turn around their experience, resolve the complaint fully and then retain"
    },
    {
      "id": 158,
      "text": "their custom."
    },
    {
      "id": 159,
      "text": "I contacted the customer immediately, apologized sincerely and told them I would feel the same"
    },
    {
      "id": 160,
      "text": "as them if the situation had happened to me."
    },
    {
      "id": 161,
      "text": "I gave the customer time to speak about their experience."
    },
    {
      "id": 162,
      "text": "Then explained what I was going to do to put things right after I had asked them questions"
    },
    {
      "id": 163,
      "text": "to gain full clarity of the issue."
    },
    {
      "id": 164,
      "text": "I told the customer I would contact them within the next 24 hours after I had concluded"
    },
    {
      "id": 165,
      "text": "my investigation."
    },
    {
      "id": 166,
      "text": "After I'd resolved the customers complaint and issued them with a new product, I informed"
    },
    {
      "id": 167,
      "text": "my manager about the situation so they could provide remedial training to the staff member"
    },
    {
      "id": 168,
      "text": "who had let the customer down."
    },
    {
      "id": 169,
      "text": "That is a really good example answer where I am talking about a specific situation I had"
    },
    {
      "id": 170,
      "text": "previously been in where I demonstrated the leadership principle of customer obsession."
    },
    {
      "id": 171,
      "text": "Another really good tip for answering the Amazon leadership principles, behavioral questions,"
    },
    {
      "id": 172,
      "text": "is to make sure you use a start technique when responding to those questions."
    },
    {
      "id": 173,
      "text": "So start stands for situation task action and result."
    },
    {
      "id": 174,
      "text": "You give details of the situation you were in."
    },
    {
      "id": 175,
      "text": "You then tell the interviewer the task that needed doing."
    },
    {
      "id": 176,
      "text": "You then give in depth details about the action you took to achieve the task."
    },
    {
      "id": 177,
      "text": "And then finally, you tell the interviewer the results following your actions."
    },
    {
      "id": 178,
      "text": "I'll make sure you use a start technique when answering the Amazon behavioral interview"
    },
    {
      "id": 179,
      "text": "questions."
    },
    {
      "id": 180,
      "text": "Now the next question I had to answer in my Amazon practice interview was, tell me about"
    },
    {
      "id": 181,
      "text": "a time when you found a simple solution to a challenging problem."
    },
    {
      "id": 182,
      "text": "Here is that brilliant example answer I gave."
    },
    {
      "id": 183,
      "text": "In my previous job we had an ongoing problem with communication."
    },
    {
      "id": 184,
      "text": "I ate some projects and task delegation were becoming increasingly difficult as the company"
    },
    {
      "id": 185,
      "text": "expanded."
    },
    {
      "id": 186,
      "text": "So I decided to find a simple solution to this difficult problem."
    },
    {
      "id": 187,
      "text": "After researching online for the best workplace communication and productivity tools,"
    },
    {
      "id": 188,
      "text": "I put together a short presentation on a software tool called Evernote."
    },
    {
      "id": 189,
      "text": "Evernote would empower managers and team members to keep everyone updated on task and project"
    },
    {
      "id": 190,
      "text": "progression."
    },
    {
      "id": 191,
      "text": "After watching my presentation, my manager agreed to its implementation."
    },
    {
      "id": 192,
      "text": "Within several weeks, Evernote became a fundamental part of our workplace productivity"
    },
    {
      "id": 193,
      "text": "schedule and task management and communication improved significantly as a result."
    },
    {
      "id": 194,
      "text": "So that is another really good answer that's going to help you prepare fully for your"
    },
    {
      "id": 195,
      "text": "Amazon interview."
    },
    {
      "id": 196,
      "text": "Now the next question is another Amazon behavioral interview question that is focused"
    },
    {
      "id": 197,
      "text": "on how you have previously demonstrated the leadership principles."
    },
    {
      "id": 198,
      "text": "This question was, tell me about a time when you were able to influence change in an"
    },
    {
      "id": 199,
      "text": "organisation by only asking questions."
    },
    {
      "id": 200,
      "text": "This is a really difficult one."
    },
    {
      "id": 201,
      "text": "But here's that brilliant answer I gave."
    },
    {
      "id": 202,
      "text": "In my last job, I attended a meeting to discuss the environmental impact our company"
    },
    {
      "id": 203,
      "text": "was having."
    },
    {
      "id": 204,
      "text": "I had several ideas for making improvements."
    },
    {
      "id": 205,
      "text": "It was my task to influence a positive change by asking three specific questions which"
    },
    {
      "id": 206,
      "text": "I had already prepared."
    },
    {
      "id": 207,
      "text": "The questions I asked were, have we considered how much waste we were generating?"
    },
    {
      "id": 208,
      "text": "Do we think we could be more environmentally friendly in our office practices and have we"
    },
    {
      "id": 209,
      "text": "ever considered implementing a recycling program?"
    },
    {
      "id": 210,
      "text": "The three questions resulted in a healthy debate."
    },
    {
      "id": 211,
      "text": "I then presented a recycling idea to my manager and she agreed it was a positive step forward."
    },
    {
      "id": 212,
      "text": "Now after my idea was implemented, we reduced company waste by 75% and everyone in the company"
    },
    {
      "id": 213,
      "text": "adopted a more responsible approach to waste."
    },
    {
      "id": 214,
      "text": "That's a great example situation where I was in a team meeting asked three specific situations"
    },
    {
      "id": 215,
      "text": "which then resulted in a healthy conversation and positive changes to the organisation's"
    },
    {
      "id": 216,
      "text": "working practices."
    },
    {
      "id": 217,
      "text": "Now the next question was, why should we hire you to work at Amazon?"
    },
    {
      "id": 218,
      "text": "Here is that great in-depth answer I gave."
    },
    {
      "id": 219,
      "text": "You should hire me because I am deeply committed to the principle of customer obsession."
    },
    {
      "id": 220,
      "text": "Throughout my career, I have prioritised customer centricity consistently striving to meet"
    },
    {
      "id": 221,
      "text": "their needs."
    },
    {
      "id": 222,
      "text": "Additionally, you should hire me because of my unwavering commitment to ownership, which"
    },
    {
      "id": 223,
      "text": "means I take full responsibility for my work and difficult challenges."
    },
    {
      "id": 224,
      "text": "I will embrace Amazon's culture of innovation and simplification through a proactive approach"
    },
    {
      "id": 225,
      "text": "to my work and actively seek ways to improve your processes."
    },
    {
      "id": 226,
      "text": "My insistence on the highest standards and my ability to think big align perfectly with"
    },
    {
      "id": 227,
      "text": "Amazon's pursuit of excellence."
    },
    {
      "id": 228,
      "text": "Finally, you should hire me because my deep alignment with Amazon's 16 leadership principles"
    },
    {
      "id": 229,
      "text": "makes me an ideal candidate to contribute to the organisation's ongoing growth and success."
    },
    {
      "id": 230,
      "text": "That's a great answer because it's in-depth."
    },
    {
      "id": 231,
      "text": "You are also talking about the leadership principles which you are going to have to learn"
    },
    {
      "id": 232,
      "text": "and understand before you attend your Amazon interview."
    },
    {
      "id": 233,
      "text": "In the description below the video, I have provided you with more links to great training"
    },
    {
      "id": 234,
      "text": "videos right here on YouTube that will help you understand those 16 leadership principles"
    },
    {
      "id": 235,
      "text": "and answer more types of questions that you will encounter during your Amazon interview."
    },
    {
      "id": 236,
      "text": "So don't forget to check out that links."
    },
    {
      "id": 237,
      "text": "The next thing to do to accelerate your learning even further is make sure you click that link"
    },
    {
      "id": 238,
      "text": "right now in the top right-hand corner of the video."
    },
    {
      "id": 239,
      "text": "Head straight through to my website, passwayinterview.com and you can download all of my top 21"
    },
    {
      "id": 240,
      "text": "brilliant exam palancers to difficult Amazon interview questions."
    },
    {
      "id": 241,
      "text": "You will get all of the answers I have provided you today in that practice interview and"
    },
    {
      "id": 242,
      "text": "the slides."
    },
    {
      "id": 243,
      "text": "Plus more, example responses that will help you prepare fully for your Amazon interview."
    },
    {
      "id": 244,
      "text": "Don't forget, Amazon is probably the greatest organisation in the world."
    },
    {
      "id": 245,
      "text": "In my opinion, they are one of the best companies to work for."
    },
    {
      "id": 246,
      "text": "With his worth putting in that extra effort to make sure you pass your interview."
    },
    {
      "id": 247,
      "text": "Amazon interviews are different from other types of interviews because you have to give"
    },
    {
      "id": 248,
      "text": "in-depth answers to convince them you have what it takes to succeed."
    },
    {
      "id": 249,
      "text": "So make sure you check out that link in the top right-hand corner of the video."
    },
    {
      "id": 250,
      "text": "Go through to my website and you can download all of my resources that will help you"
    },
    {
      "id": 251,
      "text": "pass your Amazon interview."
    },
    {
      "id": 252,
      "text": "Go for get to hit the subscribe button as you can probably tell thousands of people."
    },
    {
      "id": 253,
      "text": "I mean thousands are passing their interviews and Amazon interviews at the first attempt."
    },
    {
      "id": 254,
      "text": "I can only help you if you are subscribed."
    },
    {
      "id": 255,
      "text": "Please hit the like button because that really does motivate me to create more great content"
    },
    {
      "id": 256,
      "text": "for you."
    },
    {
      "id": 257,
      "text": "And don't forget to connect with me on LinkedIn."
    },
    {
      "id": 258,
      "text": "I have put my LinkedIn link in the description below the video."
    },
    {
      "id": 259,
      "text": "It is always a pleasure and an honour to connect with like-minded professionals such"
    },
    {
      "id": 260,
      "text": "as yourself."
    },
    {
      "id": 261,
      "text": "Thank you so much for watching and for supporting my channel."
    },
    {
      "id": 262,
      "text": "I wish you all the best, the very best for passing your Amazon interview."
    },
    {
      "id": 263,
      "text": "Have a wonderful day."
    }
  ]
}