{
  "file": "Zfqo_6QXun8.wav",
  "text": " Hello, there my name is Richard McMunn from the interview training website, passmindervu.com and in this tutorial I will teach you how to answer Amazon leadership principles interview questions. Now if you are applying for any role at Amazon, I strongly recommend you watch this tutorial from start to finish. It will make a huge difference not just to your preparation before the interview, but to your actual performance on the day. So make sure you stay tuned because I promise to help you be the standout candidate. Now to help you pass your Amazon interview this is what I will cover during the tutorial. So I will explain what the 16 Amazon leadership principles are. Now you need to know this before you attend your interview. I will tell you the number one best method for structuring your answers to the Amazon leadership principles interview questions. I will then give you some example brilliant answers to the Amazon leadership principles interview questions before finally telling you where you can download further resources to help you succeed. And for your ease of use, I have placed the links to each section of this tutorial in the description below the video. So if you want to jump straight to the Amazon interview questions and answers, you can do. But my advice is to watch it from start to finish because I want to talk to you about the leadership principles. Also make sure you tell me the name of the job you are applying for with Amazon in the comments section below the video. And I will also give you some more questions to prepare for for your specific role. And just very quickly, if you are new to this channel, please make sure you hit the subscribe button. It's really important. Literally thousands of you are passing your job interviews. And I can only help you if you are subscribed. And by subscribing to the channel, I will be able to help you to progress throughout your career. And please just give the video a like. Thank you very much for your support. By liking the video, it tells me that you find these tutorials useful. Thank you very much. Okay, let's start off with the 16 leadership principles of Amazon. Now the leadership principles are the core principles that everyone must demonstrate in their work. Now, I personally believe that Amazon is one of the best companies in the world because of the way they deliver outstanding customer service. They are fantastic at it. But also because of the people they employ within their organization. They are all hardworking, they are smart and professional in everything they do. And they also make sure they follow these 16 Amazon leadership principles. Now the leadership principles are the foundations of Amazon. And they are used whenever discussing new ideas, solving problems, creating new products and services, or whenever Amazon is seeking to improve customer service standards. So it's really important that you understand the 16 Amazon leadership principles before you attend your interview. It's my genuine belief that if you do not understand the 16 Amazon leadership principles, you are not likely to pass your interview. You really need to know them. So let's quickly work through them. I will then give you that structure for answering the leadership principles interview questions. And I will then give you some example answers to help you. So the first of our 16 Amazon leadership principles is customer obsession. So Amazon always puts its customers first in everything it does. You will never see Amazon focusing on its competitors. It never focuses on the competition. Instead, it focuses on delivering outstanding customer service and products. And then the customers just come back to Amazon time and time again. It's a brilliant leadership principle and it's called customer obsession. The second one is ownership. So people who work for Amazon always take ownership of difficult challenges and problems. So you will never hear an Amazon employee say, oh, that's not my job, or that's not my responsibility. They always take ownership. The next Amazon leadership principle is invent and simplify. So Amazon expects its teams to create ideas that improve customers' lives and also improve company processes. So if you are a creative person, then Amazon is a brilliant place to work out. The next leadership principle is art rights a lot. So Amazon employees are rights a lot of the time. They are leaders who have sound judgment skills and they always make the right decisions based on facts and evidence. So the next leadership principle is learn and be curious. So people that work for Amazon are always hungry to learn and they are never finished with learning. The next leadership principle is hire and develop the best. So Amazon employees the best people they always seek to improve their recruitment processes and standards and they help people in the company to progress throughout the organization. As I said, I believe one of the best places to work in the world. The next Amazon leadership principle, out of our 16 is insist on the highest standard. This is one of my favourite ones. Now Amazon employees always strive for the highest standards possible. When things go wrong, they fix the problem. So the tip never happens again. This is another good leadership principle. Think big. So Amazon employees are leaders who always think big and they look at the wider picture. So they always seek ways to improve customer service standards. The next of our 16 leadership principles is bias for action. So speed is everything in Amazon's business. Speed of delivery, speed of service and speed of product launch. So you will have to work quick when you join Amazon. The next one is through this again is one of my more favourite leadership principles. Amazon wants its employees to not just help the business to grow but to also help it to save money too. By being frugal with resources and supplies. The next one is earned trust. So trust is earned at Amazon by listening, asking the right questions. And also treating everyone with dignity and respect. That's really important. The next one is dive deep. So whilst working for Amazon, you must dive deep into information and data to solve problems because if you look at a problem deep enough, then you will be able to find a solution. The next of our 16 Amazon leadership principles is have backbone, disagree, and then commit. So Amazon is fine to disagree and have an opinion. So if you disagree with someone, you should say so and explain your reasons why, but you must then commit to the agreed way of working. The next leadership principle is deliver results. So it's a simple principle but very important nonetheless. You should always deliver on time and to the right standard. The next of our 16 Amazon leadership principles is strive to be Earth's best employer. So Amazon is always improving safety standards for it's staff, creating better company processes. And it also trains it staff to ensure they become a maintain high performing employees. And the final one is success and scale, bring broad responsibility. So Amazon is a responsible employer that understands it's impact on the world. Even though Amazon started out in a garage, it now realizes that it's huge and it's impact impact on the world. These huge too. And that brings a lot of responsibility. So that leadership principle means that Amazon takes its responsibility seriously. So let me now teach you how to structure your answers to the Amazon leadership principles into your questions. So essentially, during your Amazon interview, you will be asked a series of behavioral interview questions that are focused on the 16 leadership principles. And there's a real cool way to structure your answers. It's a great way, learn this because it will help you to also memorize your answers. And it's called the Star Technique. So Star stands for Situation Task Action and Result. So you start off your answer by explaining to the interview, to the interviewer, the situation you were faced with. You then move on and briefly outline the task that needed doing. You then give in-depth details about the action you took to achieve the task and you then finish off and reveal the results following your actions. And the result should always be a positive outcome. So the Star Technique to be used when answering Amazon leadership principles, behavioral interview questions is situation, task action and result. So let me now work through some Amazon leadership principles, interview questions and examples that utilize the Star Technique. So the first question is describe your most difficult customer and how you handle them. Now this is based on the leadership principle of customer obsession. So Amazon, as I mentioned previously, always puts its customer first in everything it does. It never focuses on the competition. So here's my example answer that uses a Star Technique. Here we go. Describe your most difficult customer and how you handle them. A customer contacted me one day to ask for a refund because they were not happy with their purchase. Now unfortunately they informed me they did not have a receipt and because they had paid cash for the product. There was no way I could track their order. I apologized but explained that I was not able to refund their order as this was against company policy. Now the customer started to become angry and they threatened to leave a negative review online. It was my task to remain calm and find a solution for the customer they were happy with. I maintained my stance relating to the fact I could not refund their order. However, I suggested to the customer that they could either have a replacement product or they could receive a credit note against a future purchase. I then asked several questions about the type of product they wanted before suggesting alternative products we had available that would be more suited to their needs. Eventually the customer calmed down and agreed to exchange their purchase for a product they really wanted. The customer then went online and left a glowing five-star review, citing my professionalism and attentiveness whilst dealing with their situation. That's a really good example answer. It's a specific situation I was in when dealing with a difficult customer. I explained how I handled them. That uses a star technique and you can see there how effective the starting technique is Now don't go anywhere because I still have more questions and answers to give you that are brilliant preparation for your Amazon interview. But when you're ready you can click the link in the top right hand corner of the video head through to my website pastmaintv.com and you can download my full set of Amazon leadership principles interview questions and brilliant example answers including the ones we are working through together today. But here's an next question. Given example of a time when you went above and beyond to meet a deadline now this is focused on the leadership principle of deliver results. Remember deliver results is a simple leadership principle but very important nonetheless always deliver on time and to the right standard. Here's my example answer that utilizes the star technique. Given example of a time when you went above and beyond to meet a deadline here we go. In my last role I was working on an important project for a company client. Now the project team consisted of six people however, two thirds of the way through the project two team members went off sick with COVID. This situation had the potential to delay the project by several weeks but this was something I wasn't prepared to allow happen. It was my task to come up with a solution to the problem. I re-evaluated the project goals and determined that some of the work could be outsourced to online contractors. This proved to be a shrewd move because the contractors I ended up hiring had exceptional skills and they were able to improve the quality of project work that was being delivered. For the remainder of the project I also agreed to commit to extra working hours each evening to ensure it was completed on time. I ended up working an additional 17 hours in the evenings leading up to the project deadline to make sure it was finished on time until they expected standard. Now because of this experience I also learned the skill of hiring outsourcers which we utilized in the company on future projects. As a number really good answer it shows that you make sure you deliver results as per the leadership principle and you also learn a new skill along the way which is a great one because it shows that you are always learning another really important leadership principle at Amazon. The next Amazon leadership principle interview question I want to work through is tell me about a time when you helped a team or company to save money. So this is about through Galatie. Remember Amazon wants its employees to not just help grow the business but help it to save money too. This is a difficult question but here's my example answer to help you. Tell me about a time when you helped a team or company to save money. Here's my response that uses that star technique here we go. In my previous role I was concerned about how much we were spending on delivery costs. Every day we were sending out hundreds of orders to customers but our delivery company did not appear to be providing value for money. It was my task to evaluate our delivery expenses to see if I could save the company money. I spent the next three hours conducting an analysis of the past 12 months delivery costs and I was staggered at how expensive they were. Now even though the number of orders we were sending out via our delivery company had literally doubled their prices had increased by a third. So I decided to call the delivery company area manager to explain my concerns and to negotiate a fairer price. After a half hour on the telephone outlining my concerns he agreed to reduce the delivery fees back to their previous price for the next 12 months which ended up saving the company more than $5,000 in total. That's a great example answer. It shows that you take ownership another leadership principle. It shows that you care about the company because you are finding ways to help save money and increase company profits. Great answer. Here's the next question. Give an example of a time when you didn't see I2I with a work calling. This is a trick you want. So this is based on the leadership principle of a backbone, disagree and commit. So remember, Amazon is fine to disagree and have an opinion and if you think something's wrong you should speak up but you must commit to the agreed way of working. Here's my example answer to help you. Give an example of a time when you didn't see I2I with a work colleague. Here we go. I was in a team meeting discussing the launch of a new company product. Now a colleague of mine was adamant the best way for us to promote the product was through local newspaper adverts. I disagreed. It was my task to explain using facts and evidence why the best way to promote the new product would be through online advertising. After listening to his arguments for promoting the product in local newspapers I explained that we had a better chance of converting sales by targeting people online by age, gender, demographics and interests. I showed him an example of how a company had been able to surpass all previous company launches by shifting their advertising online. I also explained that we could track the return on advertising investment if we advertised online. Something that was not possible using newspaper adverts. After listening to my reason argument he agreed my suggestion was more beneficial to the new product launch you did a 37% increase in sales compared with previous launches. As a great example of that Amazon leadership principle have backbone, disagree and then commit. So you are saying that you disagree with him and you are explaining why you think that's not the best way to proceed using facts and evidence and you are then persuading the person to choose your way forward. You are all then committing and there is a brilliant outcome for the company in terms of that 37% increase in sales. It's a great example. Now this is another Amazon leadership principle interview question that comes up a lot. It's a difficult one to answer. What is your favorite Amazon leadership principle? Well you have 16 to choose from. Here's how I would personally answer this question. What is your favorite Amazon leadership principle? Here we go. My favorite leadership principle is customer obsession. I decided I wanted to work for Amazon after buying many products from your website. Your levels of customer service were always outstanding and I was hugely impressed with your speed of delivery. This made me realise that so many companies out there have it wrong when it comes to customer service. They appear to focus too much on their competitors instead of focusing on their customers. If a company focuses on their customers they won't need to worry about competitors because customers will stay with them for the long term. Now whilst all of the leadership principles are very important, Amazon would be nothing without the customer and that's the reason why it is my first choice. That's a great answer and you are explaining the reasons why you have chosen your particular Amazon leadership principle. So the next thing to do don't forget to click the link in the top right-hand corner of the video right now. Head through to my website, passmaintv.com and you can instantly download my full set of Amazon leadership principles, interview questions and example answers. It's a fantastic resource you can have it in your inbox literally within two minutes from now. I'm actually going to check that out. Don't forget to tell me in the comments section below the video which job you are applying for at Amazon. I will also give you another video to watch and learn from. Don't forget to subscribe to the channel. We'll see you all the best for passing your Amazon job interview. Have a great day.",
  "segments": [
    {
      "id": 0,
      "text": "Hello, there my name is Richard McMunn from the interview training website,"
    },
    {
      "id": 1,
      "text": "passmindervu.com and in this tutorial I will teach you how to answer Amazon leadership principles"
    },
    {
      "id": 2,
      "text": "interview questions. Now if you are applying for any role at Amazon, I strongly recommend you"
    },
    {
      "id": 3,
      "text": "watch this tutorial from start to finish. It will make a huge difference not just to your preparation"
    },
    {
      "id": 4,
      "text": "before the interview, but to your actual performance on the day. So make sure you stay tuned"
    },
    {
      "id": 5,
      "text": "because I promise to help you be the standout candidate. Now to help you pass your Amazon"
    },
    {
      "id": 6,
      "text": "interview this is what I will cover during the tutorial. So I will explain what the 16 Amazon"
    },
    {
      "id": 7,
      "text": "leadership principles are. Now you need to know this before you attend your interview. I will"
    },
    {
      "id": 8,
      "text": "tell you the number one best method for structuring your answers to the Amazon leadership principles"
    },
    {
      "id": 9,
      "text": "interview questions. I will then give you some example brilliant answers to the Amazon leadership"
    },
    {
      "id": 10,
      "text": "principles interview questions before finally telling you where you can download further resources"
    },
    {
      "id": 11,
      "text": "to help you succeed. And for your ease of use, I have placed the links to each section of this"
    },
    {
      "id": 12,
      "text": "tutorial in the description below the video. So if you want to jump straight to the Amazon"
    },
    {
      "id": 13,
      "text": "interview questions and answers, you can do. But my advice is to watch it from start to finish"
    },
    {
      "id": 14,
      "text": "because I want to talk to you about the leadership principles. Also make sure you tell me the"
    },
    {
      "id": 15,
      "text": "name of the job you are applying for with Amazon in the comments section below the video. And I will"
    },
    {
      "id": 16,
      "text": "also give you some more questions to prepare for for your specific role. And just very quickly,"
    },
    {
      "id": 17,
      "text": "if you are new to this channel, please make sure you hit the subscribe button. It's really important."
    },
    {
      "id": 18,
      "text": "Literally thousands of you are passing your job interviews. And I can only help you if you are"
    },
    {
      "id": 19,
      "text": "subscribed. And by subscribing to the channel, I will be able to help you to progress"
    },
    {
      "id": 20,
      "text": "throughout your career. And please just give the video a like. Thank you very much for your support."
    },
    {
      "id": 21,
      "text": "By liking the video, it tells me that you find these tutorials useful. Thank you very much."
    },
    {
      "id": 22,
      "text": "Okay, let's start off with the 16 leadership principles of Amazon. Now the leadership"
    },
    {
      "id": 23,
      "text": "principles are the core principles that everyone must demonstrate in their work. Now, I personally"
    },
    {
      "id": 24,
      "text": "believe that Amazon is one of the best companies in the world because of the way they deliver"
    },
    {
      "id": 25,
      "text": "outstanding customer service. They are fantastic at it. But also because of the people they employ"
    },
    {
      "id": 26,
      "text": "within their organization. They are all hardworking, they are smart and professional in everything they do."
    },
    {
      "id": 27,
      "text": "And they also make sure they follow these 16 Amazon leadership principles. Now the leadership"
    },
    {
      "id": 28,
      "text": "principles are the foundations of Amazon. And they are used whenever discussing new ideas,"
    },
    {
      "id": 29,
      "text": "solving problems, creating new products and services, or whenever Amazon is seeking to improve"
    },
    {
      "id": 30,
      "text": "customer service standards. So it's really important that you understand the 16 Amazon leadership"
    },
    {
      "id": 31,
      "text": "principles before you attend your interview. It's my genuine belief that if you do not"
    },
    {
      "id": 32,
      "text": "understand the 16 Amazon leadership principles, you are not likely to pass your interview. You"
    },
    {
      "id": 33,
      "text": "really need to know them. So let's quickly work through them. I will then give you that structure"
    },
    {
      "id": 34,
      "text": "for answering the leadership principles interview questions. And I will then give you some"
    },
    {
      "id": 35,
      "text": "example answers to help you. So the first of our 16 Amazon leadership principles is customer"
    },
    {
      "id": 36,
      "text": "obsession. So Amazon always puts its customers first in everything it does. You will never see"
    },
    {
      "id": 37,
      "text": "Amazon focusing on its competitors. It never focuses on the competition. Instead, it focuses"
    },
    {
      "id": 38,
      "text": "on delivering outstanding customer service and products. And then the customers just come back to"
    },
    {
      "id": 39,
      "text": "Amazon time and time again. It's a brilliant leadership principle and it's called customer obsession."
    },
    {
      "id": 40,
      "text": "The second one is ownership. So people who work for Amazon always take ownership of difficult"
    },
    {
      "id": 41,
      "text": "challenges and problems. So you will never hear an Amazon employee say, oh, that's not my job,"
    },
    {
      "id": 42,
      "text": "or that's not my responsibility. They always take ownership. The next Amazon leadership"
    },
    {
      "id": 43,
      "text": "principle is invent and simplify. So Amazon expects its teams to create ideas that improve"
    },
    {
      "id": 44,
      "text": "customers' lives and also improve company processes. So if you are a creative person, then Amazon"
    },
    {
      "id": 45,
      "text": "is a brilliant place to work out. The next leadership principle is art rights a lot. So Amazon"
    },
    {
      "id": 46,
      "text": "employees are rights a lot of the time. They are leaders who have sound judgment skills and they always"
    },
    {
      "id": 47,
      "text": "make the right decisions based on facts and evidence. So the next leadership principle is learn and"
    },
    {
      "id": 48,
      "text": "be curious. So people that work for Amazon are always hungry to learn and they are never finished"
    },
    {
      "id": 49,
      "text": "with learning. The next leadership principle is hire and develop the best. So Amazon"
    },
    {
      "id": 50,
      "text": "employees the best people they always seek to improve their recruitment processes and standards"
    },
    {
      "id": 51,
      "text": "and they help people in the company to progress throughout the organization. As I said, I believe"
    },
    {
      "id": 52,
      "text": "one of the best places to work in the world. The next Amazon leadership principle, out of our"
    },
    {
      "id": 53,
      "text": "16 is insist on the highest standard. This is one of my favourite ones. Now Amazon employees"
    },
    {
      "id": 54,
      "text": "always strive for the highest standards possible. When things go wrong, they fix the problem."
    },
    {
      "id": 55,
      "text": "So the tip never happens again. This is another good leadership principle. Think big. So Amazon"
    },
    {
      "id": 56,
      "text": "employees are leaders who always think big and they look at the wider picture. So they always seek ways"
    },
    {
      "id": 57,
      "text": "to improve customer service standards. The next of our 16 leadership principles is bias for action."
    },
    {
      "id": 58,
      "text": "So speed is everything in Amazon's business. Speed of delivery, speed of service and speed of"
    },
    {
      "id": 59,
      "text": "product launch. So you will have to work quick when you join Amazon. The next one is through"
    },
    {
      "id": 60,
      "text": "this again is one of my more favourite leadership principles. Amazon wants its employees to not"
    },
    {
      "id": 61,
      "text": "just help the business to grow but to also help it to save money too. By being frugal with resources"
    },
    {
      "id": 62,
      "text": "and supplies. The next one is earned trust. So trust is earned at Amazon by listening, asking the"
    },
    {
      "id": 63,
      "text": "right questions. And also treating everyone with dignity and respect. That's really important."
    },
    {
      "id": 64,
      "text": "The next one is dive deep. So whilst working for Amazon, you must dive deep into information and"
    },
    {
      "id": 65,
      "text": "data to solve problems because if you look at a problem deep enough, then you will be able to find"
    },
    {
      "id": 66,
      "text": "a solution. The next of our 16 Amazon leadership principles is have backbone, disagree, and then"
    },
    {
      "id": 67,
      "text": "commit. So Amazon is fine to disagree and have an opinion. So if you disagree with someone, you should"
    },
    {
      "id": 68,
      "text": "say so and explain your reasons why, but you must then commit to the agreed way of working."
    },
    {
      "id": 69,
      "text": "The next leadership principle is deliver results. So it's a simple principle but very important"
    },
    {
      "id": 70,
      "text": "nonetheless. You should always deliver on time and to the right standard. The next of our 16"
    },
    {
      "id": 71,
      "text": "Amazon leadership principles is strive to be Earth's best employer. So Amazon is always improving"
    },
    {
      "id": 72,
      "text": "safety standards for it's staff, creating better company processes. And it also trains"
    },
    {
      "id": 73,
      "text": "it staff to ensure they become a maintain high performing employees. And the final one is success"
    },
    {
      "id": 74,
      "text": "and scale, bring broad responsibility. So Amazon is a responsible employer that understands it's impact"
    },
    {
      "id": 75,
      "text": "on the world. Even though Amazon started out in a garage, it now realizes that it's huge and it's"
    },
    {
      "id": 76,
      "text": "impact impact on the world. These huge too. And that brings a lot of responsibility. So that"
    },
    {
      "id": 77,
      "text": "leadership principle means that Amazon takes its responsibility seriously. So let me now teach you"
    },
    {
      "id": 78,
      "text": "how to structure your answers to the Amazon leadership principles into your questions. So essentially,"
    },
    {
      "id": 79,
      "text": "during your Amazon interview, you will be asked a series of behavioral interview questions that are"
    },
    {
      "id": 80,
      "text": "focused on the 16 leadership principles. And there's a real cool way to structure your answers."
    },
    {
      "id": 81,
      "text": "It's a great way, learn this because it will help you to also memorize your answers."
    },
    {
      "id": 82,
      "text": "And it's called the Star Technique. So Star stands for Situation Task Action and Result. So you"
    },
    {
      "id": 83,
      "text": "start off your answer by explaining to the interview, to the interviewer, the situation you were"
    },
    {
      "id": 84,
      "text": "faced with. You then move on and briefly outline the task that needed doing. You then give"
    },
    {
      "id": 85,
      "text": "in-depth details about the action you took to achieve the task and you then finish off"
    },
    {
      "id": 86,
      "text": "and reveal the results following your actions. And the result should always be a positive outcome."
    },
    {
      "id": 87,
      "text": "So the Star Technique to be used when answering Amazon leadership principles, behavioral"
    },
    {
      "id": 88,
      "text": "interview questions is situation, task action and result. So let me now work through some"
    },
    {
      "id": 89,
      "text": "Amazon leadership principles, interview questions and examples that utilize the Star Technique."
    },
    {
      "id": 90,
      "text": "So the first question is describe your most difficult customer and how you handle them."
    },
    {
      "id": 91,
      "text": "Now this is based on the leadership principle of customer obsession. So Amazon, as I mentioned previously,"
    },
    {
      "id": 92,
      "text": "always puts its customer first in everything it does. It never focuses on the competition."
    },
    {
      "id": 93,
      "text": "So here's my example answer that uses a Star Technique. Here we go."
    },
    {
      "id": 94,
      "text": "Describe your most difficult customer and how you handle them."
    },
    {
      "id": 95,
      "text": "A customer contacted me one day to ask for a refund because they were not happy with their purchase."
    },
    {
      "id": 96,
      "text": "Now unfortunately they informed me they did not have a receipt and because they had paid cash"
    },
    {
      "id": 97,
      "text": "for the product. There was no way I could track their order. I apologized but explained that"
    },
    {
      "id": 98,
      "text": "I was not able to refund their order as this was against company policy. Now the customer"
    },
    {
      "id": 99,
      "text": "started to become angry and they threatened to leave a negative review online. It was my task"
    },
    {
      "id": 100,
      "text": "to remain calm and find a solution for the customer they were happy with. I maintained my"
    },
    {
      "id": 101,
      "text": "stance relating to the fact I could not refund their order. However, I suggested to the customer that"
    },
    {
      "id": 102,
      "text": "they could either have a replacement product or they could receive a credit note against a future"
    },
    {
      "id": 103,
      "text": "purchase. I then asked several questions about the type of product they wanted before suggesting"
    },
    {
      "id": 104,
      "text": "alternative products we had available that would be more suited to their needs. Eventually the"
    },
    {
      "id": 105,
      "text": "customer calmed down and agreed to exchange their purchase for a product they really wanted."
    },
    {
      "id": 106,
      "text": "The customer then went online and left a glowing five-star review, citing my professionalism"
    },
    {
      "id": 107,
      "text": "and attentiveness whilst dealing with their situation. That's a really good example answer."
    },
    {
      "id": 108,
      "text": "It's a specific situation I was in when dealing with a difficult customer. I explained how I handled"
    },
    {
      "id": 109,
      "text": "them. That uses a star technique and you can see there how effective the starting technique is"
    },
    {
      "id": 110,
      "text": "Now don't go anywhere because I still have more questions and answers to give you"
    },
    {
      "id": 111,
      "text": "that are brilliant preparation for your Amazon interview. But when you're ready you can click"
    },
    {
      "id": 112,
      "text": "the link in the top right hand corner of the video head through to my website pastmaintv.com"
    },
    {
      "id": 113,
      "text": "and you can download my full set of Amazon leadership principles interview questions"
    },
    {
      "id": 114,
      "text": "and brilliant example answers including the ones we are working through together today. But"
    },
    {
      "id": 115,
      "text": "here's an next question. Given example of a time when you went above and beyond to meet a deadline"
    },
    {
      "id": 116,
      "text": "now this is focused on the leadership principle of deliver results. Remember deliver results is a"
    },
    {
      "id": 117,
      "text": "simple leadership principle but very important nonetheless always deliver on time"
    },
    {
      "id": 118,
      "text": "and to the right standard. Here's my example answer that utilizes the star technique."
    },
    {
      "id": 119,
      "text": "Given example of a time when you went above and beyond to meet a deadline here we go."
    },
    {
      "id": 120,
      "text": "In my last role I was working on an important project for a company client. Now the project"
    },
    {
      "id": 121,
      "text": "team consisted of six people however, two thirds of the way through the project two team members"
    },
    {
      "id": 122,
      "text": "went off sick with COVID. This situation had the potential to delay the project by several weeks"
    },
    {
      "id": 123,
      "text": "but this was something I wasn't prepared to allow happen. It was my task to come up with a solution"
    },
    {
      "id": 124,
      "text": "to the problem. I re-evaluated the project goals and determined that some of the work could be"
    },
    {
      "id": 125,
      "text": "outsourced to online contractors. This proved to be a shrewd move because the contractors I ended up"
    },
    {
      "id": 126,
      "text": "hiring had exceptional skills and they were able to improve the quality of project work that was"
    },
    {
      "id": 127,
      "text": "being delivered. For the remainder of the project I also agreed to commit to extra working hours"
    },
    {
      "id": 128,
      "text": "each evening to ensure it was completed on time. I ended up working an additional 17 hours in the"
    },
    {
      "id": 129,
      "text": "evenings leading up to the project deadline to make sure it was finished on time until they expected"
    },
    {
      "id": 130,
      "text": "standard. Now because of this experience I also learned the skill of hiring outsourcers"
    },
    {
      "id": 131,
      "text": "which we utilized in the company on future projects. As a number really good answer it shows"
    },
    {
      "id": 132,
      "text": "that you make sure you deliver results as per the leadership principle and you also learn a new"
    },
    {
      "id": 133,
      "text": "skill along the way which is a great one because it shows that you are always learning another really"
    },
    {
      "id": 134,
      "text": "important leadership principle at Amazon. The next Amazon leadership principle interview"
    },
    {
      "id": 135,
      "text": "question I want to work through is tell me about a time when you helped a team or company"
    },
    {
      "id": 136,
      "text": "to save money. So this is about through Galatie. Remember Amazon wants its employees to not just help"
    },
    {
      "id": 137,
      "text": "grow the business but help it to save money too. This is a difficult question but here's my"
    },
    {
      "id": 138,
      "text": "example answer to help you. Tell me about a time when you helped a team or company to save money."
    },
    {
      "id": 139,
      "text": "Here's my response that uses that star technique here we go. In my previous role I was concerned"
    },
    {
      "id": 140,
      "text": "about how much we were spending on delivery costs. Every day we were sending out hundreds of orders"
    },
    {
      "id": 141,
      "text": "to customers but our delivery company did not appear to be providing value for money. It was my task"
    },
    {
      "id": 142,
      "text": "to evaluate our delivery expenses to see if I could save the company money. I spent the next"
    },
    {
      "id": 143,
      "text": "three hours conducting an analysis of the past 12 months delivery costs and I was staggered"
    },
    {
      "id": 144,
      "text": "at how expensive they were. Now even though the number of orders we were sending out via our"
    },
    {
      "id": 145,
      "text": "delivery company had literally doubled their prices had increased by a third. So I decided to call"
    },
    {
      "id": 146,
      "text": "the delivery company area manager to explain my concerns and to negotiate a fairer price."
    },
    {
      "id": 147,
      "text": "After a half hour on the telephone outlining my concerns he agreed to reduce the delivery fees"
    },
    {
      "id": 148,
      "text": "back to their previous price for the next 12 months which ended up saving the company more than"
    },
    {
      "id": 149,
      "text": "$5,000 in total. That's a great example answer. It shows that you take ownership another leadership"
    },
    {
      "id": 150,
      "text": "principle. It shows that you care about the company because you are finding ways to help save money"
    },
    {
      "id": 151,
      "text": "and increase company profits. Great answer. Here's the next question. Give an example of a"
    },
    {
      "id": 152,
      "text": "time when you didn't see I2I with a work calling. This is a trick you want. So this is based on the"
    },
    {
      "id": 153,
      "text": "leadership principle of a backbone, disagree and commit. So remember, Amazon is fine to disagree"
    },
    {
      "id": 154,
      "text": "and have an opinion and if you think something's wrong you should speak up but you must commit to"
    },
    {
      "id": 155,
      "text": "the agreed way of working. Here's my example answer to help you. Give an example of a time"
    },
    {
      "id": 156,
      "text": "when you didn't see I2I with a work colleague. Here we go. I was in a team meeting discussing the"
    },
    {
      "id": 157,
      "text": "launch of a new company product. Now a colleague of mine was adamant the best way for us to promote"
    },
    {
      "id": 158,
      "text": "the product was through local newspaper adverts. I disagreed. It was my task to explain using"
    },
    {
      "id": 159,
      "text": "facts and evidence why the best way to promote the new product would be through online advertising."
    },
    {
      "id": 160,
      "text": "After listening to his arguments for promoting the product in local newspapers I explained that we"
    },
    {
      "id": 161,
      "text": "had a better chance of converting sales by targeting people online by age, gender, demographics and"
    },
    {
      "id": 162,
      "text": "interests. I showed him an example of how a company had been able to surpass all previous company"
    },
    {
      "id": 163,
      "text": "launches by shifting their advertising online. I also explained that we could track the return on"
    },
    {
      "id": 164,
      "text": "advertising investment if we advertised online. Something that was not possible using newspaper"
    },
    {
      "id": 165,
      "text": "adverts. After listening to my reason argument he agreed my suggestion was more beneficial to the"
    },
    {
      "id": 166,
      "text": "new product launch you did a 37% increase in sales compared with previous launches."
    },
    {
      "id": 167,
      "text": "As a great example of that Amazon leadership principle have backbone, disagree and then commit."
    },
    {
      "id": 168,
      "text": "So you are saying that you disagree with him and you are explaining why you think that's not the"
    },
    {
      "id": 169,
      "text": "best way to proceed using facts and evidence and you are then persuading the person to choose"
    },
    {
      "id": 170,
      "text": "your way forward. You are all then committing and there is a brilliant outcome for the company"
    },
    {
      "id": 171,
      "text": "in terms of that 37% increase in sales. It's a great example. Now this is another Amazon leadership"
    },
    {
      "id": 172,
      "text": "principle interview question that comes up a lot. It's a difficult one to answer. What is your"
    },
    {
      "id": 173,
      "text": "favorite Amazon leadership principle? Well you have 16 to choose from. Here's how I would personally"
    },
    {
      "id": 174,
      "text": "answer this question. What is your favorite Amazon leadership principle? Here we go. My favorite"
    },
    {
      "id": 175,
      "text": "leadership principle is customer obsession. I decided I wanted to work for Amazon after buying"
    },
    {
      "id": 176,
      "text": "many products from your website. Your levels of customer service were always outstanding and I was"
    },
    {
      "id": 177,
      "text": "hugely impressed with your speed of delivery. This made me realise that so many companies out there"
    },
    {
      "id": 178,
      "text": "have it wrong when it comes to customer service. They appear to focus too much on their competitors"
    },
    {
      "id": 179,
      "text": "instead of focusing on their customers. If a company focuses on their customers they won't need to"
    },
    {
      "id": 180,
      "text": "worry about competitors because customers will stay with them for the long term. Now whilst all"
    },
    {
      "id": 181,
      "text": "of the leadership principles are very important, Amazon would be nothing without the customer and"
    },
    {
      "id": 182,
      "text": "that's the reason why it is my first choice. That's a great answer and you are explaining the reasons"
    },
    {
      "id": 183,
      "text": "why you have chosen your particular Amazon leadership principle. So the next thing to do"
    },
    {
      "id": 184,
      "text": "don't forget to click the link in the top right-hand corner of the video right now. Head through"
    },
    {
      "id": 185,
      "text": "to my website, passmaintv.com and you can instantly download my full set of Amazon leadership principles,"
    },
    {
      "id": 186,
      "text": "interview questions and example answers. It's a fantastic resource you can have it in your inbox"
    },
    {
      "id": 187,
      "text": "literally within two minutes from now. I'm actually going to check that out. Don't forget to tell me"
    },
    {
      "id": 188,
      "text": "in the comments section below the video which job you are applying for at Amazon. I will also"
    },
    {
      "id": 189,
      "text": "give you another video to watch and learn from. Don't forget to subscribe to the channel."
    },
    {
      "id": 190,
      "text": "We'll see you all the best for passing your Amazon job interview. Have a great day."
    }
  ]
}